[{"id":"1770262045394362486","name":"李老师不是你老师","createdDate":"2024-03-20 09:32:16","content":"I go to work on time at 9 am every day. To be honest, on the one hand, I feel bad that taxpayers' money is wasted. On the other hand, I am glad that I have created some jobs in the era of economic downturn.","images":"/tweet/image/whyyoutouzhele/2024/03/20/1770262045394362486_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770376475692142782","name":"李老师不是你老师","createdDate":"2024-03-20 17:06:58","content":"On March 20, Chongqing Zhongliang Haicheng Nanshan Yunjing, unfinished building owners defended their rights","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770376475692142782_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770377043491832221","name":"李老师不是你老师","createdDate":"2024-03-20 17:09:13","content":"https://t.co/JcqBaeOUbY","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770377043491832221_0.jpg","hasPublished":true},{"id":"1770391286471614583","name":"李老师不是你老师","createdDate":"2024-03-20 18:05:49","content":"On the evening of March 9, in Minquan County, Shangqiu, Henan, a man beat two women at the front desk with a stick in a billiard room, and kept insulting them.\nOn March 19, the Minquan County Public Security Bureau issued a police report. After investigation, the suspect Zheng (male, 23 years old) had an argument with billiard hall staff Wu (female, 24 years old) and Wu (female, 22 years old) when checking out at the billiard hall, and then beat the two with a billiard cue. At present, the suspect Zheng has been detained according to law, and the case is being further handled.","images":"/tweet/image/whyyoutouzhele/2024/03/20/1770391286471614583_0.jpg","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770391286471614583_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770391644740661282","name":"李老师不是你老师","createdDate":"2024-03-20 18:07:15","content":"On the afternoon of March 19, an explosion occurred in a winery in Shuozhou, Shanxi. The scene was full of debris and in a mess. The Shuocheng District Work Safety Committee Office issued a notice on the 19th saying that the accident caused one death and one injury, and the cause of the accident is under further investigation.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770391644740661282_0.jpg,/tweet/video/whyyoutouzhele/2024/03/20/1770391644740661282_1.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770392997114343519","name":"李老师不是你老师","createdDate":"2024-03-20 18:12:37","content":"On the 19th, a delivery man said that because he was not doing well at work, he printed out the paper and posted it at the entrance of the community, then took a photo, tore it up and left.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770392997114343519_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770399099319099700","name":"李老师不是你老师","createdDate":"2024-03-20 18:36:52","content":"On March 19, Hu Xijin published an article to review the core socialist values. However, because there was no Mao Zedong portrait on Tiananmen Square in the accompanying picture, it caused dissatisfaction among many patriotic Vs and netizens.\nSome bloggers believe that Hu Xijin is definitely not a \"fool\" in politics, so he would insidiously express the filthiness deep in his heart.\nHu Xijin said in the article: \"Some people are biased towards one part, consciously or unconsciously despise or even oppose the other part, and deviate from the national policies. Including Lao Hu himself, let us encourage each other to fully understand and practice these 24 words.\"","images":"/tweet/image/whyyoutouzhele/2024/03/20/1770399099319099700_0.jpg,/tweet/image/whyyoutouzhele/2024/03/20/1770399099319099700_1.jpg,/tweet/image/whyyoutouzhele/2024/03/20/1770399099319099700_2.jpg,/tweet/image/whyyoutouzhele/2024/03/20/1770399099319099700_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770399337324916859","name":"李老师不是你老师","createdDate":"2024-03-20 18:37:49","content":"On March 20, the Civil Aviation Administration of China issued a report on the progress of the investigation of the March 21 Eastern Airlines MU5735 aircraft accident. According to the investigation, the flight crew and cabin crew of the accident flight held valid licenses and certificates, and the flight, duty and rest time met the regulations. The health examination before the flight on that day was passed, and the crew qualifications and configuration met the requirements; the airworthiness certificate of the accident aircraft was valid, and the qualifications of the relevant maintenance personnel met the requirements; no faults or abnormalities were found in the aircraft system, fuselage structure, engine, etc. before takeoff, and no faults were reserved; the qualifications of the relevant operation support personnel at the takeoff airport on the day met the requirements, the facilities and equipment worked normally, and the operations and operations were in accordance with the work procedures; the qualifications of the relevant air traffic control personnel met the requirements, the communication, navigation and monitoring equipment worked normally, and there were no abnormalities in the radio communication and control command before the accident. There was no dangerous weather report in the airspace and flight altitude of the route where the aircraft was located at the time of the accident; the loading of the accident flight met the requirements, and no dangerous goods were declared...","images":"/tweet/image/whyyoutouzhele/2024/03/20/1770399337324916859_0.jpg,/tweet/image/whyyoutouzhele/2024/03/20/1770399337324916859_1.jpg","videos":"","hasFullContentTranslated":false,"fullContent":"3月20日，民航局发布关于3.21东航MU5735航空器飞行事故的调查进展情况通报。经调查，事发航班飞行机组及客舱机组持有效执照、证件，飞行、执勤、休息时间满足规定，当日飞行前健康体检合格，机组资质及配置符合要求；事发飞机适航证件有效，相关维修人员资质符合要求；起飞前未发现飞机系统、机身结构、发动机等存在故障或异常情况，无故障保留；起飞机场当日相关作业保障人员资质符合要求，设施设备工作正常，作业和操作符合工作程序；相关空中交通管制人员资质符合要求，通信导航监视设备工作正常，事发前无线电通信和管制指挥未见异常，事发时飞机所在空域及航路飞行高度层无危险天气报告；事发航班装载符合要求，无申报为危险品的货邮，无证据表明货邮和行李中存在危险品。","hasPublished":true},{"id":"1770408507235336447","name":"李老师不是你老师","createdDate":"2024-03-20 19:14:15","content":"On March 20, a stabbing incident occurred in front of the Jiarunfu Supermarket on Dongfeng Street in Anhua County, Hunan Province. The incident took place only 50 meters away from the Malu Town People's Government.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770408507235336447_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770429321015927215","name":"李老师不是你老师","createdDate":"2024-03-20 20:36:57","content":"Yang Ruohui @WesterAOC, founder of the Canadian Citizens Association\nIn recent years, he has gradually become active in democratic movements and protest movements around the world, becoming a representative figure among the new generation of protesters.\nHow did he, a post-00s student, transform from a \"little pink\" studying abroad to a new generation of democracy movement leader?\nWhat inspired him to step out of the underground and establish the Citizens Association in Canada?\nWhat does he think about the differences between the old and new democratic movements...","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770440967134363829","name":"李老师不是你老师","createdDate":"2024-03-20 21:23:14","content":"Chairman of the CPPCC of Dongkou County, Hunan Province, was arrested for soliciting prostitution\nOn March 20, it was reported online that Yin Moulong, Chairman of the CPPCC of Dongkou County, Hunan Province, was detained by the police on suspicion of soliciting underage girls.\nOuyang Youchun, Chairman of the Standing Committee of the People's Congress of Dongkou County, said in an interview with a media reporter: \"According to the public security report, the online rumor of soliciting underage girls is not true. The other party is soliciting prostitution, and the target is over 14 years old.\"","images":"/tweet/image/whyyoutouzhele/2024/03/20/1770440967134363829_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770450082388684815","name":"李老师不是你老师","createdDate":"2024-03-20 21:59:27","content":"On March 20, the father of Wang Ziyao, the victim of the Handan murder of three minors, posted a video saying that he supports what teacher Han Hong said and demands a public trial, a nationwide suspension of classes, and that all students should watch it. This is more meaningful than the first lesson of the new semester.\nThe video has been removed from the platform","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770450082388684815_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770461092268876009","name":"李老师不是你老师","createdDate":"2024-03-20 22:43:12","content":"March 20 (Released) In Wuhan, Hubei, a group of owners whose houses were forcibly demolished gathered outside the People’s Government of Qiaokou District, shouting “Return the houses” to defend their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770461092268876009_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770463271608328296","name":"李老师不是你老师","createdDate":"2024-03-20 22:51:52","content":"On March 19, in Yamei Village, Wenshangji Town, Chengwu County, Shandong Province, a large number of villagers gathered at the village committee to defend their rights because they were dissatisfied with the demolition conditions given by the government.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770463271608328296_0.jpg,/tweet/video/whyyoutouzhele/2024/03/20/1770463271608328296_1.jpg,/tweet/video/whyyoutouzhele/2024/03/20/1770463271608328296_2.jpg,/tweet/video/whyyoutouzhele/2024/03/20/1770463271608328296_3.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770466760061313201","name":"李老师不是你老师","createdDate":"2024-03-20 23:05:43","content":"March 19, Botou City, Hebei Province. After Zhaogutun Village sold its land, the villagers did not get paid and went to the municipal government to defend their rights","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770466760061313201_0.jpg,/tweet/video/whyyoutouzhele/2024/03/20/1770466760061313201_1.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1770467347410694631","name":"李老师不是你老师","createdDate":"2024-03-20 23:08:03","content":"On March 20, a junior student from Shaanxi Railway Engineering Vocational and Technical College went missing, and his parents went to the school to seek redress.","images":"/tweet/image/whyyoutouzhele/2024/03/20/1770467347410694631_0.jpg","videos":"/tweet/video/whyyoutouzhele/2024/03/20/1770467347410694631_0.jpg,/tweet/video/whyyoutouzhele/2024/03/20/1770467347410694631_1.jpg","hasFullContentTranslated":true,"hasPublished":true}]