[
  {
    "id": "1744063316941521104",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 02:27:52",
    "content": "Teachers no longer have a \"iron rice bowl\"\nOn January 7, Beijing Daily reported that Fengtai District of Beijing explored the establishment of a teacher exit mechanism.\nIn recent days, Beijing has seen a series of salary cuts for bus drivers and changes in social security subsidies for flexible employment personnel. Now teachers' \"iron rice bowls\" are no longer guaranteed.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744063316941521104_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744068008320877020",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 02:46:31",
    "content": "On January 5, at Amphenol Electronics Factory in Siming District, Xiamen City, Fujian Province, a cigarette butt was found in the Muslim canteen, causing dissatisfaction among Hui workers in the factory and demanding an explanation.\nDuring the incident, the angry workers poured tea on a canteen manager.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744068008320877020_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744069781953654988",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 02:53:33",
    "content": "On January 7, homeowners of Qianhai Tianjing Community in Shenzhen, Guangdong, protested their rights. The homeowners accused the developer of cutting corners and forcing the handover of the property before the public areas were completed.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744069781953654988_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744071775309242470",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 03:01:29",
    "content": "Follow-up of the incident\nIn the early morning of January 8, the company involved, Beijing Neox Technology Co., Ltd., issued a statement: Apologizing to the public for the inappropriate remarks made by the female employee Jing in the video, and has now ordered her to suspend her work, reflect on herself, and be dealt with seriously.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744071775309242470_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744282746845802828",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 16:59:48",
    "content": "The Yongji Zhuangyuan Mansion in Zhanhe District, Pingdingshan City, Henan Province has been unfinished for more than 10 years. Homebuyers blocked the road in front of the Zhanhe District Letters and Calls Office to defend their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744282746845802828_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744289753283940716",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 17:27:39",
    "content": "On January 8, the Finance Department of Guangxi Normal University issued a notice stating that because the treasury system of the Autonomous Region Finance Department has not yet been opened, treasury indicators have all been issued, and it is currently impossible to pay wages for January 2024. \nThe notice was later deleted.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744289753283940716_0.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744289753283940716_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744294930984411414",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 17:48:13",
    "content": "On January 8, Evergrande Auto issued an announcement on the Hong Kong Stock Exchange stating that the company's executive director Liu Yongzhuo has been criminally detained for suspected illegal activities.\nAfter the news was released, Evergrande Auto's stock price plummeted, with the largest drop reaching 20% as of press time.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744294930984411414_0.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744294930984411414_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744299643112923298",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 18:06:57",
    "content": "Recently, CCTV Spring Festival Gala was once again exposed for suspected plagiarism.\nSome netizens found that the theme song of the Spring Festival Gala preview program \"I Want to Go to the Spring Festival Gala\" was extremely similar to \"Senbonzakura\" by Japan's Hatsune Miku, which sparked discussion among netizens.\nAt the same time, many professional bloggers also analyzed the two songs and found that not only did they \"sound alike\", their arrangement structures were also very similar.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744299643112923298_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744309004119986343",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 18:44:08",
    "content": "\"Exasperated\"\nOn January 7, the Central Commission for Discipline Inspection and the National Supervisory Commission, together with many national media, criticized the \"US ban on corrupt officials and their families from all countries entering the country\" for highlighting the hypocrisy of the US anti-corruption campaign.\nThis triggered ridicule from netizens: \"Such a big reaction shows that this is their core interest in their hearts.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744309004119986343_0.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744309004119986343_1.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744309004119986343_2.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744311050034426332",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 18:52:16",
    "content": "\"Historical newspapers have no practical significance\"\nOn January 7, Tianjiao.com's Weibo account posted a photo of the front page of the People's Daily in the 1980s, with the headline \"The CPC Central Committee issued an instruction: insist on less publicity of individuals.\" This sparked discussion among netizens.\nOn January 8, Tianjiao.com's Weibo homepage showed that it had been banned, and its blue V certification was also removed.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744311050034426332_0.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744311050034426332_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744317225702392218",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 19:16:49",
    "content": "On January 8, the official WeChat public account of the Beijing Municipal Bureau of Justice, Jingsi Guanlan, published an article stating that in response to the use of the Airdrop function on the subway to spread and deliver illegal content, a Beijing judicial appraisal institute claimed that they had cracked the encrypted fields of mobile phone numbers and email addresses in the Airdrop transmission principle, so that they could quickly extract the mobile phone number and email address of the Airdrop sender from the sender's mobile phone, and successfully helped the public security organs identify multiple suspects.\nDuring the Sitong Bridge incident in October 2022, there were many incidents in which people in many places relayed the Sitong Bridge slogans through Airdrop on the subway.\nIn November 2022, Apple took the lead in restricting Airdrop in China. Users cannot set it to be turned on for a long time for everyone. The maximum time for each opening is 10 minutes, and then it will be automatically turned off.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744317225702392218_0.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744317225702392218_1.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744317225702392218_2.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744317225702392218_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744318597218902144",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 19:22:16",
    "content": "January 7, Chongqing. Youyang No. 1 Middle School forced students to buy the product \"Shengxue eNetcom\" from Hangzhou Mingshi Education Technology Development Co., Ltd., charging 580 yuan per person. The teacher said that homework would be assigned on this platform in the future.\nAfter a parent refunded the money, a teacher at the school actually checked the list of refunded students through the platform administrator and tracked down which parent reported it in the group.\nOn January 8, the Education Committee of Youyang Autonomous County issued a statement saying that the product usage fee is 580 yuan for three years, and it is voluntary. The school does not force students and parents to buy it.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744318597218902144_0.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744318597218902144_1.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744318597218902144_2.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744320210515980791",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 19:28:40",
    "content": "January 7, Luohe, Henan. A suspected human trafficker tied up a girl's hands and feet and threw her off an electric bike and was discovered by citizens.\nAccording to the photographer, the pink-clad auntie tied the girl's hands and feet and put her on the back seat of the electric bike. The girl broke free and tried to escape, but was pinned to the ground by the auntie.\nSomeone noticed something was wrong and started shouting, which attracted a large number of onlookers. The auntie wanted to run but was stopped, and her accomplice ran away without even the bike. Citizens at the scene called the police.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744320210515980791_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744320309094686750",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 19:29:04",
    "content": "https://t.co/eF1n3WLi9d",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744320309094686750_0.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744320309094686750_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744326680716415094",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 19:54:23",
    "content": "On January 8, the Bao'an District, Shenzhen City\nSubdistrict Office went to the Taiwan-funded enterprise South China International Leasing Company and expressed the hope that Taiwanese people could return to Taiwan to vote, and suggested voting for a designated political party.\n(To ensure the safety of the contributors, the relevant pictures will not be displayed to the public)",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744326856667468070",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 19:55:05",
    "content": "In recent days, I have received similar incidents from many places in Fujian and Guangdong, but I have not sent them out due to lack of evidence. If any netizens want to provide such information in the future, please remember to bring supporting evidence.",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744337453878517860",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 20:37:11",
    "content": "The male employee involved in the firing of a male employee by a female executive in Beijing responded:\nThe suspension of the female executive Jing was a cover-up. She was a Tsinghua classmate of the company's big boss and they had a very close relationship. She returned to work after a while.\nThe cause of the conflict was that he questioned the company's management and R&D process, which was irregular.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744337453878517860_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744340719123185717",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 20:50:10",
    "content": "\"New Year's Blessings\"\nOn January 8, Glodon, a leading domestic engineering software company, verbally notified all employees of the company that their year-end performance would be reset to zero without any formal documents, triggering widespread discussion among Internet practitioners.\nSeveral Glodon employees told Mr. Li that this year-end bonus is actually part of the salary. It is stated in your employment offer and labor contract that 20% to 30% of the annual salary will be used as the year-end bonus, which will be distributed uniformly before the Lunar New Year. Now executives are cashing out stocks in order to achieve profits and maliciously canceling everyone's year-end bonus.\nThen the Office of the President's Office of Glodon issued an \"Open Letter to All Employees\" in response: Since the company's operating results in 2023 did not meet expectations, Glodon decided to adjust its performance bonus policy to adapt to the current operating conditions. Considering that the previous decision did have a significant impact on all partners, the company will provide corresponding incentives to employees based on performance results. The company's management team is responsible for the overall operating results, and the company's management team has an annual bonus of zero. At the same time, Glodon called on all employees to understand the current predicament and overcome the difficulties together.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/08/1744340719123185717_0.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744340719123185717_1.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744340719123185717_2.jpg,/tweet/image/whyyoutouzhele/2024/01/08/1744340719123185717_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1744342953189908896",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 20:59:03",
    "content": "January 8, Jiaxing, Zhejiang. Nanhu Construction owed workers wages, and the workers went to the construction site to demand their wages. The workers accused the local police station of not only not helping the workers, but also following them closely to prevent them from causing trouble. \"Don't they care about our hard-earned money?\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744342953189908896_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744343141665136712",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 20:59:47",
    "content": "On January 8, a large number of workers from Jiangsu Xinyi New Town Wuyue gathered at the sales office to demand their rights and wages.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744343141665136712_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744346707230380291",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 21:13:58",
    "content": "\"I cried while laughing\"\nRecently, netizens made a comparison of the performance of the Chinese and American stock markets in 2023, and added the \"Wolf Warrior\" remarks of the Ministry of Foreign Affairs this year, which resonated with netizens in the barrage: I cried while laughing.\nOn January 8, 2024, A shares closed at 2887.54, and the battle to defend 2900 points was launched again.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744346707230380291_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744373171321524479",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-08 22:59:07",
    "content": "On January 8, Henan Radio and Television reported that a class teacher at Henan Suixian Senior High School asked students to swear an oath: \"If you don't study, your whole family will die, first your father, then your mother.\" The local education bureau said: The school is investigating",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/08/1744373171321524479_0.jpg",
    "hasPublished": true
  }
]