[
  {
    "id": "1877029703657328645",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-09 00:28:49",
    "content": "Recently, in Shenzhen, Guangdong, a man named Shi Jiaokun posted a video saying that the Xuzhou police went to Shenzhen for deep-sea fishing and robbed the company property of his eldest son Wang Wei and second son Shi Yihua. Because the Shenzhen police refused to cooperate with the Xuzhou police in the arrest, the Xuzhou police followed Wang Wei and secretly arrested him in the suburbs. After receiving the alarm, the Shenzhen police stopped it in time, so the Xuzhou police failed.\nIn order to convict the two, the Xuzhou police copied a file called \"Grand Theft Auto\" to the hard drive of Wang Wei's company, claiming that it was a data file of Wang Wei's company and accused them.\nDuring the case, the Xuzhou police kept asking Wang Wei and Shi Yihua for 500,000 yuan. Because they only paid 100,000 yuan, they were retaliated by the Xuzhou police and the files were heavily modified.\nThe court sentenced Wang Wei to 7 years in prison and Shi Yihua to 4 years in prison based on the false evidence produced by the Xuzhou police. And the company's property was also confiscated by the court.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2025/01/09/1877029703657328645_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 237,
    "replies": 45,
    "retweets": 47,
    "views": 43280,
    "originVideos": "https://video.twimg.com/ext_tw_video/1877029339549818880/pu/vid/avc1/408x720/pEGzxxDvqjUBW1a-.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1877040742344045019",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-09 01:12:41",
    "content": "The incident of Dang Changxin, a student at Pucheng Vocational School, falling from a building has attracted attention. An insider said that before falling from the building, Dang Changxin was bullied by many classmates, and one of the bullies was suspected to be the principal's nephew. Dang Changxin was suspected to have been pushed down the building after being bullied. After the incident, the head teacher confiscated the student's mobile phone and deleted the video. The school principal fled early, leaving the vice principal and director to take over.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2025/01/09/1877040742344045019_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 12,
    "replies": 6,
    "retweets": 2,
    "views": 1463,
    "originVideos": "https://video.twimg.com/ext_tw_video/1877037619634384899/pu/vid/avc1/488x1084/uZQrwK7nJLLix31T.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]