[{"id":"1821313923523715414","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 06:34:12","content":"After the women's 100-meter sprint at the Olympics, Afghan athlete Kimia Yusofyi showed the world the slogan she wrote on the back of her number plate: \"Education, Sports, Our Rights\"","images":"/tweet/image/whyyoutouzhele/2024/08/08/1821313923523715414_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1821314820244676677","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 06:37:46","content":"Real-name reporting.\nChongqing Judicial Bureau officials and judges in Putian, Fujian.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/08/1821314820244676677_0.jpg,/tweet/video/whyyoutouzhele/2024/08/08/1821314820244676677_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1821342389404905745","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 08:27:19","content":"On August 8, a blogger said that a pharmaceutical company in Shanxi cooperated with funeral homes in many places to purchase corpses of people aged 20 to 60 who died of non-diseases. The purchased corpses would be roughly cut up, and some bones would be used to make biological tissue materials and sold to hospitals. This case was investigated by the Criminal Investigation Bureau of the Ministry of Public Security and involved Changchun, Shanxi, Sichuan, Guangxi and other places. In Sichuan alone, there were thousands of corpses involved, the amount involved was more than 300 million yuan, and more than 70 defendants were involved.","images":"/tweet/image/whyyoutouzhele/2024/08/08/1821342389404905745_0.jpg,/tweet/image/whyyoutouzhele/2024/08/08/1821342389404905745_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1821498188081094749","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 18:46:24","content":"On August 8, due to the broken capital chain of the Land King Group in Luozhuang District, Linyi City, Shandong Province, the rent repayment was in arrears for a long time. The owners collectively took action to protect their rights at the Baoli Fortune Plaza under the Land King Group.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/08/1821498188081094749_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1821500462090096703","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 18:55:26","content":"On August 8, Weibo CEO Wang Gaofei said that Weibo's bank account was directly frozen by the police in a county in Guangdong because a user sued Weibo for deducting several thousand yuan from him the day before yesterday. As a result, all payments to suppliers and partners this week were postponed for a week.","images":"/tweet/image/whyyoutouzhele/2024/08/08/1821500462090096703_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1821506365065412835","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 19:18:54","content":"On August 8, after Beijing Youth Daily criticized \"throwing eggs\" three times, Xinhua Daily issued three rebuttals: exaggeration, insufficient evidence, and inversion of cause and effect, to justify \"throwing eggs\".\nThe article particularly emphasized that this is the shrewdness of Zhejiang people - \"throwing eggs\" can also \"throw\" new tricks and new economy.\n\"Throwing eggs\" was previously popular in Jiangsu, Zhejiang and Anhui. A rumor circulating in the streets is that after Xi Jinping's \"Zhijiang New Army\" entered the central government, \"throwing eggs\" began to become popular in the national officialdom.","images":"/tweet/image/whyyoutouzhele/2024/08/08/1821506365065412835_0.jpg,/tweet/image/whyyoutouzhele/2024/08/08/1821506365065412835_1.jpg,/tweet/image/whyyoutouzhele/2024/08/08/1821506365065412835_2.jpg,/tweet/image/whyyoutouzhele/2024/08/08/1821506365065412835_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1821511233821925418","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 19:38:14","content":"On August 8, villagers in Nankeng Town, Luxi County, Pingxiang City, Jiangxi Province, reported that Nankeng Forest Farm was illegally occupied and cut down trees indiscriminately for profit, which seriously damaged the normal lives of local villagers.\nThe villagers said that they actively participated in the tree planting work in the hope of receiving poverty alleviation subsidies, but the subsidies were never issued to the villagers, but instead went into the pockets of local officials.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/08/1821511233821925418_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1821514829162488283","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 19:52:32","content":"On August 8, CCTV-5 released a statement from the China Anti-Doping Center, accusing the United States of systematically using doping without being adequately tested by international testing agencies. \nIt called on international agencies to increase anti-doping testing of American athletes during the Paris Olympics.","images":"/tweet/image/whyyoutouzhele/2024/08/08/1821514829162488283_0.jpg,/tweet/image/whyyoutouzhele/2024/08/08/1821514829162488283_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1821517799073649017","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 20:04:20","content":"August 8, Chengdu. Shareholders who bought Guanghui Auto stocks went to Guanghui headquarters to defend their rights, and expressed dissatisfaction with the one-yuan delisting rule of the A-share market, and accused Guanghui Auto of maliciously delisting without any rescue measures.\nOn July 17, the company issued an announcement stating that the closing price of the company's stock was less than 1 yuan for 20 consecutive trading days, reaching the trading delisting indicator.\nSince 2015, Guanghui Auto's market value has shrunk by about 92.36%.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/08/1821517799073649017_0.jpg,/tweet/video/whyyoutouzhele/2024/08/08/1821517799073649017_1.jpg,/tweet/video/whyyoutouzhele/2024/08/08/1821517799073649017_2.jpg,/tweet/video/whyyoutouzhele/2024/08/08/1821517799073649017_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1821522811367600147","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-08 20:24:15","content":"From 2015 to 2021, Li Mouqiang, deputy chief physician of the Liver Disease Center of the Affiliated Hospital of Qingdao University, Shandong Province, dismembered the body in advance and stored it in a refrigerator. He contacted Li Mouyuan of Shanxi Aorui Company by phone, and Li Mouyuan and others transported the dismembered body back to Shanxi Aorui Company for a total of 5 times. Li Mouqiang sold more than 10 human skeletons, each priced between 10,000 and 22,000 yuan. Li Mouyuan and others identified Li Mouqiang and confirmed that he had been to the Affiliated Hospital of Qingdao University to contact Li Mouqiang to purchase human skeletons.\nAt about 14:00 on August 8, a staff member of the Affiliated Hospital of Qingdao University told The Paper that the organ transplant center could not find the doctor Li Mouqiang, nor could it find his specific medical information.\nPublic information shows that Li Mouqiang was once the deputy director of the Liver Disease Center of the Affiliated Hospital of Qingdao University. He is currently the deputy director of the Organ Transplant Center of the Affiliated Hospital of Qingdao University, the director of the Intensive Care Unit of the Organ Transplant Center, and the organ donation and transplant management...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/08/1821522811367600147_0.jpg,","hasFullContentTranslated":false,"fullContent":"2015年至2021年期间，山东青岛大学附属医院肝脏病中心副主任医师李某强事先将遗体肢解后，放入冷柜保存，电话联系山西奥瑞公司的李某源，由李某源等人将肢解后的尸体运回山西奥瑞公司，共5次。李某强共出售10余具人体骨骼原料，每具价格1万-2.2万元不等。李某源等人对李某强进行辨认，确认去过青岛大学附属医院与李某强对接购买人体骨骼原料。\n8月8日14时许，青岛大学附属医院一名工作人员向澎湃介绍，器官移植中心搜不到李某强这个医生，也查不到他具体的出诊信息。\n公开资料显示，李某强曾任青岛大学附属医院肝脏病中心副主任，现为青岛大学附属医院器官移植中心副主任、器官移植中心重症监护室主任、器官捐献与移植管理办公室副主任。官网资料介绍，他长期从事危重病人监护及治疗，熟练掌握危重病人抢救治疗的各项技术，对肝移植病人的术前管理及术后监护治疗有丰富的经验。参与承担在研课题5项，其中山东省自然科学基金3项，科技攻关2项，主编专著3部，副主编1部。","hasPublished":true}]