[
  {
    "id": "1669989122260234240",
    "name": "李老师不是你老师",
    "createdDate": "2023-06-17 16:43:28",
    "content": "\"Pointing to a rat as a duck\" reversed again\nOn June 17, the Jiangxi Joint Investigation Team determined that the foreign object in the food of Jiangxi Industrial Vocational and Technical College was a rat head.",
    "images": "/tweet/image/whyyoutouzhele/2023/06/17/1669989122260234240_0.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1669989122260234240_1.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1669989122260234240_2.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1669989122260234240_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/huzE3bG9HK",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1670046729306009600",
    "name": "李老师不是你老师",
    "createdDate": "2023-06-17 20:32:22",
    "content": "Netizen contribution\n[A woman exposed the sky-high barbecue prices, was accused of spreading rumors and defaming Changsha, and swallowed the confession in public]\nJune 13, Changsha, Hunan. A woman released a video exposing the sky-high barbecue prices in Changsha, saying that this is particularly common in Changsha, and she hopes to bring down the price of Changsha barbecue.\nAccording to the woman's subsequent description, someone from the Cyberspace Administration of China contacted her to meet the next afternoon, but was rejected by the woman. That night, the woman released another video to expose that the sky-high barbecue prices in Changsha were not isolated cases.\nThen on the third day, the Public Security Bureau, the Cyberspace Administration of China and other law enforcement officers came to the woman's house twice to assist in the investigation. During the investigation, they asked her whether she wanted to be famous, whether she accepted royalties, whether she deliberately defamed, etc.\nAfter the woman denied it, the police threatened that \"if you don't cooperate, we will investigate your parents.\"\nThe woman was then locked in a \"small room\" and the police said she would be detained for two days. During this period, the woman was sent to the hospital due to gastroenteritis and bipolar disorder. In a daze, she heard people around her saying that there were too many negative news about Changsha barbecue recently, and someone needed to take the blame. As long as the woman admitted to spreading rumors, they could ask the platform to remove all videos and at the same time deter other people who said that Changsha barbecue was expensive.\nLater, someone sent a document, saying that as long as she stamped it, she could go home. It clearly read \"Admit to spreading rumors and maliciously smearing Changsha.\"\nThe woman said she was unwilling to sign, and the other party said that if she didn't sign, she would continue to waste time with her. Then the woman swallowed the \"confession\" on the spot and was immediately sent for gastric lavage. After that, all law enforcement officers disappeared.\nAfter the gastric lavage, the police sent a mobile phone to her, saying \"the matter is over.\"\nOn June 17, the woman published a long article describing the incident. (See the comment section)",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/06/17/1670046729306009600_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1670047209050472449",
    "name": "李老师不是你老师",
    "createdDate": "2023-06-17 20:34:17",
    "content": "The woman's full account of her experience 1",
    "images": "/tweet/image/whyyoutouzhele/2023/06/17/1670047209050472449_0.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1670047209050472449_1.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1670047209050472449_2.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1670047209050472449_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/IaKA8xRgEo",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1670047369562316802",
    "name": "李老师不是你老师",
    "createdDate": "2023-06-17 20:34:55",
    "content": "The woman's full account of her experience 2",
    "images": "/tweet/image/whyyoutouzhele/2023/06/17/1670047369562316802_0.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1670047369562316802_1.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1670047369562316802_2.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1670047369562316802_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Jv8NXmNaPK",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1670047572147286016",
    "name": "李老师不是你老师",
    "createdDate": "2023-06-17 20:35:43",
    "content": "The woman's full account of her experience 3",
    "images": "/tweet/image/whyyoutouzhele/2023/06/17/1670047572147286016_0.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1670047572147286016_1.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1670047572147286016_2.jpg,/tweet/image/whyyoutouzhele/2023/06/17/1670047572147286016_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/cCBt859Sya",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1670048554142904320",
    "name": "李老师不是你老师",
    "createdDate": "2023-06-17 20:39:37",
    "content": "@Mln3Moto Public Security Bureau Auxiliary Police, Cyberspace Administration of China, Market Supervision Administration",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  }
]