[
  {
    "id": "1744829574309982336",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 05:12:42",
    "content": "On January 9, traffic police from Guanghan, Deyang, Sichuan, got into an argument with a woman while dismantling an electric bike shed along the street and arrested her.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1744829574309982336_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744831883211325478",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 05:21:53",
    "content": "On the evening of January 9, Changsha Hengguang International Garden.\nThe increase in property parking fees caused dissatisfaction among the owners. After several attempts to resolve the issue failed, the owners finally chose to take to the streets to protest and defend their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1744831883211325478_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744832115982614587",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 05:22:48",
    "content": "https://t.co/8Lk6CmpT0c",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1744832115982614587_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744833839657046060",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 05:29:39",
    "content": "A shocking question: Why do many people with a monthly income of 2,000-5,000 RMB not admit that they are middle class? Where does their sense of vulnerability come from?\nNetizen’s answer: People with a monthly income of 2,000-5,000 RMB ask me where my sense of vulnerability comes from. How cruel....",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1744833839657046060_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744858807837065369",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 07:08:52",
    "content": "A blogger was asked to read a message promoting the beautiful Xinjiang every few minutes during a live broadcast because he complained about the high prices in Xinjiang.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1744858807837065369_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1744918483962392826",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 11:06:00",
    "content": "On January 9, Beijing Sinovac Biotech issued a notice that, given that the company's new crown vaccine has been completely discontinued and the company currently has no new crown vaccine products for sale, the company has decided to suspend the payment of performance-based wages for the new crown project starting this month.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1744918483962392826_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745001885935738886",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 16:37:24",
    "content": "On January 8, the famous government-backed WeChat account \"Ye Ping\" reposted an article: \"Sino-US relations exist in name only.\"\nThe article said, \"The collapse of the United States is a matter of time, and the end is inevitable.\"\n\"The death of the United States has entered the countdown.\" \"Sino-US relations began with Kissinger and will end with Kissinger.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745001885935738886_0.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745001885935738886_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745003948631605458",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 16:45:36",
    "content": "It is worth mentioning that the “Secret History of Tsai Ing-wen” that was recently forwarded by a large number of robots in the private messages of Twitter bloggers was also posted on Yeping.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745003948631605458_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745006396083417139",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 16:55:20",
    "content": "\"Untouchable\"\nOn January 10, a netizen said that he had a refund dispute with a gym and went to Xiaohongshu to find a solution. Xiaohongshu said that he could use the National Bureau of Letters and Calls mini program to complain. As a result, after he complained, he went on a business trip to Beijing and was stopped by the Letters and Calls Bureau with a dozen police officers at the high-speed rail station to verify what he was doing in Beijing.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745006396083417139_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745008025520218527",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 17:01:48",
    "content": "On January 8, a woman suddenly entered a hot pot restaurant in Lushan, Jiangxi, and splashed the boiling hot pot soup on the face of a woman at the next table, causing chaos at the scene.\nThe police said that the woman was suspected of having mental problems, had a history of mental illness, and could not be stimulated. The two did not know each other, and their family members, as guardians, would bear the medical expenses of the injured woman.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1745008025520218527_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745012415266169129",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 17:19:15",
    "content": "On January 9, a notice was circulated online from Gongjiacao Community, Zhifang Street, Yang County, Shaanxi Province, stating that \"returnees must report for the Spring Festival.\" From January 8 to February 20, 2024, all returnees (residents of the community) will be screened and summarized daily, and report to the community at 15:30 every day. \nAfterwards, CCTV reprinted the \"Yang County Release\" to publish a statement saying that due to the staff's misunderstanding and the issuance of an inappropriate notice, misunderstandings were caused, and the community has been ordered to revoke the notice.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745012415266169129_0.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745012415266169129_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745012944193093916",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 17:21:21",
    "content": "On January 10, China Business News published another Chongta editorial titled \"The Rule of Law Economy is the Best Market Economy\". The article states that the rule of law economy is the best market economy, especially for the private economy. To strengthen the rule of law in the private economy, first of all, it is necessary to clean up the fragmentation of private economic development policies. At present, there are many policies issued by various places regarding the development and protection of the private economy, but they are still at a relatively low level, resulting in the lack of rigidity, authority, and enforcement of the rule of law for the development of the private economy, and more randomness in the acts that infringe on the interests of private enterprises. Therefore, it is necessary to clean up some of the past policies and regulations that have less enforcement power, arbitrary enforcement, and general talk, and put an end to selective law enforcement and \"self-innocence\" supervision for enterprises. It is also necessary to summarize effective support measures, fix them in the form of law, enhance their enforcement, see more practical effects of the rule of law, and create good and stable expectations for the development of the private economy.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745012944193093916_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745017160445964338",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 17:38:06",
    "content": "According to a report on January 8, a shoe merchant in Daxi Town, Wenling, released a video saying that local ZTO Express employees were selling the merchant's express delivery at low prices in the live broadcast room.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1745017160445964338_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745022421382352897",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 17:59:00",
    "content": "January 8, Siping, Jilin. Due to the cold weather, a designated driver went to the bank's ATM room to take shelter and get warm. As a result, he was driven away by the bank's surveillance camera after just two minutes, and was insulted: \"Damn designated driver, is this your home?\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1745022421382352897_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745023470835032133",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 18:03:11",
    "content": "On January 10, the owners of Qilu Plastic City in Linzi District, Zibo City protested and held banners to protect their rights due to the problem of random parking charges.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745023470835032133_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745023658328785129",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 18:03:55",
    "content": "On January 8, in Langzhong, Sichuan, a traffic policeman was criticized by citizens for hiding in a dark corner to conduct fishing enforcement.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1745023658328785129_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745024172965630254",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 18:05:58",
    "content": "Netizen contribution\nHow did the municipal investment company lose money?",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745024172965630254_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745027874652881127",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 18:20:41",
    "content": "In recent days, there have been rumors of major cheating in the art unified examinations in Shandong, Gansu, and Henan provinces.\nShandong candidates said that there was a phenomenon of judges secretly changing the scores\nGansu candidates said that there was a phenomenon of early leakage of test questions\nHenan candidates said that there was a phenomenon of changing the test papers, and some people openly sold the scores in the group.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745027874652881127_0.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745027874652881127_1.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745027874652881127_2.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745027874652881127_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745028465764524402",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 18:23:01",
    "content": "On January 10, in Daqing City, Heilongjiang Province, thousands of local parents went to the city government gate to protest against the migration of Henan college entrance examination candidates to Daqing, which squeezed out Daqing's educational resources. Fierce shoving and pushing occurred at the scene.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1745028465764524402_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745028678000545810",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 18:23:52",
    "content": "Mobilization letter issued by parents",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745028678000545810_0.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745028678000545810_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745033872943784273",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 18:44:31",
    "content": "On January 10, Wang Yi said that the determination of 1.4 billion Chinese people to promote national reunification is as firm as a rock. Encountered a big fall from grace\nTwenty thousand netizens in the comment area wrote in unison, \"Civilization will surely defeat evil!\"\n\"Civilization will definitely unify evil!\"\n\"Where there is people's happiness, there is civilization!\"\n\"People of Taiwan, please keep up the good work!\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1745033872943784273_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745042731326419243",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 19:19:43",
    "content": "Netizens added",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745042731326419243_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745052795370119241",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 19:59:42",
    "content": "Recently, a white-collar worker in Qingdao posted that he participated in 106 nucleic acid tests and support work in Chengyang District, Qingdao from March to December 2022. As a result, he was disqualified from internal evaluation and commendation by his leaders because he reported nucleic acid test fraud in his real name.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745052795370119241_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745056733771321813",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 20:15:21",
    "content": "On January 8, Tianjin Construction Engineering General Contracting Company issued a notice to implement a \"phased holiday\" from January 15, during which a basic salary of 2,600 yuan per month will be paid. There is no resumption time in the document. \nEmployees said that they have not received performance bonuses since 2019, and their salaries have been reduced every year. They have been owed wages for 23 years for several months, so it is unlikely that they will resume work.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745056733771321813_0.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745056733771321813_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745069025405616131",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 21:04:12",
    "content": "People at the scene shouted \"Retreat\" and \"See the mayor\" in front of the government building.\nThe leader said that he hoped the people would elect representatives, but the people were united and said there were no representatives.\nThen the leader said that the mayor would receive everyone at the petition office and hoped that everyone would go to the petition office and not block the city government. He promised not to elect representatives, give an answer on the spot, and solve the problem in the morning.\nBut the people disagreed, and then there was a shoveling. Parents reminded each other \"Parents should not use force\", and some parents scolded the police.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1745069025405616131_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745071020141162952",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 21:12:07",
    "content": "Afterwards, the parents rushed to the door of the government building and negotiated with the officials on site.\nThe parents said that they had gone to the petition office yesterday (9th), and the Education Bureau had promised to suspend the naturalization of foreign students, but it was still being processed today, so they came here.\nWhen the parents asked whether they were still processing the school registration for foreign students at this moment, the official lowered his head and played with his mobile phone without saying anything.\nLater, another official said that the city had suspended the processing of school registration today, so please rest assured",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/10/1745071020141162952_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745072360414216387",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 21:17:27",
    "content": "A 13-year-old student at Shanghai Private Wenqi School was bullied at school and was asked by his class teacher to write a self-criticism. Faced with the unfair treatment, he was so angry and grief-stricken that he jumped from the 27th floor of his home on January 5. On January 10, his parents went to the school to defend their rights.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745072360414216387_0.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745072360414216387_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745079101268873295",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 21:44:14",
    "content": "Contribution from the staff of the Commission for Discipline Inspection: It is best not to report in real name at the county level, as it will bring disaster to your family. Reporting is meaningless, and the name of the reporter will be leaked to the person being reported. Anonymous reporting will not be asked, and real-name reporting will be investigated in reverse.\n\nHello, Mr. Li, I would like to tell you about the work of the Commission for Discipline Inspection in a county in the west. We receive more than a dozen reports every day, including anonymous emails and telephone reports. I would like to say that telephone reports will be investigated. The report letter I sent to you is an anonymous email report letter, which we basically do not investigate because it involves the Standing Committee of our county.\n\nIf there is a phone call, we will verify the phone number based on the clues of the problem to find the reporter. Here I would like to say that there is a lot of room for operation, and the illegal behavior of the reporter will also be investigated. Therefore, it is best to make it public to cause public opinion influence so that the county will deal with it accordingly if it wants to conceal it. The basic treatment is just a talk, and there is no substantial treatment.\n\nThe report letter said that there is an insider in the Commission for Discipline Inspection, which sounds scary, but it is too common in actual work. It is very common for wives to tip off their husbands, and husbands to tip off their sisters. In the background, they will definitely track down the informants and retaliate. We basically know the people in the report letters. They all spent 100,000 yuan each to get in, and they all want to get their money back as soon as possible.\n\nWe don’t know the situation of other county discipline inspection committees. The situation in our county is that they basically don’t investigate. Instead, they will reversely investigate the informants. Our staff can only bury their heads in work and listen to the leaders’ orders. I think that in China, county-level governments are now the most corrupt. Due to the large administrative authority of the region, it is basically impossible to investigate. They are all relatives, and family power has a great influence in the county-level political system. The relationship between who is related to whom in that agency is very complicated, and basically no investigation will be conducted. To put it bluntly, it is a cover-up. On the contrary, whoever reports will be investigated, and there may be revenge. County-level units are all small officials, but they are all aware of corruption. This is a fact. Family relationships have extraordinary influence at the county level. Many industries are monopolized by family power.\n\nThis letter of complaint is an example. The colleagues in the Discipline Inspection Commission all know the problem. Everyone is transferring benefits. Any funds that can be taken from the treasury are collusion of benefits. So I advise you not to report in real name at the county level, which will bring disaster to your family. The county government agencies and political ecology are the most complicated in China. You have to spend money to get promoted to a good unit. The two brothers and sisters in the complaint letter both paid to get into the Political and Legal Affairs Commission and the Organization Department. This is common sense in the county. No one thinks there is anything wrong. Maybe we have long been accustomed to it and basically ignore all the complaint letters. To be honest, there is no point in reporting, and the name of the reporter will be leaked to the person being reported. If this is considered an insider, then the entire county government agency is an insider.\n\nNo matter how strong the central government's anti-corruption efforts are, it is all just a process at the grassroots level because it cannot be investigated further. The two safeguards and the four consciousnesses are just slogans. What they consider behind the scenes is the distribution of interests. Therefore, it is normal for government officials and their relatives to collude to defraud state demolition funds, and it is difficult to investigate. The amounts are large, ranging from millions to hundreds of thousands. Therefore, many people do not know that a lot of demolition funds are obtained by collusion with each other to legally defraud state funds. I want to tell you that reporting at the county level is basically useless. I would rather they report to the Central Commission for Discipline Inspection. In this way, the top leader will be very scared and it will be possible to investigate.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745079101268873295_0.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745079101268873295_1.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745079101268873295_2.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745079101268873295_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745085091791913053",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-10 22:08:02",
    "content": "On January 10, after the Hefei migrant workers documentary on NetEase News was deleted, Yicai.com followed up by publishing \"Migrant Workers Waiting for Work on the Roadside in the Early Morning\" to record the living conditions of migrant workers in Zhengzhou and continue to speak out for the grassroots migrant workers.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/10/1745085091791913053_0.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745085091791913053_1.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745085091791913053_2.jpg,/tweet/image/whyyoutouzhele/2024/01/10/1745085091791913053_3.jpg",
    "videos": "",
    "hasPublished": true
  }
]