[
  {
    "id": "1878114569023033671",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-12 00:19:41",
    "content": "Shanghai Minhang: Support Hongqiao International Central Business District Enterprises to Facilitate Access to the International Internet\nOn January 8, the Shanghai Minhang District Government issued the \"Key Task Division Plan\", Article 7 of which mentioned: \"Support the business district to establish a cross-border data service center, support business district enterprises to facilitate access to the international Internet. Upgrade the international Internet dedicated channel\" and other contents, clarifying the division of responsibilities for the implementation of Shanghai Minhang District.",
    "images": "/tweet/image/whyyoutouzhele/2025/01/12/1878114569023033671_0.jpg,/tweet/image/whyyoutouzhele/2025/01/12/1878114569023033671_1.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 78,
    "replies": 28,
    "retweets": 4,
    "views": 24971,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1878118728166203722",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-12 00:36:13",
    "content": "On January 10, China Medical Insurance published an article: Recently, someone has sung a swan song for original research drugs. It is time for the original research drug concept to withdraw from China! The withdrawal of original research drug companies from the Chinese market means that their product cost performance cannot meet China's current requirements, so they are abandoned by the Chinese market.",
    "images": "/tweet/image/whyyoutouzhele/2025/01/12/1878118728166203722_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 52,
    "replies": 27,
    "retweets": 7,
    "views": 16404,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]