[{"id":"1857099985491255739","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 00:35:14","content":"On November 11, when the second trial of Xu Shuangjun's gang-related case opened, the judge attempted to conduct the trial without the defense lawyers. Lawyers Yang Xiao and Wang Xingwei were not allowed to enter the court. They could only enter the court during the recess and asked the judge to immediately stop this illegal trial. The judge decided to adjourn the court immediately after seeing the two. The bailiffs forced to turn off all power supplies, calling it a power outage maintenance. The lawyers waiting to argue with the judge used their mobile phones to illuminate the court in the Hebi Intermediate Court.\nOn the morning of November 14, the court resumed, and the two were again turned away. When filming and describing the process of being deprived of the right to defend, lawyer Wang Xingwei was controlled by the bailiffs and was also pretended to fall and hit by the bailiffs. He was taken to the police station and was released in the evening.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857099985491255739_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857099985491255739_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857099985491255739_2.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857099985491255739_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857102870534865131","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 00:46:42","content":"Xinhua News Agency investigates journalists being beaten. On November 14, Xinhua News Agency newspaper Economic Information Daily reporters Wang Wenzhi and Cheng Zilong were beaten and their cell phones were snatched while interviewing at the construction site of China Railway Seventh Bureau of Hefei-Xinyi High-speed Railway in Anhui. The on-site video shows that a person in charge at the scene said to the camera that he had seized the reporter's cell phone, and the beating of the reporter might also be done by his subordinates. When faced with the reporter's question \"Can we leave?\" the person in charge said, \"I have arrested the person (reporter), I have arrested the scene, can I let you go?\"\nIt is understood that on November 12, the Economic Information Daily published an investigative report \"Elastic cushion layer \"opens as soon as it is cut\", Hefei-Xinyi Railway construction materials \"substituting inferior materials for good materials\" pose safety hazards\", revealing that many construction units of the Hefei-Xinyi Railway (Hefei to Xinyi) illegally replaced the \"EPDM elastic cushion layer\" with \"recycled rubber imitations\" that did not meet the railway industry standards in order to save costs...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857102870534865131_0.jpg,/tweet/video/whyyoutouzhele/2024/11/15/1857102870534865131_1.jpg,","hasFullContentTranslated":false,"fullContent":"新华社调查记者被打。11月14日，新华社报刊《经济参考报》的记者王文志、程子龙在安徽合新高铁中铁七局施工现场采访时被打，手机被抢夺。现场视频显示，一位现场的负责人对着镜头称，记者手机是他扣的，殴打记者可能也是他的下属干的。而面对记者质问“我们可以走了吗？”该负责人则称，“我逮到人（记者）了，我逮到现场了，我能让你走吗？”\n据了解，11月12日，《经济参考报》刊发调查报道《弹性垫层“一割就开”，合新铁路建设材料“以次充好”存安全隐患》一文，揭露了合新铁路（合肥至新沂）多家施工单位为节省成本，以次充好，违规将“三元乙丙橡胶弹性垫层”偷换为不符合铁路行业标准的“再生胶仿制品”，这些仿冒品性能远低于设计要求，存在安全隐患。\n对此，中铁七局回应称，将配合警方调查。","hasPublished":true},{"id":"1857156200493912337","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 04:18:37","content":"On November 14, a Chinese man graffitied in Chinese on the Serbian monument SAHAT KULA, asking everyone to follow his Douyin account.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857156200493912337_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857156200493912337_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857200816291262633","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 07:15:54","content":"https://t.co/5f4ZbHI5qJ","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857200816291262633_0.jpg,/tweet/video/whyyoutouzhele/2024/11/15/1857200816291262633_1.jpg,","hasPublished":true},{"id":"1857201254683771110","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 07:17:38","content":"https://t.co/ynfMZ7xrdw","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857201254683771110_0.jpg,","hasPublished":true},{"id":"1857201335969468809","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 07:17:58","content":"https://t.co/slrCez6u8t","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857201335969468809_0.jpg,","hasPublished":true},{"id":"1857220470648762864","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 08:34:00","content":"On November 11 (Release), the owners of Zhonghai Huaishang Jingming Community protested against the developer's false propaganda and deception of consumers. It is reported that when selling the property, the developer deceived consumers, claiming that the newly built primary school next to the property is the East Campus of Huai'an Experimental Primary School. Therefore, parents spent the money of the \"first-tier\" school to purchase school district housing, but now they are told that their children can only go to the nearby Chengde Road Primary School (an old primary school) to go to school.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857220470648762864_0.jpg,/tweet/video/whyyoutouzhele/2024/11/15/1857220470648762864_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857224900882358360","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 08:51:36","content":"On November 14, students from the Central University of Finance and Economics in Beijing launched a call for help on the Internet. The reason was that Zhou Yuchen, a senior girl from the school, accidentally fell to the ground while riding an electric bike when passing the intersection of Yaojiayuan Road and Huawen West Road in Chaoyang District between 8:20 and 8:40 on the morning of November 13, and was later crushed to death by a police car.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857224900882358360_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857224900882358360_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857224900882358360_2.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857224900882358360_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857243874617372881","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 10:07:00","content":"October 31, Xi'an, Shaanxi. Villagers of Guangdamen Village asked the government for transitional fees for demolition. It is understood that the village has been demolished for seven years, and the transitional fees have not been paid for one year and eight months. In addition to Guangdamen Village, there are many demolished villages in Xi'an that are owed transitional fees. It is understood that Lijiajie Village has not paid transitional fees for seven years, Yanxiazhang Village has not paid transitional fees since July last year, and Sanzhao Village has not even signed a transitional fee agreement.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857243874617372881_0.jpg,/tweet/video/whyyoutouzhele/2024/11/15/1857243874617372881_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857266272624390511","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 11:36:00","content":"November 4, Chaozhou, Guangdong. In the Longwan Village Committee of Sucheng Town, Raoping County, the village secretary Wu had a fierce verbal and physical conflict with several villagers over land acquisition compensation. One of the elderly was beaten and hospitalized. It is understood that since 1999, more than 3,000 acres of land in the village have been expropriated for factory and dock construction. Previously, the village promised to pay them 200 yuan per person per year in land acquisition compensation, but so far, each of the more than 8,000 villagers in the village has only received 1,200 yuan.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857266272624390511_0.jpg,/tweet/video/whyyoutouzhele/2024/11/15/1857266272624390511_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857283636774723984","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 12:45:00","content":"On November 9, Yongzhou, Hunan. The owners of Chuangfacheng protested against the property management and sued the owners. It is reported that the property management service of the community is extremely chaotic, the access control and surveillance are just for show, the trees and flowers are not watered, and the water, electricity and gas are often out of order. The owners refused to pay the property management fees due to poor property management, so the property management took the owners to court.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857283636774723984_0.jpg,/tweet/video/whyyoutouzhele/2024/11/15/1857283636774723984_1.jpg,/tweet/video/whyyoutouzhele/2024/11/15/1857283636774723984_2.jpg,/tweet/video/whyyoutouzhele/2024/11/15/1857283636774723984_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857289676639625471","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 13:09:00","content":"On November 11, in Loudi, Hunan, property owners of the Jinyuxingcheng community in Yuxugong community took to the streets to demand their property certificates.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857289676639625471_0.jpg,/tweet/video/whyyoutouzhele/2024/11/15/1857289676639625471_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857307040986648855","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 14:18:00","content":"November 11, Yiwu, Zhejiang. Construction workers in Bajiaokan Village, Futian Subdistrict, hold banners to demand their wages.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857307040986648855_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857339724219957566","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 16:27:52","content":"November 14, Xianyang, Shaanxi. Qian County Public Security Bureau issued the \"Notice on Collection of Clues on Internal Corruption Crimes in Small, Medium and Micro Private Enterprises\"\n A netizen replied, \"Without the ability to fish in the ocean, are you starting to eat grass on the edge of your nest?\"","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857339724219957566_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857339724219957566_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857345749492945280","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 16:51:49","content":"On November 14, in Yueyang County, Hunan, a notice from the village committee of Bajiao Village, Maotian Town, was circulated online: For those who have not paid for medical insurance, the village committee will not stamp their medical insurance and handle all related procedures, and will not consider year-end hardship care. If a party member does not pay for medical insurance, he or she will be treated as a party member who has quit the party.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857345749492945280_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857347544382386590","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 16:58:57","content":"On November 14, Serbia. It was revealed online that someone left a striking graffiti signature in Chinese on an ancient clock tower in the country's capital: \"Follow an unknown person on Douyin\"\nAfterwards, someone found the person who carved the words through the Douyin account on the wall. The other party said, \"Next time I go to the top of the pyramid, do you think this is okay?\"\nNetizens responded: This is a foreigner pretending to be a Chinese to smear, and Chinese people would never do such a thing.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857347544382386590_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857347544382386590_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857347544382386590_2.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857347544382386590_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857349916450074809","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 17:08:22","content":"Recently, a device called \"Pangu Stone Evidence Machine\" appeared at the Zhuhai Air Show. The photographer said that when the mobile phone is connected to the device with a data cable, all the data in the mobile phone will be displayed, whether it is Android Hongmeng or iOS18, it can be cracked in the locked screen state.\nAfterwards, a big V blogger consulted the company CEO, who said: \"Nonsense, self-media\" Such a device does exist, but iOS cannot be cracked without an unlock password.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857349916450074809_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857349916450074809_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857349916450074809_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857354554628886635","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 17:26:48","content":"Recently, at the Zhuhai Air Show, a company called \"Zhaobang Intelligence\" promoted its \"Group Emotion Detection and Early Warning\" product at the exhibition, sparking heated discussions.\nAccording to the company's official website: The camera collects the behavior, gait, facial expressions, and vestibular vibration images of people, and calculates them to identify people with abnormal emotions. It is suitable for military, schools, prisons and other places.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857354554628886635_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857354554628886635_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857354554628886635_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857355360061001772","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 17:30:00","content":"On November 10, in Qingyuan, Guangdong, owners of Country Garden Jiangshan No. 1 put up banners to protest the developer for handing over the property without gas supply.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857355360061001772_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857356518901063806","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 17:34:36","content":"November 14, Hangzhou, Zhejiang. An employee of the Zhejiang branch of China Construction Fifth Engineering Bureau was photographed and reported for always having a bitter face at the construction site. If the rectification is not made within the time limit, a penalty of 500 yuan per day will be imposed according to the contract.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857356518901063806_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857362450414256441","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 17:58:10","content":"According to Taiwan media TVBS: Bo Xilai's son Bo Guagua arrived in Taiwan secretly recently. It is reported that he came to marry the granddaughter of Xu Wenzheng, the founder of Luodong Boai Hospital. The wedding is expected to be held in Taiwan.\nTVBS said that Bo Guagua and Xu Wenzheng's granddaughter met when they were studying abroad. Bo Guagua went to Yilan today to meet the girl's parents.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857362450414256441_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857362450414256441_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857363357315035592","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 18:01:47","content":"On November 15, Meituan Bike and Hellobike announced that they would suspend operations in Zhengzhou starting from the 15th.\nAt the same time, Zhengzhou residents found that Qingju Bike was no longer available.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857363357315035592_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857363357315035592_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857363357315035592_2.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857363357315035592_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857367181929148505","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 18:16:59","content":"November 14 (Released) Beijing. A man outside the Beijing High People's Court kept spinning a black and white cardboard in his hand to protest the court's reversal of black and white.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857367181929148505_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1857369750223110342","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 18:27:11","content":"On November 14, the well-known \"positive energy blogger A Bao\" wrote: I think China should fight a war. Just one war can solve China's overcapacity and deflation problems. Once the war starts, industries such as steel will be fully utilized, and with China's strength, it will definitely become richer and richer. \"Am I a little extreme?\" Other bloggers replied: This is not extreme, it is the call of the militarist soul.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857369750223110342_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857369750223110342_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857378244229738954","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 19:00:56","content":"On November 14, the Ministry of Public Security said: \"my country has become one of the countries with the lowest incidence of gun and explosive violence in the world,\" which triggered ridicule from netizens.\nNetizens replied: \"Should cars be banned? 35 dead and more than 40 injured\"\n\"Korean Central News Agency: North Korea has become the safest country in the world on the Internet\"","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857378244229738954_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857378244229738954_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857378244229738954_2.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857378244229738954_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857382372481876407","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 19:17:20","content":"November 15, Chongqing. The man posted that he was 35 years old and had previously worked in urban management. Due to the country's policy of streamlining administration and cleaning up non-staff personnel, he was fired after working for ten years.\nThe man said that he had difficulty finding a job after being fired, and he suspected that it might be because he had previously worked in urban management.\nNetizens replied \"You can go and set up a stall\"","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857382372481876407_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857382372481876407_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857382372481876407_2.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857382372481876407_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857388267890786470","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 19:40:46","content":"Another case of a Chinese person fleeing back to China after harming a child.\nAn American TikTok HR employee named Christina Liu pretended to be a mother on Xiaohongshu, and then strongly recommended her mother to others as a confinement nanny (the mother held a tourist visa).\nAs a result, her mother was exposed to abuse the child, including covering the mouth, throwing, covering the face with a quilt, slapping, etc., and the abused child was only ten days old.\nAfter being discovered by the employer, the woman and her husband sent her mother back to China overnight. The woman argued that her mother used her social account to post a post to find a confinement nanny without her knowledge.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857388267890786470_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857388267890786470_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857388267890786470_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857388267890786470_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857388589145092593","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 19:42:02","content":"https://t.co/gCCD51KyJH","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857388589145092593_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857388589145092593_1.jpg,","videos":"","hasPublished":false},{"id":"1857395087371862108","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 20:07:52","content":"October 11, Shaoguan, Guangdong. In Rucheng Town Primary School, a first-grade girl named Xiaoyan was burned by a senior boy with boiling water when she was turning on the water, causing Xiaoyan to suffer multiple burns. Because the boy was under the age of 14, he was not administratively punished.\nRecently, a father found a piece of paper in his daughter's schoolbag saying: If you dare to post a video on Douyin, your whole family will suffer\nThe father immediately showed his divorce certificate and said: When I put down my legal weapons, you won't even have a chance to speak","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857395087371862108_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857395087371862108_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857395087371862108_2.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857395087371862108_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857397438044090799","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 20:17:12","content":"On November 8, the Guangxi Zhuang Autonomous Region Education Department issued a document requiring an investigation into a game called \"Dream Back to the Tang Dynasty\"","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857397438044090799_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857397438044090799_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857397786607534377","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 20:18:35","content":"Hefei universities investigate students who rode to Chaohu Lake at night","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857397786607534377_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857400402712711316","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 20:28:59","content":"November 15 (Release) Shenzhen, Guangdong. A scene on the Shenzhen subway at 6am in the morning: a group of students were in the carriage, rushing to do their homework. This scene sparked heated discussions among netizens.\nNetizens replied, \"Who will save the Chinese children?\"\n\"Chinese people are tired all their lives\"","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857400402712711316_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857400402712711316_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857400402712711316_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857400402712711316_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857404291822264827","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 20:44:26","content":"On November 14, a blogger summarized the birth and death population data released by the Chinese government over the years.\nNetizens responded, \"It's okay, just don't release it later.\"\n\"So who caused the Chinese nation to perish?\"\n\"Family planning has achieved a great victory\"","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857404291822264827_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857404291822264827_1.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857404291822264827_2.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857404291822264827_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857408917405331763","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 21:02:49","content":"On November 13, a man posted a video complaining about local employees in Malaysia: When you assign tasks to them near the end of the day, they will get angry with you, leave at the end of the day, and not reply to messages sent to them on weekends. \"I think they do it on purpose.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857408917405331763_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857419097698631907","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 21:43:16","content":"November 15 (Released) Muscovites received text messages: Failure to report to the conscription office will result in restrictions on leaving the country and prohibition on real estate transactions, registration of individual entrepreneurs, international passports, loans and car registration.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857419097698631907_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857427785092128782","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 22:17:47","content":"On November 15, Qiushi magazine published an important article by General Secretary Xi Jinping entitled \"Supporting Chinese-style modernization with high-quality population development\"","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857427785092128782_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857430658689441793","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 22:29:13","content":"Reported on November 15, Ikebukuro, Tokyo. Chen Lifeng, the 32-year-old female owner of a Chinese-run sex shop \"Dream Paris\", was arrested because she hired 16 Chinese students (study visa) to provide sexual services in 16 rooms of the apartment. The annual turnover is 580 million yen (27 million yuan). Since the customers use WeChat and Alipay for transactions, no tax is paid. At present, her husband is still at large, and the Japanese police have issued a warrant for his arrest.","images":"/tweet/image/whyyoutouzhele/2024/11/15/1857430658689441793_0.jpg,/tweet/image/whyyoutouzhele/2024/11/15/1857430658689441793_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857435876214927797","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 22:49:57","content":"November 14, Guangdong. A lawyer with 20 years of experience in the police posted a video saying: No one can withstand torture, not even the police, let alone ordinary people.\nFor example, putting a plastic bag over your head to prevent you from breathing, electric shocking your private parts, and shining a light bulb on you to prevent you from sleeping. Especially in places where there is no audio or video recording, torture is the hardest hit area, and it is extremely difficult for victims to defend their rights in the later stage.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857435876214927797_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857442486291222977","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 23:16:13","content":"November 15, Funing, Yunnan. At the opening ceremony of the Funing No. 1 Middle School Art Festival, a boy spoke on stage to reflect that the school \"has money to build a thatched cottage but no money to build a dormitory.\" He said, \"Although I am very scared, I still want to speak.\" Then the boy's microphone was turned off, but the boy threw away the microphone and continued to speak. Seeing that the situation was under control, the teachers hurriedly carried the boy away. The boy shouted, \"I ask you what you are afraid of.\" The students in the audience applauded and cheered for him.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857442486291222977_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1857444698098741453","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-15 23:25:00","content":"The local Education and Sports Bureau: A psychological assessment will be conducted on the student. \"It is understood that the number of beds in the school dormitory far exceeds the number of students who used to live on campus.\" \"The thatched cottage is a place built by the school similar to a place for studying.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/15/1857444698098741453_0.jpg,","hasFullContentTranslated":true,"hasPublished":false}]