[{"id":"1863240408752615557","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:20","content":"November 30, Shandong. The blogger interviewed an uncle who was selling vegetables at a stall. The uncle said that he only earned one yuan today. He is a disabled person and can only crawl to grow vegetables. The uncle sighed: The people are too miserable. Food is not valuable, and they have to pay for cooperative medical care. It is tiring to come to this society. Currently, the comments on the video have been deleted to only 21.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863246194887237846","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:26","content":"On November 30, the Ukrainian army found a leaflet entitled \"Maintain the Last Honor\" from the Russian prisoners. The leaflet detailed instructions on how to choose the shooting position when the Russian soldiers committed suicide by shooting, and where to place the grenade when using it to commit suicide.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863253430036562127","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:31","content":"December 1 (Released) A senior high school student’s English test answer sheet was circulated online. In the composition column, he wrote in Chinese, “All reactionaries are paper tigers, the working class and the peasant class must lead everything” and “Abandon illusions and prepare for struggle”.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863265499662213356","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:37","content":"On November 25, Nehe, Heilongjiang. The Nehe New Rural Cooperative Fund Mutual Aid Cooperative ran away. One month has passed since the incident, and the depositors still have not got their money back. The depositors knelt down in front of the municipal government and begged the government to help the depositors get their hard-earned money back.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863266164253856002","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:42","content":"December 1, Taiyuan, Shanxi. Taihe Jinzunfu was left unfinished, and the owners shouted: \"See the leader\" to protect their rights. December 1 (Release) Fuzhou, Jiangxi. The Jiuyuefu building in front of the station primary school was left unfinished, and the owners stood on the roof and shouted: \"Black-hearted developer, return our hard-earned money\" to protect their rights.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863277966526206078","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 02:59:48","content":"December 1, Ruian, Zhejiang. Netizens found a large number of old letters in the \"Police Uncle Mailbox\" in the abandoned campus of Ruian Jinhu Experimental Primary School. A letter from a sixth-grade student named Chen was heartbreaking. She said in the letter that she was physically punished by the teacher and bullied by classmates. There were more than one such letters. In the end, no one read these letters. Afterwards, the police came to find the netizen, and he had to set the video to private for safety.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863278706283933826","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 02:59:53","content":"Correction: The video was shot at the Sanqiao Houba casual labor market in Guiyang.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863359876472213537","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 07:17:06","content":"December 1, Taizhou Marathon poster:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863406869722906644","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 10:18:41","content":"Netizen contribution December 1st At Yabuli West Station in Harbin, Heilongjiang Province, a driver backed up and fled during an official vehicle inspection. During the escape, the door of the car knocked down a law enforcement officer.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863408514821239041","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 10:33:54","content":"The sign of SAIC Volkswagen's Urumqi factory was removed, marking Volkswagen's official withdrawal from Xinjiang. The official reason given by Volkswagen Group for the closure was \"economic reasons\", but the media generally believed that it was due to human rights pressure.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863420334990606831","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 11:19:22","content":"Netizen submission December 1st, Hefei Feixi County, Hua Nan City Zijing Mingdu Phase 2, the old property refused to withdraw and clashed with the owner. Due to the poor management of the old property, the owner's committee decided to replace it with a new property, but the old property refused to leave, and then a conflict broke out. The conflict lasted from the evening of November 30th to the afternoon of December 1st. The contributor said: Submit this to Teacher Li and someone from above should come down to solve it","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863423524687487139","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 11:34:35","content":"Some netizens discovered that the Douyin account of former gymnastics world champion Wu Liufang had been unblocked and can now be followed normally. Within just one day after the unblocking, her Douyin account \"56seniorjie\" gained more than 2 million followers.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863428273600180406","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 11:49:48","content":"Written by a student: Our youth should not become a stepping stone for others to succeed.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863433578065093108","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 12:05:01","content":"Some netizens found that a large number of the reports pointed to a teacher named Yang Li. Many students said that Yang Li physically punished and insulted students. She hit the face of students who made mistakes with a book, and twisted the student's face with her hands until it turned purple. The victim wrote in the report letter in Figure 1: Yang Li allowed her classmates to call her nicknames such as pig shit and big nose, and was bullied because of her single-parent family. The students said that they had reported Yang Li's problems to the school, but the school did not care, and the school retaliated against the students who called the police","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863437546245829031","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 12:20:14","content":"According to the WeChat public account of Jinhu Experimental Primary School, Teacher Yang Li is a famous mathematics teacher of the school. An article published by the school on January 10, 2022 wrote: Teacher Yang Li shared the book \"Be a Reasonable Mathematics Teacher\" at the reading salon.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863445961139441841","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 13:05:42","content":"Netizen contributions: Beijing Daily's Theory 1Dot program is full of complaints in every episode. The title of the latest episode is \"my country is shifting from the stage of \"aging before getting rich\" to the stage of \"old and rich working together\". It says: The stage of \"aging before getting rich\" is shifting to the stage of \"old and rich working together\". This is a great change achieved in the context of my country's low starting point for economic development, a huge population base and an accelerating aging of the population. It is commendable.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863452362746278294","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 13:20:55","content":"December 1 (Released) Shandong. Wang Jinming said: In 1979, he, his brother and his mother were abducted and sold to Shandong by human traffickers. His mother tried to escape with him and his brother, but a woman from the same village informed them and the three of them were caught by human traffickers. The traffickers tied his mother to a tree and tortured her to death. The two brothers did not find their home until 2015, but their father had already died unjustly because of this incident, and the police continued to put pressure on them.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863455663294431555","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 13:36:08","content":"December 1 (Released) Shandong. Wang Mingjin said: In 1979, he, his brother and his mother were abducted and sold to Shandong by human traffickers. His mother tried to escape with him and his brother, but a woman from the same village informed them and the three of them were caught by human traffickers. The traffickers tied his mother to a tree and tortured her to death. The two brothers did not find their home until 2015, but their father had already died unjustly because of this incident, and the police continued to put pressure on them.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863465702868627797","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 14:21:36","content":"On the evening of December 1, a large number of people gathered in Dadun Village, Xintang Town, Guangzhou to protest against parking fees. Some people smashed the toll booths. A large number of special police went to the scene to maintain stability. It is reported that the village committee has contracted out all the parking spots in the village, and the contractors set up booths to collect fees. Local residents believe that the fees are too high, and the cars that were previously parked there must also pay additional fees, so they gathered to protest. Angry people surrounded the entrance of the police station, a man smashed the toll booth, and onlookers shouted \"Come on!\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863468272055963843","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 14:21:42","content":"On December 1, Biden pardoned his son Hunter before leaving office, saving Biden Jr. from prison for federal felony gun and tax convictions, while also reversing his past promise not to use the president's special powers to benefit his family. Biden said: I hope the American people can understand why a father, a president, would make this decision.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863473381330608296","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 14:52:02","content":"According to Modern Express, teacher Yang Li has been transferred to teach at Ruian Yumeng Primary School due to the demolition of the Jinhu School branch.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863503602695958789","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 16:53:08","content":"According to Forbes: Russian customs raised tariffs on some imported furniture accessories from China from zero to 55%. The Russian Association of Furniture and Woodworking Industry Enterprises warned that the measure would bankrupt furniture parts importers and increase domestic furniture prices by at least 15%. At present, China's mainstream media has not reported on this matter, and a blogger who forwarded the news was deleted by the platform.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863509531332055275","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 17:08:21","content":"On December 2, China's official media released the top ten buzzwords for 2024. Among them, pictures 1, 2, 3, and 9 (digitalization, intelligence for good, future industries, and silver power) were questioned by netizens for carrying private goods. Netizens replied: 1, 2, 3, and 9 were forced in by people with connections.","hasFullContentTranslated":true,"hasPublished":true}]