[{"id":"1863240408752615557","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:20","content":"November 30, Shandong. The blogger interviewed an uncle who was selling vegetables at a stall. The uncle said that he only earned one yuan today. He is a disabled person and can only crawl to grow vegetables. The uncle sighed: The people are too miserable. Food is not valuable, and they have to pay for cooperative medical care. It is tiring to come to this society. Currently, the comments on the video have been deleted to only 21.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863246194887237846","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:26","content":"On November 30, the Ukrainian army found a leaflet entitled \"Maintain the Last Honor\" from the Russian prisoners. The leaflet detailed instructions on how to choose the shooting position when the Russian soldiers committed suicide by shooting, and where to place the grenade when using it to commit suicide.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863253430036562127","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:31","content":"December 1 (Released) A senior high school student’s English test answer sheet was circulated online. In the composition column, he wrote in Chinese, “All reactionaries are paper tigers, the working class and the peasant class must lead everything” and “Abandon illusions and prepare for struggle”.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863265499662213356","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:37","content":"On November 25, Nehe, Heilongjiang. The Nehe New Rural Cooperative Fund Mutual Aid Cooperative ran away. One month has passed since the incident, and the depositors still have not got their money back. The depositors knelt down in front of the municipal government and begged the government to help the depositors get their hard-earned money back.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863266164253856002","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:42","content":"December 1, Taiyuan, Shanxi. Taihe Jinzunfu was left unfinished, and the owners shouted: \"See the leader\" to protect their rights. December 1 (Release) Fuzhou, Jiangxi. The Jiuyuefu building in front of the station primary school was left unfinished, and the owners stood on the roof and shouted: \"Black-hearted developer, return our hard-earned money\" to protect their rights.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863277966526206078","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 02:59:48","content":"December 1, Ruian, Zhejiang. Netizens found a large number of old letters in the \"Police Uncle Mailbox\" in the abandoned campus of Ruian Jinhu Experimental Primary School. A letter from a sixth-grade student named Chen was heartbreaking. She said in the letter that she was physically punished by the teacher and bullied by classmates. There were more than one such letters. In the end, no one read these letters. Afterwards, the police came to find the netizen, and he had to set the video to private for safety.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863278706283933826","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 02:59:53","content":"Correction: The video was shot at the Sanqiao Houba casual labor market in Guiyang.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863359876472213537","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 07:17:06","content":"December 1, Taizhou Marathon poster:","hasFullContentTranslated":true,"hasPublished":false}]