[{"id":"1863240408752615557","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:20","content":"November 30, Shandong. The blogger interviewed an uncle who was selling vegetables at a stall. The uncle said that he only earned one yuan today. He is a disabled person and can only crawl to grow vegetables. The uncle sighed: The people are too miserable. Food is not valuable, and they have to pay for cooperative medical care. It is tiring to come to this society. Currently, the comments on the video have been deleted to only 21.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863246194887237846","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:26","content":"On November 30, the Ukrainian army found a leaflet entitled \"Maintain the Last Honor\" from the Russian prisoners. The leaflet detailed instructions on how to choose the shooting position when the Russian soldiers committed suicide by shooting, and where to place the grenade when using it to commit suicide.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863253430036562127","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:31","content":"December 1 (Released) A senior high school student’s English test answer sheet was circulated online. In the composition column, he wrote in Chinese, “All reactionaries are paper tigers, the working class and the peasant class must lead everything” and “Abandon illusions and prepare for struggle”.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863265499662213356","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:37","content":"On November 25, Nehe, Heilongjiang. The Nehe New Rural Cooperative Fund Mutual Aid Cooperative ran away. One month has passed since the incident, and the depositors still have not got their money back. The depositors knelt down in front of the municipal government and begged the government to help the depositors get their hard-earned money back.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863266164253856002","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 24:58:42","content":"December 1, Taiyuan, Shanxi. Taihe Jinzunfu was left unfinished, and the owners shouted: \"See the leader\" to protect their rights. December 1 (Release) Fuzhou, Jiangxi. The Jiuyuefu building in front of the station primary school was left unfinished, and the owners stood on the roof and shouted: \"Black-hearted developer, return our hard-earned money\" to protect their rights.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863277966526206078","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 02:59:48","content":"December 1, Ruian, Zhejiang. Netizens found a large number of old letters in the \"Police Uncle Mailbox\" in the abandoned campus of Ruian Jinhu Experimental Primary School. A letter from a sixth-grade student named Chen was heartbreaking. She said in the letter that she was physically punished by the teacher and bullied by classmates. There were more than one such letters. In the end, no one read these letters. Afterwards, the police came to find the netizen, and he had to set the video to private for safety.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863278706283933826","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 02:59:53","content":"Correction: The video was shot at the Sanqiao Houba casual labor market in Guiyang.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863359876472213537","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 07:17:06","content":"December 1, Taizhou Marathon poster:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863406869722906644","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 10:18:41","content":"Netizen contribution December 1st At Yabuli West Station in Harbin, Heilongjiang Province, a driver backed up and fled during an official vehicle inspection. During the escape, the door of the car knocked down a law enforcement officer.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863408514821239041","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 10:33:54","content":"The sign of SAIC Volkswagen's Urumqi factory was removed, marking Volkswagen's official withdrawal from Xinjiang. The official reason given by Volkswagen Group for the closure was \"economic reasons\", but the media generally believed that it was due to human rights pressure.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863420334990606831","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 11:19:22","content":"Netizen submission December 1st, Hefei Feixi County, Hua Nan City Zijing Mingdu Phase 2, the old property refused to withdraw and clashed with the owner. Due to the poor management of the old property, the owner's committee decided to replace it with a new property, but the old property refused to leave, and then a conflict broke out. The conflict lasted from the evening of November 30th to the afternoon of December 1st. The contributor said: Submit this to Teacher Li and someone from above should come down to solve it","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863423524687487139","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 11:34:35","content":"Some netizens discovered that the Douyin account of former gymnastics world champion Wu Liufang had been unblocked and can now be followed normally. Within just one day after the unblocking, her Douyin account \"56seniorjie\" gained more than 2 million followers.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863428273600180406","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 11:49:48","content":"Written by a student: Our youth should not become a stepping stone for others to succeed.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863433578065093108","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 12:05:01","content":"Some netizens found that a large number of the reports pointed to a teacher named Yang Li. Many students said that Yang Li physically punished and insulted students. She hit the face of students who made mistakes with a book, and twisted the student's face with her hands until it turned purple. The victim wrote in the report letter in Figure 1: Yang Li allowed her classmates to call her nicknames such as pig shit and big nose, and was bullied because of her single-parent family. The students said that they had reported Yang Li's problems to the school, but the school did not care, and the school retaliated against the students who called the police","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863437546245829031","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 12:20:14","content":"According to the WeChat public account of Jinhu Experimental Primary School, Teacher Yang Li is a famous mathematics teacher of the school. An article published by the school on January 10, 2022 wrote: Teacher Yang Li shared the book \"Be a Reasonable Mathematics Teacher\" at the reading salon.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863445961139441841","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 13:05:42","content":"Netizen contributions: Beijing Daily's Theory 1Dot program is full of complaints in every episode. The title of the latest episode is \"my country is shifting from the stage of \"aging before getting rich\" to the stage of \"old and rich working together\". It says: The stage of \"aging before getting rich\" is shifting to the stage of \"old and rich working together\". This is a great change achieved in the context of my country's low starting point for economic development, a huge population base and an accelerating aging of the population. It is commendable.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863452362746278294","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 13:20:55","content":"December 1 (Released) Shandong. Wang Jinming said: In 1979, he, his brother and his mother were abducted and sold to Shandong by human traffickers. His mother tried to escape with him and his brother, but a woman from the same village informed them and the three of them were caught by human traffickers. The traffickers tied his mother to a tree and tortured her to death. The two brothers did not find their home until 2015, but their father had already died unjustly because of this incident, and the police continued to put pressure on them.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863455663294431555","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 13:36:08","content":"December 1 (Released) Shandong. Wang Mingjin said: In 1979, he, his brother and his mother were abducted and sold to Shandong by human traffickers. His mother tried to escape with him and his brother, but a woman from the same village informed them and the three of them were caught by human traffickers. The traffickers tied his mother to a tree and tortured her to death. The two brothers did not find their home until 2015, but their father had already died unjustly because of this incident, and the police continued to put pressure on them.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863465702868627797","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 14:21:36","content":"On the evening of December 1, a large number of people gathered in Dadun Village, Xintang Town, Guangzhou to protest against parking fees. Some people smashed the toll booths. A large number of special police went to the scene to maintain stability. It is reported that the village committee has contracted out all the parking spots in the village, and the contractors set up booths to collect fees. Local residents believe that the fees are too high, and the cars that were previously parked there must also pay additional fees, so they gathered to protest. Angry people surrounded the entrance of the police station, a man smashed the toll booth, and onlookers shouted \"Come on!\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863468272055963843","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 14:21:42","content":"On December 1, Biden pardoned his son Hunter before leaving office, saving Biden Jr. from prison for federal felony gun and tax convictions, while also reversing his past promise not to use the president's special powers to benefit his family. Biden said: I hope the American people can understand why a father, a president, would make this decision.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863473381330608296","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 14:52:02","content":"According to Modern Express, teacher Yang Li has been transferred to teach at Ruian Yumeng Primary School due to the demolition of the Jinhu School branch.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863503602695958789","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 16:53:08","content":"According to Forbes: Russian customs raised tariffs on some imported furniture accessories from China from zero to 55%. The Russian Association of Furniture and Woodworking Industry Enterprises warned that the measure would bankrupt furniture parts importers and increase domestic furniture prices by at least 15%. At present, China's mainstream media has not reported on this matter, and a blogger who forwarded the news was deleted by the platform.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863509531332055275","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 17:08:21","content":"On December 2, China's official media released the top ten buzzwords for 2024. Among them, pictures 1, 2, 3, and 9 (digitalization, intelligence for good, future industries, and silver power) were questioned by netizens for carrying private goods. Netizens replied: 1, 2, 3, and 9 were forced in by people with connections.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863513330809528680","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 17:23:34","content":"December 1, Shanghai. A man posted a video saying that he would not boycott any brand from now on. His monthly salary is so little, and Uniqlo is economical and of good quality. In contrast, the prices of domestic brands such as Li Ning and Anta, which are known as the pride of domestic products, are really expensive. Before we boycott others, we might as well clarify our own sanitary napkins, down jackets and other issues first. I would rather be slaughtered by the \"enemy\" than be stabbed by my own people.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863517564359561449","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 17:38:47","content":"On November 28, the public account \"Chun Yi Strategic Insight\" published an article stating that China's birth population in 2023 will be 9.02 million, which is lower than the most difficult years of the Anti-Japanese War and the three-year \"natural disaster\" period. Everyone can judge for themselves what the reason is. Netizens replied, \"Looking at my child working from nine to ten, I regret bringing him into this world,\" \"It means that we have encountered an enemy more terrible than the daily life,\" and \"It's mainly because there are too many mountains and it's hard to breathe.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863522349372579895","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 18:09:07","content":"Wall Street Journal: People familiar with the matter revealed that after Russia's full-scale invasion of Ukraine, China set up an inter-agency group to study the impact of Western sanctions, report regularly to the leadership, and learn lessons from it, especially in the conflict caused by the Taiwan Strait issue, which may cause the United States and other countries to impose similar measures on China. People familiar with the matter reminded that the establishment of the research group does not mean that China is ready to launch an invasion. Beijing is preparing for extreme situations and their economic impacts.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863528719291437218","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 18:24:20","content":"The Georgian government's decision to postpone the country's EU accession negotiations until 2028 has sparked protests from people who support EU accession. The video shows a woman giving the middle finger to law enforcement officers who were spraying water guns, and a firefighter draining the water from his car instead of launching a water cannon attack on the demonstrators. In response, netizens expressed their support and congratulations in the comment section.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863537416143065566","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 19:09:48","content":"December 2 (Released) Hubei Shiyan. The Internet exposed that Wu Pengfei, a medical agent, guided cancer patients across the country to Wudang Mountain Yaowang Valley Chinese Medicine Clinic for treatment. Wu Pengfei claimed that the Chinese medicine clinic treated cancer like treating a cold, and the cancer treatment rate was as high as 80%. As a result, many patients' conditions worsened after spending huge medical expenses. Among the patients who visited the clinic, 15 died and more than 20 people became more seriously ill. Some doctors in the Chinese medicine clinic were unqualified. At present, the case has been transferred to the public security.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863540853484220697","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 19:09:53","content":"On December 1, a netizen posted on Xiaohongshu that the pattern on the packaging bag of the Hong Kong cultural and creative bookstore \"book a zine\" was suspected of insulting China. \"A modern girl dressed up exquisitely is holding a dragon. There is no need to explain what the dragon means to China!\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863546084318224597","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 19:40:14","content":"On December 1, after Wu Liufang was accused of skirting the rules, a blogger listed several athletes who had difficulty living after retirement. \"Not all athletes can enjoy flowers and applause.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863549078615081116","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 19:55:27","content":"December 1 (Release) Fujian. An old man in ragged clothes lived in an abandoned house surrounded by garbage. A kind-hearted person brought him food. December 1, Wuhan, Hubei. A delivery man was stopped by a traffic policeman. He knelt down and kowtowed to the traffic policeman in a hurry, but the traffic policeman turned a blind eye. December 1, Nanjing, Jiangsu. At 2 a.m., a delivery man carried his daughter on his back while delivering food. A kind-hearted person bought some food for the child.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863553431119819146","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 20:10:40","content":"On November 30, CCTV reported that organic fluoride was detected in about 20% of tap water in Japan. Long-term exposure to fluoride can cause damage to the liver and heart. As a result, the comment section was overturned, and many netizens asked CCTV to take care of itself first: \"If you have the ability, test your own water\" \"Test the water you drink carefully\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863558402624131299","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 20:25:53","content":"Before the German foreign minister's visit to China, he said in an email statement: \"As a permanent member of the UN Security Council, China has not only failed to assume its responsibilities for maintaining world peace and security, but has also opposed our core interests in Europe by providing economic and weapons assistance to Russia.\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863562970376343739","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 20:41:06","content":"On the night of the incident, the Party Secretary of Xintang Town faced the crowd and made a promise: cancel the toll and refund the money already collected. The crowd cheered and gradually dispersed. Some netizens said: This time, local officials listened to public opinion in an unusual way, not because they were open-minded, but because of the lessons learned from the past. In 2011, the village security committee pushed a pregnant woman down while collecting protection fees, which triggered the June 11 riots. The next day, the video circulated online showed that the toll booths had been completely demolished.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863564045179346987","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 20:56:19","content":"On December 1, blogger \"Wuwuwuyusen\" posted a video describing the current environment: fresh graduates can't find jobs, 35-year-olds are laid off, one person does the work of more than a dozen people, and has to do side jobs, no holidays and delayed retirement. As technology develops, national strength becomes stronger, but the economy gets worse, GDP doubles in ten years, but the money earned is getting less and less. Is there anyone who is carrying the burden for me?... At present, the video and comments have all been \"cleared\" by the platform.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863571272258801941","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 21:11:32","content":"December 1 (Release) In Yueyang, Hunan, a second-level police inspector and a retired police officer from the procuratorate were outdoors to defend their rights. The banner they held read: \"The world's most injustice, tampering with the evidence, confusing right and wrong, deliberately framing, unacceptable under the law\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863573545458319564","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 21:26:45","content":"December 1 (Release) In Yueyang, Hunan, a second-level police inspector and a retired police officer from the procuratorate were outdoors to defend their rights. The banner they held read: \"The world's most injustice, tampering with the evidence, confusing right and wrong, deliberately framing, unacceptable under the law\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863578850187268104","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 21:41:58","content":"On the evening of December 2, Youwan Park, Jianghai District, Jiangmen:","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863579380104253824","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 21:57:11","content":"On December 1, Jinzhou, Liaoning Province, graffiti on a local overpass tunnel was cleared by staff. The picture shows that the words \"Democracy, Freedom\" and \"2952 in favor, 0 against, 0 abstentions\" were written on the tunnel wall. According to locals, the graffiti culture in the tunnel has existed for five or six years, but on December 1, the graffiti on the wall was suddenly cleared.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863581063034949771","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 21:57:16","content":"On the evening of December 2, Youwan Park, Jianghai District, Jiangmen City, Guangdong Province:","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863582734846951750","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 21:57:22","content":"December 1, Guangzhou, Guangdong. The ground collapsed on the Jinghu section of Guanghua Road, and a passing vehicle almost fell in. A driver said that the road had been under construction for ten years, and the road collapsed just after it was opened to traffic.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863596845488074919","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 22:57:57","content":"December 1, Jiyuan, Henan. Late at night, a man found a little girl frying rice on the roadside. The girl said that she was 9 years old and felt sorry for her father who worked two jobs and slept for only a few hours a day, so she used her free time to help her father. Her sister just turned two years old and her brother had a rare disease. The girl said, \"I want to grow up quickly and take more responsibility for my parents. I have no wishes, as long as my brother is fine.\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863601297775378792","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 23:13:10","content":"Last year, the Yesanpo 5A scenic area near Beijing was hit by floods, and residents were cut off from water, electricity and food. A year later, on November 29, a blogger visited Yesanpo, where the ruins were still broken and the scenery was devastated. Along the way were broken bridges, deserted shops, and deserted scenic spots... As winter approaches, when will the lives of these people who rely on the local tourism industry return to normal?","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863604322514477523","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-02 23:28:23","content":"At the end of the Biden administration, the United States and China once again confirmed the news of the second prisoner exchange this year. Hu Xijin, former editor-in-chief of the Global Times, published an article on this, in which he rarely admitted that he was both a media person and a \"former soldier who had worked in intelligence\", which attracted attention.","hasFullContentTranslated":true,"hasPublished":false}]