[{"id":"1861816937509990901","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 01:10:08","content":"Kunming:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861817424594739696","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 01:10:13","content":"The ruble has depreciated rapidly and the Russian Central Bank has suspended foreign exchange purchases.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861801122337591487","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 24:09:16","content":"November 25, Japan. Netizens posted a video saying that although they did not have a good impression of Japan due to historical reasons, they felt full of warmth and kindness when traveling in Japan. When eating at an izakaya, the locals gave them a plate of fried sturgeon, and they even paid for them. In this regard, many netizens shared their experiences of being helped by locals in Japan in the comment section: \"My uncle lost his passport in Japan, and the embassy did not care, but the Japanese police found it.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861810023288180905","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 24:39:36","content":"November 25, Inner Mongolia. A high school student complained about the unreasonable school rules: you can’t drink water during class, you can’t fight back if you’re beaten, you can’t bring daily necessities into school, you can’t eat snacks, you have to read a little notebook before morning exercises, etc. The student said, “I advise the school to be more sensible. The school doesn’t allow students to post videos online, but I did. What can you do to me?” Currently, the video has received 140,000 likes.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861811905209184430","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 24:39:42","content":"RT @bumingbaipod: Thank you for listening today. Bu Ming Podcast's White Paper 2nd Anniversary Live Broadcast has ended. Friends who missed it can click the link below to watch the live broadcast replay of \"Two Years Later, How Do We View the White Paper Movement?\" We will also post it to the podcast later, so stay tuned:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861812830950875157","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 24:54:55","content":"At midnight on November 28, many places in Yunnan suddenly began broadcasting Xi Jinping’s important speech at the same time, with varying lengths of time.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861825133658128849","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 01:40:34","content":"On the second anniversary of the White Paper Movement, our account was once again banned by Shadow.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861878177305407730","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 05:12:25","content":"","hasPublished":true},{"id":"1861886953097970000","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 05:42:45","content":"On the evening of November 28, a violent conflict broke out between urban management officials and vendors on Haizhong Street in Haizhong Village, Guangzhou.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861998606246625761","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 13:01:27","content":"On November 21, a blogger summarized the recent layoffs and foreign companies leaving China. Netizens: \"Foreign capital is flowing out again. How can we survive? Can we stop them from leaving by kneeling down and kowtowing to them?\" \"Foreign capital has withdrawn, leaving a large number of Chinese people unemployed\" \"They have to pay N+3 or N+6 compensation after they leave. Foreign capitalists have never forgotten their social responsibilities until their death\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862050869690442079","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 16:33:17","content":"The local street official reported that it was a fire, which caused damage to the elevator shaft and two people were slightly injured, neither of whom was in danger of life.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862053767144968339","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 16:48:30","content":"China-US prisoner swap: three Americans released, one of whom was a former FBI informant The Biden administration said on Wednesday that three Americans detained in China: Liang Chengyun, Li Kai and Mark Westan have returned to the United States. U.S. officials said that in exchange, the United States released Chinese intelligence officer Xu Yanjun. The U.S. State Department adjusted its travel warning for China and Hong Kong to Level 2, advising travelers to be vigilant due to the uncertainty of local law enforcement, including exit bans.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862058180634915156","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 17:03:43","content":"November 27 (Released) Shanghai. A man had an argument with a taxi driver while traveling in Shanghai. The driver said: You only love the country if the country loves you. If the country doesn't love you, why do you love it? Officials are corrupt, and China loves to build infrastructure, but can't even solve the problem of food and clothing for the people. The man retorted: Corrupt officials are just an exception. If China is not strong, can you be a driver? He thought the driver was insulting the country.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862059704282943955","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 17:03:48","content":"B station UP host Qingchun Kuaishou posted a video complaining about an unpatriotic driver he met in Shanghai, and posted the driver's chat video online. The UP kept saying shocking things: \"Can you consider it from the perspective of the country?\" \"You can still be a Didi driver here now, isn't China strong?\" \"Don't you still drive for Didi after being laid off?\" The last killer sentence: \"You are not Chinese.\" A large number of barrage comments supported the driver, thinking that the young man was too young","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862060990843760861","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 17:19:01","content":"The video blogger made many shocking remarks: \"Can you think from the perspective of the country?\" \"You can still be a Didi driver here, isn't China strong?\" \"How can the problem of food and clothing not be solved? What kind of food and clothing do you want?\" \"Don't you still drive for Didi after being laid off?\" The final blow: \"You are not Chinese.\" A large number of barrage comments supported the driver, thinking that the young man was too young","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862062272497201408","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 17:19:07","content":"\"No malicious questions allowed\" On November 27, late at night, a netizen posted a video saying: Who on earth has messed up the economy like this? The video was subsequently deleted and the comments were cleared.","hasFullContentTranslated":true,"hasPublished":true}]