[
  {
    "id": "1861816937509990901",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 01:10:08",
    "content": "Kunming:",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861817424594739696",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 01:10:13",
    "content": "The ruble has depreciated rapidly and the Russian Central Bank has suspended foreign exchange purchases.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861801122337591487",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 24:09:16",
    "content": "November 25, Japan. Netizens posted a video saying that although they did not have a good impression of Japan due to historical reasons, they felt full of warmth and kindness when traveling in Japan. When eating at an izakaya, the locals gave them a plate of fried sturgeon, and they even paid for them. In this regard, many netizens shared their experiences of being helped by locals in Japan in the comment section: \"My uncle lost his passport in Japan, and the embassy did not care, but the Japanese police found it.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861810023288180905",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 24:39:36",
    "content": "November 25, Inner Mongolia. A high school student complained about the unreasonable school rules: you can’t drink water during class, you can’t fight back if you’re beaten, you can’t bring daily necessities into school, you can’t eat snacks, you have to read a little notebook before morning exercises, etc. The student said, “I advise the school to be more sensible. The school doesn’t allow students to post videos online, but I did. What can you do to me?” Currently, the video has received 140,000 likes.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861811905209184430",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 24:39:42",
    "content": "RT @bumingbaipod: Thank you for listening today. Bu Ming Podcast's White Paper 2nd Anniversary Live Broadcast has ended. Friends who missed it can click the link below to watch the live broadcast replay of \"Two Years Later, How Do We View the White Paper Movement?\" We will also post it to the podcast later, so stay tuned:",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861812830950875157",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 24:54:55",
    "content": "At midnight on November 28, many places in Yunnan suddenly began broadcasting Xi Jinping’s important speech at the same time, with varying lengths of time.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861825133658128849",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 01:40:34",
    "content": "On the second anniversary of the White Paper Movement, our account was once again banned by Shadow.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861878177305407730",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 05:12:25",
    "content": "",
    "hasPublished": true
  },
  {
    "id": "1861886953097970000",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 05:42:45",
    "content": "On the evening of November 28, a violent conflict broke out between urban management officials and vendors on Haizhong Street in Haizhong Village, Guangzhou.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861998606246625761",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 13:01:27",
    "content": "On November 21, a blogger summarized the recent layoffs and foreign companies leaving China. Netizens: \"Foreign capital is flowing out again. How can we survive? Can we stop them from leaving by kneeling down and kowtowing to them?\" \"Foreign capital has withdrawn, leaving a large number of Chinese people unemployed\" \"They have to pay N+3 or N+6 compensation after they leave. Foreign capitalists have never forgotten their social responsibilities until their death\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862050869690442079",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 16:33:17",
    "content": "The local street official reported that it was a fire, which caused damage to the elevator shaft and two people were slightly injured, neither of whom was in danger of life.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862053767144968339",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 16:48:30",
    "content": "China-US prisoner swap: three Americans released, one of whom was a former FBI informant The Biden administration said on Wednesday that three Americans detained in China: Liang Chengyun, Li Kai and Mark Westan have returned to the United States. U.S. officials said that in exchange, the United States released Chinese intelligence officer Xu Yanjun. The U.S. State Department adjusted its travel warning for China and Hong Kong to Level 2, advising travelers to be vigilant due to the uncertainty of local law enforcement, including exit bans.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862058180634915156",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 17:03:43",
    "content": "November 27 (Released) Shanghai. A man had an argument with a taxi driver while traveling in Shanghai. The driver said: You only love the country if the country loves you. If the country doesn't love you, why do you love it? Officials are corrupt, and China loves to build infrastructure, but can't even solve the problem of food and clothing for the people. The man retorted: Corrupt officials are just an exception. If China is not strong, can you be a driver? He thought the driver was insulting the country.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862059704282943955",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 17:03:48",
    "content": "B station UP host Qingchun Kuaishou posted a video complaining about an unpatriotic driver he met in Shanghai, and posted the driver's chat video online. The UP kept saying shocking things: \"Can you consider it from the perspective of the country?\" \"You can still be a Didi driver here now, isn't China strong?\" \"Don't you still drive for Didi after being laid off?\" The last killer sentence: \"You are not Chinese.\" A large number of barrage comments supported the driver, thinking that the young man was too young",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862060990843760861",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 17:19:01",
    "content": "The video blogger made many shocking remarks: \"Can you think from the perspective of the country?\" \"You can still be a Didi driver here, isn't China strong?\" \"How can the problem of food and clothing not be solved? What kind of food and clothing do you want?\" \"Don't you still drive for Didi after being laid off?\" The final blow: \"You are not Chinese.\" A large number of barrage comments supported the driver, thinking that the young man was too young",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862062272497201408",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 17:19:07",
    "content": "\"No malicious questions allowed\" On November 27, late at night, a netizen posted a video saying: Who on earth has messed up the economy like this? The video was subsequently deleted and the comments were cleared.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862065358339002461",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 17:34:20",
    "content": "On November 27, the People's Daily published an article, emphasizing that revenge on society will not solve any problems, but will only leave a bad reputation for eternity. In addition to daily licking, it also reiterated the need to implement the Fengqiao experience and control conflicts at the grassroots level.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862066299398242745",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 17:34:26",
    "content": "November 23 (Released) Haikou, Hainan. The woman said that she bought the Huawei \"Xiangjie R7\" sedan because she had a national sentiment and felt that she should support domestic brands. As a result, the car was repainted and then sold. \"I trust Huawei so much, Huawei, are you worthy of me?\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862068826785071365",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 17:49:39",
    "content": "The official report later said that the rumor that the fire caused 19 deaths was a rumor, and only one person was injured at the scene. Some netizens found that the fire scene had been covered up.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862070748640411961",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 17:49:44",
    "content": "Recently, a multiplayer zombie survival game \"Remains\" has sparked heated discussions because of its 1:1 restoration of Chongqing street scenes. Some netizens expressed their horror that the game manufacturer actually figured out the map of Chongqing, suspecting that it was a spy infiltration.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862072362788917594",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 18:04:58",
    "content": "Recently, Caijing.com reported: China's non-tax revenue in October was 285.5 billion yuan, a year-on-year increase of 39.6%, a significant increase of 26.1 percentage points from the previous value, and the tax revenue achieved annual growth for the first time.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862075978941632821",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 18:20:11",
    "content": "A list of Chinese products that have been exposed as counterfeit or fake recently: Lanzhou police cracked a fraud case in which saline solution was used to impersonate HPV vaccine, and more than 100 people were deceived. Multiple sanitary napkin brands collapsed, and there was a discrepancy between the actual length and the packaging length. Zhejiang police seized more than 70,000 fake down jackets: the tags said 70% down, but the actual down content was basically 0. Anti-counterfeiting bloggers found that the sweet potato vermicelli sold by Internet celebrities did not contain sweet potato ingredients.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862076405363712160",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 18:20:16",
    "content": "According to the internal documents we received from the Hangzhou Municipal Government, the initial internal judgment on the cause of the explosion was that construction workers accidentally triggered a gas explosion during the cutting process.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862077040658137098",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 18:20:22",
    "content": "On November 28, at Shenzhen Kexing Science Park, many employees of Futu Securities held up signs downstairs to protest against Futu’s “bloody layoffs.”",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862079430669095279",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 18:35:35",
    "content": "Currently, all topics related to Yunnan Midnight Broadcast have been blocked on Weibo.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862080988882374984",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 18:35:40",
    "content": "On November 28, Dujiangyan, Sichuan. Residents of Yangcha Village gathered in front of the municipal government, demanding a solution to the social security issue of land occupation and demolition. On November 28, Hengyang, Hunan. Homeowners of Dongfang Xincheng in Dapu Town, Hengdong County gathered in front of the county government to defend their rights because they could not get their property certificates.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862082332842434636",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 18:35:46",
    "content": "November 28, Chengdu, Sichuan. Guanghui Royal Garden Community property management and food delivery personnel had a physical fight over the property management's car lock issue. The video shows that an Ele.me food delivery personnel and the property management personnel had a shoving match, and then more and more food delivery personnel joined in, and the conflict escalated into fistfighting.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862085666571784337",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 18:51:00",
    "content": "On November 26, CCTV reported: The United States was affected by highly pathogenic avian influenza, resulting in a decline in egg production and a surge in egg prices of more than 50%. A blogger in New York questioned this, saying that today (26th) the retail price of large eggs in New York supermarkets was US$3.99, \"it has increased a bit, but not by 50%\" and that the price of eggs in the wholesale market would be cheaper than in the supermarket.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862087385644937371",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 19:06:13",
    "content": "Netizen contribution Recently, the problem of juvenile delinquency in Chaoshan has become increasingly serious. These teenagers fight in groups, ride motorcycles in the opposite direction of the high-speed traffic, beat people with sticks, and show off weapons and equipment such as machetes and shovels. They also film these behaviors and post them online. In the first video, a person rides a motorcycle in the opposite direction of the high-speed traffic and beats people with a stick, causing two people on another motorcycle to fall down. Both of them were riding motorcycles without wearing helmets.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862087713715040280",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 19:06:18",
    "content": "According to a report on November 28, the European Parliament reportedly asked the EU to revoke its special tariff treatment for Hong Kong in response to the Hong Kong Democratic Party primary election.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862088714274398533",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 19:06:24",
    "content": "The movie \"Bound to Heaven\" starring Ni Ni, which was originally scheduled to be released on November 1, was quietly withdrawn. Currently, there is no trailer or release information for the movie, the Douban entry has been removed, the official blog is no longer updated, and related topics have been banned. It is reported that because the film involves SM bondage content, and the TV series \"Northwest Years\" in which Ni Ni plays Xi Jinping's mother Qi Xin is currently being broadcast, Ni Ni \"needs to maintain a relatively positive image in the near future.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862090177386307615",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 19:06:30",
    "content": "Netizen contribution November 28th China University of Geosciences Beijing, a male student climbed up the window and tried to commit suicide, the staff shouted \"cooperate\" and \"don't take pictures\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862093028409925644",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 19:21:43",
    "content": "Recently, many places in China have focused on investigating people with \"three losses and one deviation\" (frustration in life, imbalanced mentality, abnormal behavior and paranoid personality) and people with mental disorders.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862095950573166740",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 19:36:56",
    "content": "Coincidentally, a Meituan deliveryman also had a dispute with the property management over locking a car and hit someone. The police intervened at the scene and prepared to take the deliveryman to the police station for investigation. During the investigation, the deliveryman asked, \"Do you want my car anymore?\" The police said, \"What does the car have to do with me?\" Then the policeman started to put his hands around the man's neck while cursing. After the man broke free, the policeman asked, \"He wants to hit me, right? Are you cursing?\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862096367826681939",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 19:37:02",
    "content": "November 27, Shandong. A woman posted a video saying that her daughter was raped many times by her biological father and grandfather before she was 10 years old, and that her father was a Peking University graduate. \"The hospital diagnosed that my daughter's hymen had multiple old tears.\" She went to Shandong, where the crime occurred, to report the case, but because the child's father and grandfather did not admit it, the case was difficult to move forward.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862103048350519490",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 20:07:22",
    "content": "November 27 (Released) Shenzhen, Guangdong. A man revealed that he became an outsourced firefighter after retiring from the army, but was fired on the day of the Army Day. The labor company also owed him housing provident fund and social security. And just because he posted this online, the product showcase function of Douyin was banned by the platform. He also revealed that the community set up a fire station to dispatch firefighters, and the monthly housing provident fund of those with a regular job was more than 4,000, which was close to the monthly salary of dispatched employees.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862109753666888060",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 20:22:35",
    "content": "November 27, Changchun, Jilin. A deputy captain of the Economic Investigation Brigade of the Public Security Bureau, a doctor of law. He was helpless when faced with torture. Lawyer Li Zhuang interviewed a policeman who was disabled by torture. The policeman said that the captain of the brigade was arrested for corruption and confessed himself, but he did not get a penny. Because he refused to confess, he was tortured, including: slapping, sitting on the tiger bench, etc., which caused his disability. The police who beat him have not been held accountable so far.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862109985951588502",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 20:37:48",
    "content": "November 27, Changchun, Jilin. A deputy captain of the Economic Investigation Brigade of the Public Security Bureau, a doctor of law. He was helpless when faced with torture. Lawyer Li Zhuang interviewed a policeman who was disabled by torture. The policeman said that the captain was arrested for corruption and confessed himself, but he did not get a penny. Because he refused to confess, he was tortured, including: slapping, sitting on the tiger bench, etc., which caused his disability. The police who beat him have not been held accountable so far.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862112666757591484",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 20:37:54",
    "content": "This is the second time in a row that a director of the Central Military Commission’s Political Department has fallen. In November 2017, Zhang Yang, the former director of the Central Military Commission’s Political Work Department, committed suicide at home, and Miao Hua took over his position. Miao Hua, 69, had long served as a political cadre in the military stationed in the coastal province of Fujian. A report released by the US Pentagon last year said that Miao Hua may have established a \"close relationship\" with Xi Jinping during his tenure in Fujian.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862114473114300858",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 20:53:07",
    "content": "RT @michaelcaster: X must immediately end shadow ban of prominent human rights account @whyyoutouzhele and provide detailed explanation as…",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862116251423609029",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 20:53:13",
    "content": "How the relationship between human rights activists and reactionaries inside the Great Firewall was “switched”｜Xijiao Dabanlu 13 Independent journalist Danmu currently lives in Thailand. She has had long and close contact with many human rights activists, lawyers and activists active inside the Great Firewall. We started with He Fangmei, a parent and activist of a vaccine victim, and also talked about lawyer Wang Yu and social activist Hu Jia, who are of concern to everyone.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862119186211721490",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 21:08:26",
    "content": "November 28, Zhejiang. A woman posted a video saying that her 5-year-old daughter had been violated by her father many times. \"Dad took off his pants to show her his bottom, and put urine in her buttocks many times.\" The woman said that the hospital examination results showed that there was a tear on the vulva, but the child's father did not dare to admit it, nor did he dare to take a lie detector test.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862129214847369264",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 21:53:54",
    "content": "On November 28, Zhumadian, Henan. Animal protection activists in Zhengyang County intercepted a truck carrying more than 500 dogs. The video shows that the dog dealers clamped the dogs' necks with pliers and threw them into cages. The dogs were squeezed in a small space, their eyes full of helplessness. But the police formed a human wall to separate the volunteers and protect the dog dealers. During the period, the volunteers were pushed. At present, the dog dealers have been controlled and the dogs have been placed. The police called on people who lost their dogs to register and claim them.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862131864137535699",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 21:53:59",
    "content": "On November 28, the Ministry of National Defense responded to the recent failure of the Chinese and US defense ministers to meet: The US side does not need to pretend to want dialogue. Doesn’t the US know what it has done to harm China’s core interests?",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862135675203772782",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 22:09:12",
    "content": "On November 26, in Hefei, Anhui, a restaurant owner posted a video saying that the government was actively attracting investment, so he responded to the call and spent 10 million to build a factory building. As a result, due to various cumbersome procedures, he has not yet obtained the property certificate. The boss said: Private enterprises are too difficult. If you do well, it is not your achievement, and if you do not do well, you will have to bear the blame.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862137636355473617",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 22:24:25",
    "content": "On November 26, in Hefei, Anhui, a restaurant owner posted a video saying that the government was actively attracting investment, so he responded to the call and spent 10 million to build a factory building. As a result, due to various cumbersome procedures, he has not yet obtained the property certificate. The boss said: Private enterprises are too difficult. If you do well, it is not your achievement, and if you do not do well, you will have to bear the blame.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862140800169308570",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 22:39:38",
    "content": "Reuters: US intelligence says nuclear attack unlikely despite Putin's warnings. People familiar with US intelligence sources said the US decision to allow Ukraine to launch US weapons deep into Russian territory did not increase the risk of a nuclear attack on Ukraine, and that a nuclear attack was unlikely despite Putin's increasingly belligerent rhetoric.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862144567925194851",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 22:54:52",
    "content": "November 27, Leiyang, Hunan. Leiyang City Public Security is carrying out a winter \"street sweeping\" operation. Leiyang Experimental Middle School issued a notice that any minor who does not return home after 11 pm will be taken to the police station for investigation. If they do not change after repeated admonition, they will be detained in the detention center. Netizens: \"Curfew haha\" \"There was also a curfew in ancient times\"",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862147890505797829",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 22:55:03",
    "content": "RT @HChina89: Thanksgiving, thank you for the contributions of prisoners of conscience in China, and thank you for the friends who support and help the families of prisoners of conscience!",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862149502112764277",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 23:10:16",
    "content": "November 27 (Released) Sichuan. An old man who collects waste is carrying a heavy bag and walking barefoot. There is a slogan on the wall behind him: Struggle for a hundred years and embark on a new journey. This scene resonated with netizens: \"Only thinking about chasing others, forgetting ordinary people\" \"Oxen and horses also have invisible burdens\"",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862151856245391527",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 23:10:22",
    "content": "On-site video supplement:",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862158630105346053",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 23:40:42",
    "content": "There have been many vicious incidents in China recently, with armed police or special police guarding the schools in front of many schools. On November 27, armed police stood guard outside the Hedong Experimental Primary School in Tianjin. In Huainan, Anhui, armed special police guarded the school on the roadside. In Zhuzhou, Hunan, police stood guard outside the Baihe Primary School. In Xiangxi, Hunan, police guarded the students outside Longshan No. 2 Middle School.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862161587488117041",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-28 23:55:55",
    "content": "On November 27, a Russian guy posted a video saying that the current living conditions of Russians are actually quite miserable. Russians and ordinary people have no money. In addition, due to sanctions from Europe and the United States, foreign capital has withdrawn significantly, and even KFC and McDonald's are not available. Not only that, a few days ago, I learned that my sister's monthly salary is only 30,000 rubles (about 2,100 yuan) but the prices are ridiculously high.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  }
]