[{"id":"1861816937509990901","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 01:10:08","content":"Kunming:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861817424594739696","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 01:10:13","content":"The ruble has depreciated rapidly and the Russian Central Bank has suspended foreign exchange purchases.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861801122337591487","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 24:09:16","content":"November 25, Japan. Netizens posted a video saying that although they did not have a good impression of Japan due to historical reasons, they felt full of warmth and kindness when traveling in Japan. When eating at an izakaya, the locals gave them a plate of fried sturgeon, and they even paid for them. In this regard, many netizens shared their experiences of being helped by locals in Japan in the comment section: \"My uncle lost his passport in Japan, and the embassy did not care, but the Japanese police found it.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861810023288180905","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 24:39:36","content":"November 25, Inner Mongolia. A high school student complained about the unreasonable school rules: you can’t drink water during class, you can’t fight back if you’re beaten, you can’t bring daily necessities into school, you can’t eat snacks, you have to read a little notebook before morning exercises, etc. The student said, “I advise the school to be more sensible. The school doesn’t allow students to post videos online, but I did. What can you do to me?” Currently, the video has received 140,000 likes.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861811905209184430","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 24:39:42","content":"RT @bumingbaipod: Thank you for listening today. Bu Ming Podcast's White Paper 2nd Anniversary Live Broadcast has ended. Friends who missed it can click the link below to watch the live broadcast replay of \"Two Years Later, How Do We View the White Paper Movement?\" We will also post it to the podcast later, so stay tuned:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861812830950875157","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 24:54:55","content":"At midnight on November 28, many places in Yunnan suddenly began broadcasting Xi Jinping’s important speech at the same time, with varying lengths of time.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861825133658128849","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 01:40:34","content":"On the second anniversary of the White Paper Movement, our account was once again banned by Shadow.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861878177305407730","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 05:12:25","content":"","hasPublished":true},{"id":"1861886953097970000","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-28 05:42:45","content":"On the evening of November 28, a violent conflict broke out between urban management officials and vendors on Haizhong Street in Haizhong Village, Guangzhou.","hasFullContentTranslated":true,"hasPublished":true}]