[{"id":"1839341360845111348","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 00:28:48","content":"Netizens contributed a list of political review activities for the 2025 college entrance examination in a certain high school:","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_2.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839342585128886538","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 00:33:40","content":"Recently, a netizen asked questions to ByteDance's AI assistant \"Doubao\". The first question was \"Do you think Xi Jinping is a dictator?\" Doubao did not answer. The second question was \"What is the Cultural Revolution?\" and it got stuck after waiting for a long time. The following video is a screen recording of the last minute, and the actual waiting time was about 3 minutes.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839342585128886538_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839342971768221713","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 00:35:12","content":"Recently, a netizen posted a video saying that at a parent meeting at the Jinshan Branch of Sanhuikou Primary School in Kaizhou District, Chongqing, the teacher asked the operator to sell parents a \"smart campus card\" by scanning the code, charging 120 yuan per year, which aroused parents' doubts.\nOn the morning of September 26, a reporter from Poster News interviewed the Kaizhou District Education Committee of Chongqing. A staff member told the reporter that they had received feedback from parents and the relevant departments were handling it.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839342971768221713_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839349357268914574","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 01:00:34","content":"The vote count results released by the Sri Lankan Election Commission on the 22nd showed that the candidate nominated by the left-wing opposition alliance \"National People's Power\" (NPP) Dissanayake won the presidential election held on the 21st and was elected as the new president.\nSri Lanka has been in an economic crisis for the past two years. In 2022, due to the inability to repay debts due, Sri Lanka became the first country in the Asia-Pacific region to enter sovereign default in the 21st century. In 2022, the total debt exceeded US$83 billion, of which debt to China accounted for about 10% of its total debt. In 2017, due to the inability to repay debts related to the Hambantota Port, Sri Lanka mortgaged the Hambantota Port and large tracts of land around it to China.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839349357268914574_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839367769558745294","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 02:13:44","content":"The Wall Street Journal reported on September 26 that U.S. officials said that one of China's newest nuclear-powered attack submarines sank in late May or early June this year. The incident reportedly occurred at a shipyard near Wuhan. The Chinese authorities tried hard to cover it up and it has never been disclosed before.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839367769558745294_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839367769558745294_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839367769558745294_2.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839367769558745294_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839394648818610650","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 04:00:33","content":"On September 26, the National Youth Olympiad in Informatics (NOI) Competition Committee and Scientific Committee decided to investigate the CSP-J/S","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839394648818610650_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839585431131979989","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 16:38:39","content":"September 27 report, a senior U.S. defense official said on Thursday that \"the Chinese People's Liberation Army's attempt to cover up the sinking of a new nuclear-powered attack submarine at the dock is not surprising; this not only shows that there are problems with their training standards and equipment quality, but also exposes deeper problems in the PLA's internal accountability and supervision of China's defense industry. China's defense industry has long faced corruption problems.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839585431131979989_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839585431131979989_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839590053179535600","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 16:57:01","content":"September 26 (Release) It was reported online that a worker was holding a kitchen knife to demand wages at a construction site, and was criticized by the contractor and others. Faced with the contractor's aggressiveness, the worker could no longer bear it and chopped the contractor's neck with the kitchen knife, and blood instantly spread all over the ground (the picture has been blurred)","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839590053179535600_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839592118391841096","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:05:13","content":"September 22 (Released) Yuan Juzheng, a professor at National Taiwan University, praised Huawei phones in a program, saying that Huawei phones are better than Apple phones and at least they won't explode.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839592118391841096_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839592397342163034","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:06:20","content":"On September 27, the central government announced that Li Xiaopeng was removed from his position as secretary of the Party Committee of the Ministry of Transport and would be replaced by Liu Wei.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839592397342163034_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839593603125092389","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:11:07","content":"The Political Bureau of the CPC Central Committee acknowledged the economic problems. On September 26, the Political Bureau of the CPC Central Committee held a meeting chaired by Xi Jinping. The meeting acknowledged that some new situations and problems have emerged in the current economic operation. It emphasized the need to increase the countercyclical adjustment of fiscal and monetary policies, and proposed measures such as issuing special government bonds and lowering the deposit reserve ratio, aiming to stabilize growth, promote consumption, and stabilize the capital market and the real estate industry.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839593603125092389_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839596041496060027","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:20:48","content":"September 27 Hubei (publishing IP) A traffic policeman hid in a haystack to catch tickets. Netizens joked, \"Is this the special forces brigade of the traffic police?\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839596041496060027_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839597312110211475","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:25:51","content":"On September 27, the Zhenguan public account team, which had published the article \"A girl from another place died in my rented apartment\" and sparked heated public debate, was disbanded.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839597312110211475_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839597817700233382","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:27:52","content":"September 26, Taizhou, Zhejiang. A parent knelt at the gate of Dongcheng Primary School and begged the principal to cancel the DingTalk clock-in system.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839597817700233382_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839600060608454905","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:36:47","content":"September 26, Jining, Shandong. A woman posted a video saying that her son was punished by a life teacher to do thousands of squats during a summer camp last August, which caused rhabdomyolysis and liver and kidney damage. The child was diagnosed with a second-degree minor injury. A year later, the child suffered from depression and nearly committed suicide. The case is still pending. The woman also said that she received a call claiming to be from the court, and the other party asked her to delete the video.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839600060608454905_0.jpg,/tweet/video/whyyoutouzhele/2024/09/27/1839600060608454905_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839602200697503845","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:45:17","content":"According to a report on September 27, the State-owned Assets Supervision and Administration Commission of the State Council: Next year, state-owned enterprises must generally implement the last-ranked adjustment and incompetent exit system.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839602200697503845_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839616554805109032","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 18:42:19","content":"On the morning of September 27, due to the excessive buying, many stockholders reported that brokerage transactions were delayed and the Shanghai Stock Exchange was suspected of \"downtime\". Trading data showed that after 10 o'clock, the trading volume of the Shanghai Composite Index shrank sharply by more than 90%, and the index showed a straight sideways state, and the transaction data stopped at around 10:22.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839616554805109032_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839616554805109032_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839616554805109032_2.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839616554805109032_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839618054436614483","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 18:48:17","content":"On September 27, a student from Shanghai University of Electronic Information jumped off a building due to emotional problems.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839618054436614483_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839618054436614483_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839618054436614483_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839618054436614483_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839618912335572992","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 18:51:41","content":"The man who said \"Don't treat me, it can't be cured\" has passed away. On July 24 last year, Zou Chengjun, who suffered from pancreatitis and moyamoya disease, fell on his bike on his way home and was bleeding. He staggered back to his rental house and waited for death. Afterwards, people found him covered in blood and sent him to the hospital for treatment. Netizens also donated 570,000 yuan in a few days. On September 24 this year, 34-year-old Zou Chengjun died of ineffective rescue due to his illness.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839618912335572992_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839618912335572992_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839618912335572992_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839618912335572992_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839622137633476651","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 19:04:30","content":"On September 25, on the occasion of the 75th anniversary of the National Day, the Chengdu Municipal Government issued a national flag management notice, requiring that key inspections be conducted to check whether the raising and use of the national flag in various units and places complies with regulations, and whether the national flag is damaged, stained, faded or non-compliant when it is raised; and clearly stating that anyone who is found to deliberately insult the national flag by burning, damaging, painting, defiling, trampling on it in public, or who randomly discards or disposes of it, or who engages in other acts that damage the dignity of the national flag, must be stopped immediately and dealt with seriously in accordance with the law.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839622137633476651_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839622137633476651_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839622248354713671","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 19:04:57","content":"September 26, Xi'an, Shaanxi. A blogger interviewed a passerby: Why did China fall behind the West in modern times? The passerby answered: Is it possible? We have never been ahead of the world. We have never opened our eyes to see the world. History is a hymn to the victors. Most of the leading positions are just lip service. Some people agreed, while others questioned whether it was staged. The original video has been deleted.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839622248354713671_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839627033292542169","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 19:23:58","content":"On September 26, \"positive energy big V\" such as Gu Yan Mu Chan posted that drug vending machines were installed on the streets of Canada, which contained hard drugs such as cocaine and heroin. Later, other bloggers found out that the post was a rumor. The equipment in the video was introduced by the local hospital, providing individually packaged condoms, wound care products, etc. It does not provide drugs.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839627033292542169_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839627033292542169_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839627033292542169_2.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839627033292542169_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839632498458079474","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 19:45:41","content":"On September 27, the man posted a video saying that he was sued by Guancha.com for exposing the connection between Zhang Weiwei and Guancha.com. The man said that Guancha.com was co-founded by Zhang Weiwei, and its chairman, legal person, shareholders, founding editor, etc. all worked at Zhang Weiwei's Fudan University China Research Institute. The man said that he was ready to respond to the lawsuit, \"Even if I lose the case, at least I have left a mark on my journey to fight for the right to speak.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839632498458079474_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1839639788120363291","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 20:14:38","content":"September 25 (Release), Hunan Xiangxi. Two people were dining in a restaurant wearing kimonos, and an older woman reminded them, \"Look at what I'm wearing. We must not forget the national humiliation.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839639788120363291_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839644279544693168","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 20:32:29","content":"September 17, Guangzhou Panyu. A female junior high school student jumped off a building in Aoyuan Plaza. The suicide note she left behind read: \"Now the children's study pressure is getting bigger and bigger. The three-day Mid-Autumn Festival holiday has to be adjusted to one day off, and there are still a lot of homework to do. Where did the double reduction go? Mom, I am too tired......","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839644279544693168_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839644279544693168_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839647252102434841","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 20:44:18","content":"On September 27 (published), netizens submitted an article. According to statistics from the Shanghai Changning District Market Supervision Administration, in 2022, there were a total of 82,782 reports against Pinduoduo's parent company, Shanghai Xunmeng Information Technology Co., Ltd., but the number of administrative penalty cases against the company was 0. According to data released by Tianyancha and Qichacha, Pinduoduo has had nearly 140,000 lawsuits since its establishment, while Evergrande Real Estate, which is on the verge of bankruptcy, has only 13,000 lawsuits.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839647252102434841_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839647252102434841_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839647252102434841_2.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839647252102434841_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839651314726556046","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 21:00:27","content":"September 25, Beijing. A woman kneeled outside the gate of Beijing Second Intermediate People's Court and called out to the president: \"See the president and redress the injustice for the people!\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839651314726556046_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839653218051346892","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 21:08:00","content":"On September 25, the Taiwan Affairs Office of the State Council said: The Fuzhou-Xiamen high-speed railway is only 200 kilometers away from Taiwan. I believe that this 200-kilometer distance will be reduced to zero, and the dream of people on both sides of the strait to cross the strait by high-speed rail will come true.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839653218051346892_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]