[{"id":"1839341360845111348","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 00:28:48","content":"Netizens contributed a list of political review activities for the 2025 college entrance examination in a certain high school:","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_2.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839342585128886538","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 00:33:40","content":"Recently, a netizen asked questions to ByteDance's AI assistant \"Doubao\". The first question was \"Do you think Xi Jinping is a dictator?\" Doubao did not answer. The second question was \"What is the Cultural Revolution?\" and it got stuck after waiting for a long time. The following video is a screen recording of the last minute, and the actual waiting time was about 3 minutes.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839342585128886538_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839342971768221713","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 00:35:12","content":"Recently, a netizen posted a video saying that at a parent meeting at the Jinshan Branch of Sanhuikou Primary School in Kaizhou District, Chongqing, the teacher asked the operator to sell parents a \"smart campus card\" by scanning the code, charging 120 yuan per year, which aroused parents' doubts.\nOn the morning of September 26, a reporter from Poster News interviewed the Kaizhou District Education Committee of Chongqing. A staff member told the reporter that they had received feedback from parents and the relevant departments were handling it.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839342971768221713_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839349357268914574","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 01:00:34","content":"The vote count results released by the Sri Lankan Election Commission on the 22nd showed that the candidate nominated by the left-wing opposition alliance \"National People's Power\" (NPP) Dissanayake won the presidential election held on the 21st and was elected as the new president.\nSri Lanka has been in an economic crisis for the past two years. In 2022, due to the inability to repay debts due, Sri Lanka became the first country in the Asia-Pacific region to enter sovereign default in the 21st century. In 2022, the total debt exceeded US$83 billion, of which debt to China accounted for about 10% of its total debt. In 2017, due to the inability to repay debts related to the Hambantota Port, Sri Lanka mortgaged the Hambantota Port and large tracts of land around it to China.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839349357268914574_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839367769558745294","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 02:13:44","content":"The Wall Street Journal reported on September 26 that U.S. officials said that one of China's newest nuclear-powered attack submarines sank in late May or early June this year. The incident reportedly occurred at a shipyard near Wuhan. The Chinese authorities tried hard to cover it up and it has never been disclosed before.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839367769558745294_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839367769558745294_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839367769558745294_2.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839367769558745294_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839394648818610650","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 04:00:33","content":"On September 26, the National Youth Olympiad in Informatics (NOI) Competition Committee and Scientific Committee decided to investigate the CSP-J/S","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839394648818610650_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839585431131979989","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 16:38:39","content":"September 27 report, a senior U.S. defense official said on Thursday that \"the Chinese People's Liberation Army's attempt to cover up the sinking of a new nuclear-powered attack submarine at the dock is not surprising; this not only shows that there are problems with their training standards and equipment quality, but also exposes deeper problems in the PLA's internal accountability and supervision of China's defense industry. China's defense industry has long faced corruption problems.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839585431131979989_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839585431131979989_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839590053179535600","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 16:57:01","content":"September 26 (Release) It was reported online that a worker was holding a kitchen knife to demand wages at a construction site, and was criticized by the contractor and others. Faced with the contractor's aggressiveness, the worker could no longer bear it and chopped the contractor's neck with the kitchen knife, and blood instantly spread all over the ground (the picture has been blurred)","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839590053179535600_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839592118391841096","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:05:13","content":"September 22 (Released) Yuan Juzheng, a professor at National Taiwan University, praised Huawei phones in a program, saying that Huawei phones are better than Apple phones and at least they won't explode.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839592118391841096_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839592397342163034","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:06:20","content":"On September 27, the central government announced that Li Xiaopeng was removed from his position as secretary of the Party Committee of the Ministry of Transport and would be replaced by Liu Wei.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839592397342163034_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839593603125092389","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 17:11:07","content":"The Political Bureau of the CPC Central Committee acknowledged the economic problems. On September 26, the Political Bureau of the CPC Central Committee held a meeting chaired by Xi Jinping. The meeting acknowledged that some new situations and problems have emerged in the current economic operation. It emphasized the need to increase the countercyclical adjustment of fiscal and monetary policies, and proposed measures such as issuing special government bonds and lowering the deposit reserve ratio, aiming to stabilize growth, promote consumption, and stabilize the capital market and the real estate industry.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839593603125092389_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]