[{"id":"1839341360845111348","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 00:28:48","content":"Netizens contributed a list of political review activities for the 2025 college entrance examination in a certain high school:","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_0.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_1.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_2.jpg,/tweet/image/whyyoutouzhele/2024/09/27/1839341360845111348_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839342585128886538","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 00:33:40","content":"Recently, a netizen asked questions to ByteDance's AI assistant \"Doubao\". The first question was \"Do you think Xi Jinping is a dictator?\" Doubao did not answer. The second question was \"What is the Cultural Revolution?\" and it got stuck after waiting for a long time. The following video is a screen recording of the last minute, and the actual waiting time was about 3 minutes.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839342585128886538_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839342971768221713","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 00:35:12","content":"Recently, a netizen posted a video saying that at a parent meeting at the Jinshan Branch of Sanhuikou Primary School in Kaizhou District, Chongqing, the teacher asked the operator to sell parents a \"smart campus card\" by scanning the code, charging 120 yuan per year, which aroused parents' doubts.\nOn the morning of September 26, a reporter from Poster News interviewed the Kaizhou District Education Committee of Chongqing. A staff member told the reporter that they had received feedback from parents and the relevant departments were handling it.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/27/1839342971768221713_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839349357268914574","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-27 01:00:34","content":"The vote count results released by the Sri Lankan Election Commission on the 22nd showed that the candidate nominated by the left-wing opposition alliance \"National People's Power\" (NPP) Dissanayake won the presidential election held on the 21st and was elected as the new president.\nSri Lanka has been in an economic crisis for the past two years. In 2022, due to the inability to repay debts due, Sri Lanka became the first country in the Asia-Pacific region to enter sovereign default in the 21st century. In 2022, the total debt exceeded US$83 billion, of which debt to China accounted for about 10% of its total debt. In 2017, due to the inability to repay debts related to the Hambantota Port, Sri Lanka mortgaged the Hambantota Port and large tracts of land around it to China.","images":"/tweet/image/whyyoutouzhele/2024/09/27/1839349357268914574_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]