[{"id":"1826907876906168777","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 17:02:34","content":"On August 23, in Haikou, Hainan, an intentional injury incident occurred on Guomao Road. A man stabbed his ex-wife with a knife due to a dispute. The video showed that the woman fell to the ground and her clothes were stained with blood.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826907876906168777_0.jpg,/tweet/video/whyyoutouzhele/2024/08/23/1826907876906168777_1.jpg,/tweet/video/whyyoutouzhele/2024/08/23/1826907876906168777_2.jpg,/tweet/video/whyyoutouzhele/2024/08/23/1826907876906168777_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826909751038660713","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 17:10:01","content":"August 20, Liaoning. A woman went to work in the countryside and met a boy covered in scars. She learned from the villagers that the boy's parents were divorced, his mother ran away, the boy had intellectual disabilities, and was often beaten by his father \"and not given enough food.\" The woman said: I dare not call the police, for fear that his father will become more violent afterwards, so I can only ask netizens for help. How to deal with this situation.","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826909751038660713_0.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826909751038660713_1.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826909751038660713_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826912937560445275","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 17:22:41","content":"On August 22, Russia Today (RT) clarified that the report that \"159 countries will adopt the new BRICS payment system\" was wrong. Netizens expressed their support and understanding in the comment area, and believed that although the news was false, it would be realized sooner or later.\n","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826912937560445275_0.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826912937560445275_1.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826912937560445275_2.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826912937560445275_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826913636108894451","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 17:25:27","content":"On August 22, Sichuan International Studies University was exposed for food problems in the canteen.\nOn the 18th, Sichuan International Studies University released the results of the investigation when the canteen was not open during the summer vacation, insisting that there was no problem with the school canteen.\nThe rights protection business questioned what kind of shameful activities the school and the catering company had.\nAnd said that they would report to the Central Commission for Discipline Inspection of the Communist Party of China next","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826913636108894451_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826915704290889911","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 17:33:41","content":"On August 19, a communications expert said in the program \"This is China\": Now one of our ships can single-handedly challenge the US aircraft carrier battle group! Pelosi ignored the warning and attempted to flee to Taiwan. The PLA just announced the exercise and the \"Reagan\" ran away!","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826915704290889911_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826917246054138078","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 17:39:48","content":"According to a report on August 22, China's non-tax revenue in the first half of the year reached 2.18 trillion yuan! Some places even use the amount of fines as a performance evaluation indicator for departments or individuals, causing many law enforcement officers to impose fines at will in order to complete their tasks.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826917246054138078_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826918456119447742","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 17:44:37","content":"On August 22 (Released), a delivery boy wrote on the trunk of his electric bike: \"Please don't steal my food and car. I am at the lowest point in my life and I am delivering food to pay off my debts. If you are forced by life and there is 20 yuan under the box, you can use it to have a meal. Let's cheer together in 2024.\"","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826918456119447742_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826922098901787092","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 17:59:05","content":"On August 22, Guyan Muchan posted: Thousands of pro-Palestinian protesters gathered in Chicago's Union Park. Among them, a young man in a maid outfit waved a \"Nazi flag\" and attracted a lot of attention. But the flag in the picture was actually a communist flag. As of now, this Weibo post has been deleted.","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826922098901787092_0.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826922098901787092_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826925863113212041","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 18:14:03","content":"On the evening of August 20, Jiujiang, Jiangxi. The Shunde Township Law Enforcement Brigade conducted a night inspection of illegal fishing. There were illegal fishing behaviors such as one rod with multiple hooks and live baits. Four people were investigated and punished, 14 fishing rods were seized, and a fine of 2,500 yuan was imposed.\nReported on August 23, Inner Mongolia. 24 people were investigated for illegally picking wild sand onions and chives.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826925863113212041_0.jpg,/tweet/video/whyyoutouzhele/2024/08/23/1826925863113212041_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826928189375185407","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 18:23:17","content":"August 20, Xi'an, Shaanxi. The old man's spouse fell down in the corridor and was taken to the hospital by the woman. The old man grabbed her collar and asked her to pay for all the medical examination fees. The woman said helplessly: I will never be a good person again!","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826928189375185407_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826930892868092030","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 18:34:02","content":"On August 23, a Henan village bank depositor who had been given a red code called the Henan Culture and Tourism Bureau to ask why Zhang Linlin was promoted to the head of the Zhengzhou Culture and Tourism Bureau. The depositor questioned, \"You let someone who was given a red code without authorization be the head of the culture and tourism bureau. Will people from all over the country dare to travel to Henan?\" The Henan Culture and Tourism Bureau replied that Henan only reads reports from Henan's own official media, and for reports from other provinces, it asked the depositor not to slander Henan.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826930892868092030_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826933381084385468","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 18:43:55","content":"On the morning of August 22, Xu Jiye, the public relations director of Jiyue Automobile, co-founded by Geely and Baidu, blasted Xiaomi in the circle of friends for selling cars at a loss and dumping, saying that Lei Jun is \"the worst businessman\".\nIt is reported that Xu Jiye's remarks are related to Xiaomi's latest financial report. The second quarter financial report of 2024 shows that Xiaomi delivered 27,307 new cars in a single quarter, with a net loss of 1.8 billion yuan. Based on this calculation, the loss of Xiaomi SU7 per car exceeds 60,000 yuan.","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826933381084385468_0.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826933381084385468_1.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826933381084385468_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826934435071054269","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 18:48:06","content":"Some netizens summarized some events that have attracted a lot of public attention in the past two months, as well as their subsequent handling results.","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826934435071054269_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826938195629744270","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 19:03:03","content":"On August 22, blogger Zhang Instructor released another video in response, saying that most foreign media had led to the conclusion that the hotel did not hang the national flag, and that you insisted on asking the hotel to hang it. But in fact, it was the flag of all nations, including the Chinese flag. The hotel did not not hang it, but simply cut it off. He was just speaking from the perspective of the country. In addition, he denied that Master Yang in the video was an actor.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826938195629744270_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826938474856865848","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 19:04:09","content":"On August 19, the British Fimus (China) and two other companies jointly announced that due to the incident of Evergreen Laurel Hotel in Paris refusing to hang the five-star red flag, they would refuse to use the shipping routes of Evergreen Group’s shipping companies in international trade.\n","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826938474856865848_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826940495366705541","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 19:12:11","content":"On August 22, the 120th anniversary of Deng Xiaoping’s birth, a large number of netizens left messages in the comment section to commemorate Deng Xiaoping.","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826940495366705541_0.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826940495366705541_1.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826940495366705541_2.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826940495366705541_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826943292124348506","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 19:23:18","content":"Recently, in Suzhou, Jiangsu, the old owners of Cuican Pingjiang Community were collectively dissatisfied with the price cut, and they demanded that the developer clear the reserved houses within 24 hours, stop malicious marketing, withdraw all low-price sales information on social media, and compensate all owners for the price difference if the house is sold at a price lower than the appraisal price.\nA local agent said: The property \"dropped more than 1 million yuan in one night, and the old owners lost more than 1 million yuan.\"","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826943292124348506_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826943292124348506_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826948433665819060","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 19:43:44","content":"On August 22, the 120th anniversary of Deng Xiaoping’s birth, many netizens on Weibo posted messages to commemorate Deng Xiaoping and the era of reform and opening up.\n","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826948433665819060_0.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826948433665819060_1.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826948433665819060_2.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826948433665819060_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826950273299886395","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 19:51:02","content":"On August 23, the 6th Guangzhou International Comic Festival was exposed to a magical scene.\nYou need to have a book to apply for a booth at the comic festival, but you are not allowed to sell books at the booth.\nThe police will disguise themselves as plainclothes officers to conduct fishing enforcement in the venue. Once you answer how much money you want, you will be taken away by the police.","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826950273299886395_0.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826950273299886395_1.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826950273299886395_2.jpg,/tweet/image/whyyoutouzhele/2024/08/23/1826950273299886395_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826951592849048047","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 19:56:17","content":"According to a report on August 23, the Dali government in Yunnan Province has identified more than 30,000 older unmarried men: the problem will be gradually resolved through government matchmaking.","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826951592849048047_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826955538925834342","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 20:11:58","content":"On August 21, Kankan News reported: Shanghai Fuxing East Road Tunnel and Xizang South Road Tunnel are hotspots for illegal non-motor vehicle tunneling. Shanghai has 17 cross-river ferry lines, but most of them are closed before 9 p.m., and many workers have to work until four or five in the morning. For this reason, many workers choose to take risks and ride electric bikes in busy tunnels.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826955538925834342_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826961021954597359","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 20:33:45","content":"Recently, the mandatory installation of elevators in Shanghai’s Gumei residential area caused dissatisfaction among residents, and led to conflicts with security guards.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826961021954597359_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826962633620430982","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 20:40:09","content":"August 22, Shandong. The blogger posted a video saying that after the riders receive an order every day, the platform will deduct 3 yuan in insurance premiums, but the insurance company actually includes sudden death due to various reasons, heat stroke, and death caused by high altitude environmental factors in the liability exemption. The blogger said: If the above two items are exempted from liability, then what is the point of insuring the riders? In addition, sometimes merchant A is slow to deliver food, and the riders have to deliver other orders and then go back to deliver merchant A's food. The platform only gives the riders 8 minutes to deliver food, but the distance is 6.3 kilometers. If the riders want to deliver on time, the speed cannot be lower than 47 kilometers per hour.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826962633620430982_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826962687034609871","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 20:40:22","content":"August 23, Zhanjiang, Guangdong. The children of parents who bought school district houses could not go to school, and tried to jump off the building to defend their rights, but were taken away by the police.\nIt is reported that when Nanbin Garden was purchased, it was advertised that students could attend the central campus of Haidong Primary School, and there was an agreement stamped by the developer, primary school, and education bureau. However, the new principal now refuses to recognize the previous agreement, resulting in the child being unable to enroll.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826962687034609871_0.jpg,/tweet/video/whyyoutouzhele/2024/08/23/1826962687034609871_1.jpg,/tweet/video/whyyoutouzhele/2024/08/23/1826962687034609871_2.jpg,/tweet/video/whyyoutouzhele/2024/08/23/1826962687034609871_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826964916651360631","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 20:49:14","content":"August 23, Fuzhou, Fujian. An old woman posted a video saying that she was born into a military family. In 2019, local leaders in Cangshan District led hundreds of people to demolish her legal and licensed residence, and her family members were violently beaten and illegally detained. The old woman said, \"Three people from two generations defended the country, but this is the end.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826964916651360631_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826966012878528865","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 20:53:35","content":"On August 23, it was reported online that a store manager of Wenjie Auto used patriotic marketing to force consumers to kidnap them during a chat with customers, asking them when they would awaken their national blood and when they would understand that supporting domestic products is supporting the country.","images":"/tweet/image/whyyoutouzhele/2024/08/23/1826966012878528865_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1826969081351991553","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-23 21:05:47","content":"August 21, Wenzhou, Zhejiang. A delivery guy suddenly fell to the ground and convulsed while picking up food. After being helped up by others, he was afraid that the order would be overdue but still wanted to deliver the food.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/23/1826969081351991553_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]