[{"id":"1763240118813335849","name":"李老师不是你老师","createdDate":"2024-03-01 00:29:38","content":"On February 28, it was reported online that a staff member of the Publicity Department of the Shuicheng District Committee of Liupanshui City forwarded a piece of news about \"a public report letter of extortion by the vice president of China Business News and others\" in his circle of friends, and called on others to forward it.","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763240118813335849_0.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763240118813335849_1.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763240118813335849_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763299447553892721","name":"李老师不是你老师","createdDate":"2024-03-01 04:25:23","content":"Henan Village Bank depositors recount how they were detained on New Year's Eve when they went to Zhengzhou to defend their rights\nTo this day, many depositors are still illegally detained in Henan.","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763299447553892721_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763369449556410585","name":"李老师不是你老师","createdDate":"2024-03-01 09:03:33","content":"https://t.co/FDf7la3fLl","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763369449556410585_0.jpg","videos":"","hasPublished":true},{"id":"1763373213206057338","name":"李老师不是你老师","createdDate":"2024-03-01 09:18:30","content":"On March 1, Henan Village Bank depositors raised the reward to 7.1 million yuan and publicly solicited clues about violations of laws and disciplines by three officials, including Hao Jingtao of Henan Rural Commercial Bank and Yuan Xiaogang and Zhou Zhigang of Henan Court.","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763373213206057338_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763401271598272588","name":"李老师不是你老师","createdDate":"2024-03-01 11:10:00","content":"On the evening of February 29, in Liyang, Jiangsu, a mother said that she took her child who had adverse sequelae from vaccination to Beijing for medical treatment, but was intercepted by local government staff at the station.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/01/1763401271598272588_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763512765170274332","name":"李老师不是你老师","createdDate":"2024-03-01 18:33:02","content":"[Caution]\nOn the afternoon of March 1, a vicious incident occurred near a primary school in Dezhou, Shandong, where a man drove his car into students.\nThe scene was in a mess in the video, with many students lying on the ground.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/01/1763512765170274332_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763513719118598496","name":"李老师不是你老师","createdDate":"2024-03-01 18:36:49","content":"At present, topics related to the \"Texas car accident\" have been banned, and people are relaying on the Internet to call for everyone's attention.\nAt the same time, local people are also relaying in their circle of friends to call on everyone to donate blood.","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763513719118598496_0.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763513719118598496_1.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763513719118598496_2.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763513719118598496_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763517280875315372","name":"李老师不是你老师","createdDate":"2024-03-01 18:50:58","content":"According to a \"Dezhou Public Security Information Bulletin\" circulated on the Internet, the incident occurred at 1:41 pm in front of the gate of Anjuyuan Campus of Decheng District No. 3 Experimental Primary School, and the man hit and injured more than a dozen children (the specific number is being counted).","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763517280875315372_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763526029199482893","name":"李老师不是你老师","createdDate":"2024-03-01 19:25:44","content":"At present, the relevant topics have once again become the top two hot searches","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763526029199482893_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763536597528580415","name":"李老师不是你老师","createdDate":"2024-03-01 20:07:44","content":"On March 1, the U.S. Embassy in China issued a statement saying that the account had not enabled the comment filtering function, and expressed dissatisfaction with the failure to display netizens' comments in a timely manner.","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763536597528580415_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763539437097566276","name":"李老师不是你老师","createdDate":"2024-03-01 20:19:01","content":"The video of the perpetrator being caught was circulated online","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/01/1763539437097566276_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763542009174737133","name":"李老师不是你老师","createdDate":"2024-03-01 20:29:14","content":"The accident has left two people dead and six seriously injured.","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763542009174737133_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763545010857734644","name":"李老师不是你老师","createdDate":"2024-03-01 20:41:10","content":"On March 1, the reporter of Yicai.com sorted out the 2023 fines and confiscations income of 16 provinces that have been made public, based on the 2023 budget execution and 2024 budget draft disclosed by the financial departments of various provinces recently.\nOverall, among the 16 provinces, the scale of local fines and confiscations income varies greatly. Among them, Guangdong has the highest fines and confiscations income (33.84 billion yuan), and Ningxia has the lowest (1.26 billion yuan), the former is about 27 times the latter.\nFines and confiscations income reflects the fines, confiscations, stolen money, and the sale of confiscated materials and stolen goods collected by law enforcement agencies in accordance with the law. This includes general fines and confiscations income from public security, transportation, taxation, courts, market supervision, etc., as well as anti-smuggling fines and confiscations income from public security, markets, etc. Fines and confiscations income belongs to non-tax revenue in local general public budget revenue.","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763545010857734644_0.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763545010857734644_1.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763545010857734644_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763549632796275071","name":"李老师不是你老师","createdDate":"2024-03-01 20:59:32","content":"On February 29, the recruitment software \"Zhilian Zhaopin crashed\" became a hot search on Weibo, and many users reported that the software stopped at the loading page. This triggered heated discussions among netizens, \"Didn't we say that the unemployment rate was only 5.2?\" In response, Zhilian Zhaopin said that due to the new high in job search traffic, the server overload \"caused a brief suspension\" but the service has now returned to normal. Data shows that after the Spring Festival, the number of active companies on Zhilian Zhaopin platform increased by 45% year-on-year, and the number of resumes submitted increased by 23% year-on-year","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763549632796275071_0.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763549632796275071_1.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763549632796275071_2.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763549632796275071_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763550154974740990","name":"李老师不是你老师","createdDate":"2024-03-01 21:01:36","content":"On February 29, a woman in Guangzhou shared a scene of her family of four sitting together and using recruitment software to look for jobs.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/01/1763550154974740990_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763559609795596752","name":"李老师不是你老师","createdDate":"2024-03-01 21:39:10","content":"On February 29, a blogger with the ID \"Rabbit in the Bear's Den\" went to Russia to be a mercenary and posted a video about his experience in the army and the truth. He also accused some bloggers who also served in the Russian army of being unscrupulous and tricking Chinese people into joining the army. I advise everyone not to believe in online scammers. Not to mention the danger, the monthly income is less than 250,000 rubles.\nIn another video (3 minutes and 11 seconds), he talked about the Russian army's reward mechanism while walking through a forest destroyed by war, and the forest was full of the bodies of soldiers blown up.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/01/1763559609795596752_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763583778427912604","name":"李老师不是你老师","createdDate":"2024-03-01 23:15:13","content":"On March 1, the U.S. Embassy published the “U.S. Trade Representative Releases Annual Report on China’s WTO Compliance” on its WeChat official account.","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763583778427912604_0.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763583778427912604_1.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763583778427912604_2.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763583778427912604_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763592890847052014","name":"李老师不是你老师","createdDate":"2024-03-01 23:51:25","content":"Recently, Nanjing Dazhong Bookstore is suspected of going bankrupt, and all related shopping cards cannot be used. The only remaining online channels for shopping cards have also seen soaring prices, and the only remaining offline channels are designated channels. The prices of Zifeng Building Hotel and buffet have also soared.\nThe official announcement said that refunds are supported, but the cycle is about 3 months. Everyone is worried that it will be like the previous ofo small yellow car incident, and the company will run away without refunding. It rained in Nanjing a few days ago, and many elderly people held umbrellas and went to Suguo’s designated offline consumption point 888 to queue up for consumption, but the prices of offline items have also soared. A skipping rope is 99, an ordinary neutral pen is 20, and someone bought 3 squirrel bread at the designated online consumption point \"Changfu Koi\" at a price three times higher than the market price, and the place of shipment was Pinduoduo 19.9.","images":"/tweet/image/whyyoutouzhele/2024/03/01/1763592890847052014_0.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763592890847052014_1.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763592890847052014_2.jpg,/tweet/image/whyyoutouzhele/2024/03/01/1763592890847052014_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false}]