[
  {
    "id": "1657294914491744256",
    "name": "李老师不是你老师",
    "createdDate": "2023-05-13 16:01:13",
    "content": "Netizen contribution\nOn May 12, in Xuzhou, Jiangsu, a young man threw a large number of leaflets on the rooftop to condemn the \"Jack Spicy Noodles\" cat abuse incident in Funan, Anhui, which has caused a sensation on the Chinese and foreign Internet recently.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/05/13/1657294914491744256_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/sU3qGNDpDO",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1657295599912337409",
    "name": "李老师不是你老师",
    "createdDate": "2023-05-13 16:03:56",
    "content": "Because the means of this incident were too cruel and bloody, no additional information will be provided for the time being. Please search on your own. Please forgive me. If you want to add something in the comment area, please set the image to sensitive before posting. Thank you.",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1657308572550610948",
    "name": "李老师不是你老师",
    "createdDate": "2023-05-13 16:55:29",
    "content": "On May 13, the Italian Embassy responded to the recent online news about the suspension of visa issuance, saying that the news was groundless and that group travel visas would be resumed soon.",
    "images": "/tweet/image/whyyoutouzhele/2023/05/13/1657308572550610948_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/BlMsCGCvlP",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1657340588952367104",
    "name": "李老师不是你老师",
    "createdDate": "2023-05-13 19:02:42",
    "content": "Netizen contribution\nOn May 12, a blog post introducing the donations made by Hong Kong people for the Wenchuan earthquake 15 years ago was listed as \"false information\" and the blogger was banned for seven days.\nSome netizens lamented, \"In 2008, blood is thicker than water, and in 2023, it was false information.\"\nAnother netizen joked that the reason why this Weibo post was listed as false may be because Run Run Shaw donated a total of 200 million, but the blog post only said 100 million.\nAccording to reports by the Hong Kong Economic Journal in 2013 and the People's Daily Overseas Edition in 2017, as well as an exclusive interview by Chief Secretary for Administration Carrie Lam in 2013, the Hong Kong Legislative Council allocated 9 billion Hong Kong dollars, the semi-official gambling charity organization Hong Kong Jockey Club donated 1 billion, and private donations amounted to 13 billion Hong Kong dollars, totaling about 22 billion.\nAt that time, when the then President Hu Jintao was in Beichuan County, Sichuan Province, he specifically told Hong Kong reporters: \"Thank you Hong Kong compatriots for your support for earthquake relief in the mainland. This reflects our blood is thicker than water. Please convey my gratitude to the vast number of Hong Kong compatriots.\"",
    "images": "/tweet/image/whyyoutouzhele/2023/05/13/1657340588952367104_0.jpg,/tweet/image/whyyoutouzhele/2023/05/13/1657340588952367104_1.jpg,/tweet/image/whyyoutouzhele/2023/05/13/1657340588952367104_2.jpg,/tweet/image/whyyoutouzhele/2023/05/13/1657340588952367104_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1657355734076497920",
    "name": "李老师不是你老师",
    "createdDate": "2023-05-13 20:02:53",
    "content": "Later, some netizens added that the audit results of social donations for the Wenchuan earthquake by the National Audit Office of China (announced on January 6, 2010) showed that as of September 30, 2009, by donation channel, domestic donations amounted to 72.305 billion yuan, foreign donations from international organizations and overseas Chinese amounted to 4.048 billion yuan, and donations from Hong Kong, Macao and Taiwan amounted to 3.350 billion yuan.",
    "images": "/tweet/image/whyyoutouzhele/2023/05/13/1657355734076497920_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/4TX3MZOLBh",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1657359264191770624",
    "name": "李老师不是你老师",
    "createdDate": "2023-05-13 20:16:55",
    "content": "@Winnieland0615 AI is developing so fast that it has learned to participate in politics",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1657374554610626561",
    "name": "李老师不是你老师",
    "createdDate": "2023-05-13 21:17:41",
    "content": "Netizen contribution\nOn May 12, pianist Peng Haitao moved a piano from Wuhan to Beichuan across 1,200 kilometers and performed in front of the ruins to commemorate the 15th anniversary of the Wenchuan earthquake.\n28 minutes later, the relevant departments rushed to the scene and moved the piano away, and the performance ended.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/05/13/1657374554610626561_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/JZNLlw87Kk",
    "accountId": "whyyoutouzhele"
  }
]