[{"id":"1757544813417677088","name":"李老师不是你老师","createdDate":"2024-02-14 07:18:31","content":"Recently, in Donghai County, Lianyungang, Jiangsu, the local government excavated soil to bury industrial waste in Moshan Reservoir, polluting water resources. A large number of villagers gathered at the site of the landfill to defend their rights, and some villagers gave speeches on the dam with speakers.\nAt the same time, a woman reported that local village cadres took the lead in opening casinos and lending money at high interest rates. Her sister was detained by the local police for reporting the matter online with her real name.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/14/1757544813417677088_0.jpg,/tweet/video/whyyoutouzhele/2024/02/14/1757544813417677088_1.jpg,/tweet/video/whyyoutouzhele/2024/02/14/1757544813417677088_2.jpg,/tweet/video/whyyoutouzhele/2024/02/14/1757544813417677088_3.jpg","hasPublished":true},{"id":"1757702765273325592","name":"李老师不是你老师","createdDate":"2024-02-14 17:46:10","content":"A netizen said that his WeChat account was blocked for 7 days because he discussed the incident in Zhaike Village, Ju County, Rizhao on WeChat.","images":"/tweet/image/whyyoutouzhele/2024/02/14/1757702765273325592_0.jpg","videos":"","hasPublished":true},{"id":"1757704202405429416","name":"李老师不是你老师","createdDate":"2024-02-14 17:51:53","content":"On February 13, Lianhe Zaobao reported: Cui Tiankai, former Chinese ambassador to the United States, said at a seminar recently that the Taiwan election is a local election in China, and China will eventually achieve unification, but China will not fall into the trap of \"Chinese killing Chinese\". He also said that last year, Chinese leaders had sent a clear signal of friendship and goodwill in San Francisco, which clearly showed that China wanted to be a partner and friend of the United States.","images":"/tweet/image/whyyoutouzhele/2024/02/14/1757704202405429416_0.jpg","videos":"","hasPublished":true},{"id":"1757704896223093162","name":"李老师不是你老师","createdDate":"2024-02-14 17:54:38","content":"On February 13, Yuzhou, Henan. A 13-year-old boy died of excessive drinking while dining at a buffet restaurant in Yifeng City Plaza. Family members held banners and burned paper money outside the mall to defend their rights. A large number of onlookers gathered around.\nFamily members said that the restaurant did not dissuade underage drinking. Afterwards, the mall leaders did not take it seriously.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/14/1757704896223093162_0.jpg","hasPublished":true},{"id":"1757740276666270046","name":"李老师不是你老师","createdDate":"2024-02-14 20:15:13","content":"On February 14, because of the custom of \"welcoming the God of Wealth on the fifth day of the first lunar month\", the Ministry of Finance's official account instantly became a wishing pool, with a large number of netizens pouring into its comment section to leave messages and pray. Some hoped that they could make a lot of money in the new year and pay the 45% personal income tax. Others hoped to have a job with five insurances and one housing fund and two days off a week.\nSo far, there have been 520,000 messages in the Ministry of Finance's official account comment section.","images":"/tweet/image/whyyoutouzhele/2024/02/14/1757740276666270046_0.jpg,/tweet/image/whyyoutouzhele/2024/02/14/1757740276666270046_1.jpg,/tweet/image/whyyoutouzhele/2024/02/14/1757740276666270046_2.jpg,/tweet/image/whyyoutouzhele/2024/02/14/1757740276666270046_3.jpg","videos":"","hasPublished":true},{"id":"1757745080704573654","name":"李老师不是你老师","createdDate":"2024-02-14 20:34:19","content":"After the incident in Zhaike Village, Ju County, Rizhao, an \"urgent notice on establishing a daily reporting system for social conflict risks and hidden dangers\" from the Rizhao Political and Legal Committee was circulated on Weibo. \nOn February 13-14, netizens from other surrounding areas revealed that similar notices were also issued in their areas, confirming that the local and surrounding areas are indeed investigating such people who may cause violent conflicts.","images":"/tweet/image/whyyoutouzhele/2024/02/14/1757745080704573654_0.jpg","videos":"","hasPublished":true},{"id":"1757758880237379774","name":"李老师不是你老师","createdDate":"2024-02-14 21:29:09","content":"On February 14, a photo of the entrance to Zhaike Village showed that the area had returned to calm, but there were suspected men in black standing not far from the entrance.\nIn the message area, the author said that everything was fine and the internal conflicts were resolved internally.","images":"/tweet/image/whyyoutouzhele/2024/02/14/1757758880237379774_1.jpg,/tweet/image/whyyoutouzhele/2024/02/14/1757758880237379774_2.jpg","videos":"","hasPublished":true},{"id":"1757761151637570021","name":"李老师不是你老师","createdDate":"2024-02-14 21:38:10","content":"Recently, in Kunming, Yunnan, some teachers and instructors posted on social media platforms that Yunnan Metallurgical Technical School (Wujiaba Campus) has been in arrears of wages for teachers and staff for several months. According to the school's WeChat screenshots, the principal promised to deal with the wages owed before the New Year at the end of February. The group issued a \"Statement on the Wage Situation\" on February 5, saying that the three-year epidemic, the sharp decline in the international and domestic economic environment, and various reasons such as overly aggressive development and lack of management have caused the continued arrears of wages. The group promised that it is expected to solve the problem of wage arrears from the end of February to early March.","images":"/tweet/image/whyyoutouzhele/2024/02/14/1757761151637570021_0.jpg,/tweet/image/whyyoutouzhele/2024/02/14/1757761151637570021_1.jpg,/tweet/image/whyyoutouzhele/2024/02/14/1757761151637570021_2.jpg,/tweet/image/whyyoutouzhele/2024/02/14/1757761151637570021_3.jpg","videos":"","hasPublished":true},{"id":"1757766447781052669","name":"李老师不是你老师","createdDate":"2024-02-14 21:59:13","content":"Current information update of Zhaike Village, Ju County, Rizhao:\nThe main culprit attacked at least four families on New Year's Eve\nThe village has the custom of not closing doors on New Year's Eve, which provides convenience for the murderer to commit serial crimes\nThe main culprit was subdued by the villagers at the scene\nWhy there is no scene picture is basically consistent with my judgment: in addition to the bad nature that triggered public opinion control, it is mainly because the villagers themselves do not want the matter to be spread\nAll information clues are summarized and sorted out: https://t.co/1U57vtU91I","images":"/tweet/image/whyyoutouzhele/2024/02/14/1757766447781052669_0.jpg","videos":"","hasPublished":true},{"id":"1757780641746243816","name":"李老师不是你老师","createdDate":"2024-02-14 22:55:37","content":"Recently, it was reported online that Zhu Yongguo, a shareholder of delisted A-share company Kangdexin, reported former China Securities Regulatory Commission Chairman Yi Huiman under his real name for suspected dereliction of duty.","images":"/tweet/image/whyyoutouzhele/2024/02/14/1757780641746243816_0.jpg,/tweet/image/whyyoutouzhele/2024/02/14/1757780641746243816_1.jpg,/tweet/image/whyyoutouzhele/2024/02/14/1757780641746243816_2.jpg","videos":"","hasPublished":true}]