[
  {
    "id": "1886082493746643346",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-03 00:01:22",
    "content": "Previously, an American \"TikTok refugee\" commented on Xiaohongshu that he worked in construction and earned $50 per hour. After that, the comment was deleted. Some netizens reminded him not to discuss salary again, otherwise there would be a risk of account suspension. At present, his account has been banned by the platform. https://pbs.twimg.com/media/Giy02H5bsAA47IR.jpg",
    "images": "/tweet/image/whyyoutouzhele/2025/02/03/1886082493746643346_0.jpg,/tweet/image/whyyoutouzhele/2025/02/03/1886082493746643346_1.jpg,/tweet/image/whyyoutouzhele/2025/02/03/1886082493746643346_2.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 350,
    "replies": 44,
    "retweets": 51,
    "views": 36492,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1886084922408071327",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-03 00:11:01",
    "content": "The editorial board of the Wall Street Journal severely criticized Trump for launching a trade war with Canada, Mexico, and China: the stupidest trade war in history.\nThe report pointed out that Trump launched a tariff offensive against Canada and Mexico, and they will be subject to a 25% border tax, while the real opponent China will be subject to a 10% tariff.\nPutting China aside, Trump's reasons for economic attacks on neighboring countries are completely unconvincing. He said that the purpose of imposing tariffs on Canada and Mexico is to solve the fentanyl crisis in the United States, but now it seems that fentanyl is just an excuse, and tariffs are not a means. Tariffs themselves are Trump's purpose.\nThe report emphasized that even if economic analysis is put aside, according to the US-Mexico-Canada trade agreement signed by Trump during his first presidency, the imposition of tariffs should not have happened. Trump tore up the agreement with his friends and ignored the obligation to fulfill the treaty, \"which will make other countries more inclined to refuse to reach an agreement with the United States.\" \n...",
    "images": "/tweet/image/whyyoutouzhele/2025/02/03/1886084922408071327_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 79,
    "replies": 16,
    "retweets": 9,
    "views": 23096,
    "originVideos": "",
    "hasFullContentTranslated": false,
    "fullContent": "华尔街日报编辑委员会严厉批评特朗普发动与加、墨、的贸易战：历史上最愚蠢的贸易战。\n 报导指出，特朗普向加拿大和墨西哥发动关税攻势，他们将被征收 25% 的边境税，而真正的对手中国将被征收10%的关税。\n 撇开中国不谈，特朗普对邻国进行经济攻击的理由完全无法令人信服， 他称向加墨开征关税是为了解决美国芬太尼危机，但是如今看起来，芬太尼只是借口，关税并非手段，关税本身就是特朗普的目的。\n 报导强调，即使撇开经济分析不谈，根据特朗普在他第一次总统任期内签署的美墨加贸易协定，开征关税这件事也不应该发生，特朗普撕毁了与朋友之间的协议，无视履行条约的义务，「这会让其他国家更倾向于拒绝与美国达成协议」。 \n 但如果北美贸易战持续下去，它将成为历史上最愚蠢的贸易战之一。」",
    "hasPublished": true
  },
  {
    "id": "1886086909073727758",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-03 00:18:55",
    "content": "Trump posted on social media that he hopes Canada will become the 51st state of the United States.\n\"We spend hundreds of billions of dollars every year to subsidize Canada. Why? There is no reason. We don't need anything from them. We have unlimited energy, should make our own cars, and we have more wood than we can use.\nWithout this huge subsidy, Canada will not be able to continue to exist as a competitive country. Although it sounds harsh, it is true!\nTherefore, Canada should become our cherished 51st state. In this way, they can enjoy lower taxes and better military protection-and no tariffs!\"",
    "images": "/tweet/image/whyyoutouzhele/2025/02/03/1886086909073727758_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 101,
    "replies": 38,
    "retweets": 7,
    "views": 33159,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1886089767043076164",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-03 00:30:16",
    "content": "February 2, Hebei. A retired soldier posted a video saying that he had served for more than ten years, had been awarded many times for meritorious service, and had led many soldiers, but he could not save his son who was lured to Cambodia. https://pbs.twimg.com/ext_tw_video_thumb/1886089632330448896/pu/img/tZmu2eBnKWZj5OjO.jpg",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2025/02/03/1886089767043076164_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 98,
    "replies": 28,
    "retweets": 16,
    "views": 17384,
    "originVideos": "https://video.twimg.com/ext_tw_video/1886089632330448896/pu/vid/avc1/720x1280/dLj0bdD0zmTvVktk.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1886094839210791381",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-03 00:50:26",
    "content": "Zhang Chi, from Zunyi, Guizhou, previously worked in the construction industry in China, and achieved an output value of tens of millions in just a few years. However, the real estate market has been down in recent years, and the intrigues in the engineering industry have caused the company to suffer heavy losses and debts, so he came to Russia to join the army to repay his debts. He said that he has repaid nearly half of his debts, and said that even if he died in battle, the pension would be used to repay the workers' wages and material fees. https://pbs.twimg.com/ext_tw_video_thumb/1886094589930708992/pu/img/JLd5I93-C-pNC9LS.jpg",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2025/02/03/1886094839210791381_0.jpg,",
    "isReply": true,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 17,
    "replies": 13,
    "retweets": 0,
    "views": 9098,
    "originVideos": "https://video.twimg.com/ext_tw_video/1886094589930708992/pu/vid/avc1/720x1270/-LwnmBSRPnge-0OE.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": false
  }
]