[
  {
    "id": "1731343753007243775",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 00:04:52",
    "content": "Later, it was reported that the airport had earlier investigated and asked to delete the relevant pictures and Moments.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731343753007243775_0.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731343753007243775_1.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731343753007243775_2.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731343753007243775_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/me6Mp0cO41",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731351926585831688",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 00:37:20",
    "content": "Zhou Ting recounted how she was asked by national security personnel to visit the Shenzhen Reform and Opening-up Exhibition Hall and Tencent headquarters and write a thank-you letter in exchange for her passport and the opportunity to study abroad. Now, considering her own safety and the deteriorating legal environment in Hong Kong, she has decided never to return to Hong Kong.",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731379715078750641",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 02:27:46",
    "content": "Errata, Shanghai to Hong Kong",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731379783911539053",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 02:28:02",
    "content": "Errata, Agnes Chow",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731399837961064686",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 03:47:43",
    "content": "Recently, junior high school students of the Chaoyang Branch of Renmin University High School, the largest middle school in Beijing, publicly protested on Weibo and posted a long article to accuse the principal due to excessive academic pressure.\nThe article said that there are 12 classes every day, and they have to go to school at 7:10 and go home at 9 pm. The lunch time is too short and there is no self-study time. It is completely \"cramming education\".\nAt present, the follow-up parents reported that the school parent meeting has been notified to change the school to 8 o'clock, cancel the stratified class, and study voluntarily in the evening. There are no exams and no lectures.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731399837961064686_0.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731399837961064686_1.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731399837961064686_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731588127129534472",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 16:15:55",
    "content": "Netizen contribution\nRecently, a student found a rat in the sesame sauce bowl in the second canteen of Jianghai Vocational and Technical College in Yangzhou, Jiangsu Province\nThe school responded that it was true and various departments are currently investigating.\nOn December 3, the student deleted the video.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/04/1731588127129534472_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/64RapooMiu",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731620605659644203",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 18:24:59",
    "content": "Netizen contribution\nThe Political and Legal Affairs Commission’s official account “Youliyoumianer” successfully demonstrated gender discrimination, racial discrimination, regional discrimination, sexual orientation and gender identity discrimination, and stereotypes in a short paragraph.",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/dcIldlVG39",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731623681514742158",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 18:37:12",
    "content": "On December 1, several new crown vaccines were approved for emergency use",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731623681514742158_0.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731623681514742158_1.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731623681514742158_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/iRaewqb8Y5",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731625943154745786",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 18:46:11",
    "content": "December 4th is China's tenth National Constitution Day.\nIn a video titled \"All power in the People's Republic of China belongs to the people\", only 6 comments can be seen in the comment section.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731625943154745786_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/XK24PoLIs8",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731627591885373448",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 18:52:44",
    "content": "December 3, Shandong.\nA blogger interviewed older migrant workers who were looking for daily wages on the street. They came out to look for work at 4 or 5 in the morning before dawn, leaving early and returning late every day. They worked hard for a month but could only guarantee basic living.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/04/1731627591885373448_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/ziJPHQTHaA",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731628439231148247",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 18:56:06",
    "content": "On December 3, the media reported that Mr. Zhang from Jiangsu said that on May 16, he bought a second-hand elevator house with an area of more than 80 square meters in Lancheng Chunfeng Jiangnan Community, Wuxi City, Jiangsu Province through Alibaba Auction, and the auction price was 520 yuan. A few days later, when he called Wuxi Paifang Network Technology Co., Ltd., which released the house auction information, he was told that the house could not be delivered. Mr. Zhang said that the other party gave two solutions, one was to refund his house auction amount and compensate him at 5% of the transaction price (26 yuan), and the other was to give him a 38% discount on the purchase of the house.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731628439231148247_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731630311241404716",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 19:03:32",
    "content": "On December 4, the People's Daily used a video of Xi Jinping taking the oath of office for his third term to promote National Constitution Day.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731630311241404716_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/vQk3oIp5Mk",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731638093780852835",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 19:34:28",
    "content": "At 8:30 on December 4, Shanghai.\nWhen the traffic police were on duty at the intersection of Nanquan North Road and Zhangyang Road, they found a takeaway boy who had violated traffic regulations.\nDuring the police's investigation, the takeaway boy left the scene on his own. About half an hour later, he returned to the scene, saying that he was unwilling to accept the punishment, and slightly scratched the police's hand with a Western knife.\nThen the police quickly controlled him with the help of the surrounding people.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/04/1731638093780852835_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/E14uPII9iX",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731638909602345143",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 19:37:43",
    "content": "December 2, Nanchang, Jiangxi.\nThe supporting columns of the underground garage in Huapeng Dong'an Community were damaged and cracked. The owners found that the developer quietly repaired these damaged supporting columns at night, which aroused strong dissatisfaction among the owners. In order to protect the evidence, the owners held hands and surrounded the damaged supporting columns.\nDuring this period, a large number of police forces formed a human wall to maintain stability.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/04/1731638909602345143_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/45smhkUbEr",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731639659120271651",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 19:40:41",
    "content": "June 26, 2023, Jixi City, Heilongjiang Province.\nA 13-year-old girl died of pneumonia at Jixi Jikuang Hospital, suspected of improper use of drugs by doctors.\nAccording to the child's mother, on June 26, the child suddenly had chills and high fever in the hospital. So the doctor gave the child two drugs, diazepam and phenobarbital, and then the child fell into a deep coma. The doctor died after the rescue failed. After the medical accident, the family asked to see the surveillance at the time of the incident, but the hospital said that the surveillance was lost.\nBecause the hospital never provided supplementary materials, the appraisal center was unable to accept it five months after the incident.\nOn December 3, the grief-stricken family members held the child's posthumous photo at the door of the hospital where the incident occurred to defend their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/04/1731639659120271651_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731639932026814854",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 19:41:46",
    "content": "Summary of contributions\nDecember 1, Wuhan City. It is suspected that someone jumped from the Yangtze River Bridge. Only a piece of clothing and a handbag were left at the scene.\nOn December 3, the photographer said that two people jumped off the Yunlong Lake Bridge in Shenyang City.\nOn the evening of December 3, the First Fujiang Bridge in Jiangyou, Mianyang City, Sichuan Province. A young girl jumped off a bridge, and then a brave man jumped into the river and fished the girl out.\nOn the evening of December 3, the Jindouwan Bridge in Zhongshan City, Guangdong Province. A young girl is sitting on the bridge, and people passing by are comforting the girl.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731639932026814854_0.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731639932026814854_1.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731639932026814854_2.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731639932026814854_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731648516957569529",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 20:15:53",
    "content": "On December 1, migrant workers who were seeking wages at Shanghai Powerlong Group had been sleeping outside for a month. Several police officers used blue cloth to block the workers from entering the area.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731648516957569529_0.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731648516957569529_1.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731648516957569529_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/XpyiZ5T24M",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731648705550225914",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 20:16:38",
    "content": "Follow-up",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731648705550225914_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/WlYqkgYe8u",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1731649444561420392",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-04 20:19:34",
    "content": "\"Is teaching a teacher's main job or a side job?\" \nOn December 2, the media reported that 28-year-old Jin Beibei has been teaching in a middle school in the south for four years. In her daily work, in addition to teaching tasks, she often falls into a cycle of filling out various materials and forms, inspections, evaluations, acceptance, and competitions, resulting in \"teaching well has become a luxury.\" He Xuexi, who is also a teacher, feels the same way. She feels that she is \"overwhelmed\" by a large number of non-teaching tasks. \nAs a class teacher, He Xuexi is responsible for managing the class. In order to \"see\" the management content, the school will arrange teachers to fill in various forms. Including daily absence record forms, daily, weekly, monthly and semester safety record forms, class teacher work manuals, behavioral norms classroom record forms, etc., with many forms, He Xuexi can't avoid falsification. \nIn 2021, the National Primary and Secondary School Students' Mental Health Education Research Group conducted a test on the mental health of teachers. The results showed that 69% of teachers felt stressed, had high anxiety, and just wanted to be a teacher quietly.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/04/1731649444561420392_0.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731649444561420392_1.jpg,/tweet/image/whyyoutouzhele/2023/12/04/1731649444561420392_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  }
]