[{"id":"1807082061523775805","name":"李老师不是你老师","createdDate":"2024-06-30 00:01:52","content":"On June 28, a video of the graduation ceremony for the senior class of the Joint Logistics Support Force Kindergarten triggered a lot of ridicule from netizens.","images":"/tweet/image/whyyoutouzhele/2024/06/30/1807082061523775805_0.jpg,/tweet/image/whyyoutouzhele/2024/06/30/1807082061523775805_1.jpg,/tweet/image/whyyoutouzhele/2024/06/30/1807082061523775805_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/06/30/1807082061523775805_0.jpg,","hasPublished":true},{"id":"1807089669257203725","name":"李老师不是你老师","createdDate":"2024-06-30 00:32:05","content":"In the early morning of June 29, in Shenzhen, Guangdong, investors of Dingyifeng gathered together to defend their rights and shouted slogans such as \"If you don't go to Futian, solve it here!\" A large number of police officers were present to maintain stability at the scene. It was reported that the chairman of the board of directors of Dingyifeng Group, Sui Guangyi, was arrested by the police that night.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/30/1807089669257203725_0.jpg,/tweet/video/whyyoutouzhele/2024/06/30/1807089669257203725_1.jpg,/tweet/video/whyyoutouzhele/2024/06/30/1807089669257203725_2.jpg,/tweet/video/whyyoutouzhele/2024/06/30/1807089669257203725_3.jpg,","hasPublished":true},{"id":"1807092348423475473","name":"李老师不是你老师","createdDate":"2024-06-30 00:42:44","content":"On the evening of June 27, in Wuhan, Hubei, the owners of the Panlongcheng Zhengrongfu community gathered together to protest against the high property management fees, the delay in refunding the difference in area, and the incomplete supporting facilities in the underground garage. During the period, the owners sang the national anthem in unison, and some owners shouted \"Someone is beating someone!\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/30/1807092348423475473_0.jpg,/tweet/video/whyyoutouzhele/2024/06/30/1807092348423475473_1.jpg,","hasPublished":true},{"id":"1807094425899634811","name":"李老师不是你老师","createdDate":"2024-06-30 00:50:59","content":"According to the calculation of Zhibenshe Data Center, in 2022, the average pension received nationwide will be 20,896 yuan, 2,454 yuan for urban and rural residents, and 72,232 yuan for government agencies and public institutions. Per capita accounting is more intuitive. The per capita pension of urban employees is about 15 times that of urban and rural residents, and the per capita pension of government agencies and public institutions is about 30 times that of urban and rural residents. The data shows that the current structural problems of pensions are more prominent.","images":"/tweet/image/whyyoutouzhele/2024/06/30/1807094425899634811_0.jpg,","videos":"","hasPublished":true},{"id":"1807114639173398545","name":"李老师不是你老师","createdDate":"2024-06-30 02:11:19","content":"On the evening of June 28, Zhangliu Village, Shibao Town, Xihe County, Longnan City, Gansu Province.\nThe local county government wanted to build a crematorium in Zhangliu Village, but was blocked by local villagers. That night, the special police and villagers had a dispute, and a pregnant woman was beaten and had a miscarriage. The contributor said that more than 20 people were arrested.\nOn the 29th, the police from the local police station and the local government's Internet police visited each household and asked the villagers who recorded the video last night to delete the video immediately.","images":"/tweet/image/whyyoutouzhele/2024/06/30/1807114639173398545_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/06/30/1807114639173398545_0.jpg,/tweet/video/whyyoutouzhele/2024/06/30/1807114639173398545_1.jpg,","hasPublished":true},{"id":"1807134043814969499","name":"李老师不是你老师","createdDate":"2024-06-30 03:28:25","content":"On June 29, in Sanlitun, Beijing, a man tried to jump off a building but was stopped from behind.\nOn his clothes were written “Power + Evil, kill the truth, and also kill me at the bottom”","images":"/tweet/image/whyyoutouzhele/2024/06/30/1807134043814969499_0.jpg,","videos":"","hasPublished":true}]