[
  {
    "id": "1784985064230514866",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 00:36:17",
    "content": "Just now, Zlibrary announced that due to the recent crackdown by Chinese judicial authorities on websites, donations and operating volunteers, Zlibrary will stop operating in China. It also stated that no books will be removed from the library. This means that the previous China-only version of \"Zlibrary\" plan has failed, and Chinese users will have to climb over the firewall if they want to access the website in the future.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1784985064230514866_0.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1784985064230514866_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785016701127422205",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 02:42:00",
    "content": "On April 28, a strange scene occurred in Jiangtian, Changle, Fuzhou. A cash transport truck ran over a cash transporter while reversing.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/30/1785016701127422205_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785038996436931061",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 04:10:35",
    "content": "Zlibrary cannot be searched on B site",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785038996436931061_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785040657725169788",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 04:17:11",
    "content": "Follow-up\nAfter deleting all the rights protection content, the person involved in the Yuncheng Huawei Wenjie M7 fire incident uploaded a statement. After choking up and reading a thank you, he hoped that everyone would delete the false reports on the Internet and stop disturbing him and his family.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785040657725169788_0.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785040657725169788_1.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/30/1785040657725169788_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785224634050195601",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 16:28:15",
    "content": "Recently, the provincial Party committee inspection team of Ankang City, Shaanxi Province worked in the city for 60 days.\nSome citizens wanted to report that the developer of Jianghua City in the city had joined forces with the community and relevant departments of the city to commit fraud, but they had no way to complain. More than 400 owners lost an average of about 600,000 yuan.\nHowever, the phone number set by the inspection team could not be reached and the email was returned.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785224634050195601_0.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785224634050195601_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785226100190114279",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 16:34:04",
    "content": "On April 29, 21st Century Business Herald announced the retraction of the article \"Reflections on the M7 accident: \"Exaggerated publicity\" backfired, and the price of \"being far ahead\" should not be life.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785226100190114279_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785229289190768651",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 16:46:45",
    "content": "Early in the morning of April 30, the Shanghai Public Health Clinical Center dispatched a construction team that did not have the qualifications to renovate a biosafety laboratory. Without any protection, they carried out \"renovation and maintenance\" on the biosafety laboratory that had conducted research on the new coronavirus, avian influenza, and HIV.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785229289190768651_0.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785229289190768651_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785229895410340248",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 16:49:09",
    "content": "On April 30, the No. 1 Senior High School in Pingyu County, Zhumadian City, Henan Province.\nBecause the school canteen has been selling expired or even expired food at a price several times higher than that outside the school, and there are behaviors such as canteen staff hooking up with female students, the students are collectively dissatisfied and protest in the form of \"big-character posters\" on the toilet wall.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785229895410340248_0.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785229895410340248_1.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785229895410340248_2.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785229895410340248_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785252709290938801",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 18:19:48",
    "content": "April 30, Beijing. A driver occupied the non-motorized vehicle lane to turn right and had an argument with a food delivery guy who was waiting for the red light. Then the driver stepped on the accelerator and knocked the food delivery guy down.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/30/1785252709290938801_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785259443405406610",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 18:46:34",
    "content": "April 28, Huizhou, Guangdong. During the renovation of the Shili Silver Beach Scenic Area, law enforcement officers forcibly moved villagers' belongings and loaded them into trucks, which aroused the dissatisfaction of the villagers and led to physical conflict between the two sides.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/30/1785259443405406610_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785271302808297781",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 19:33:41",
    "content": "The subsequent police report stated that it was because the woman ran a red light and obstructed the performance of duties.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785271302808297781_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785273717364240718",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 19:43:17",
    "content": "Recently, the blogger \"Old Wu is wandering\" released a video explaining what measures should be taken to stop losses after the house is unfinished. As of now, the video has received 160,000 likes and more than 100,000 collections.\nThe blogger said that after the house is unfinished, you can first borrow money from various platforms before stopping the payment, and then transfer the money to your married spouse or parents. Try to pay the mortgage for 6 installments first. If you don't have the money to pay, tell the loan company that you are bankrupt, and set up a strange phone interception. While waiting for the bank to sue, change the WeChat real-name authentication to parents so that even if you lose the case, WeChat payment can still be used normally.\nIn addition, you can also rent the unfinished house to a friend, let the friend sign a 19-year lease at one time, and let the friend transfer the 19-year rent to you at one time, and then take out the money and return it to the friend. In this way, even if the bank auctions the house that has stopped payment, because there is a lease, the bank needs to pay a large sum of money. Either no one bids for the house, and it has been unsold. When the price reaches a low point,...",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/30/1785273717364240718_0.jpg,",
    "hasFullContentTranslated": false,
    "fullContent": "近日，博主“老吴在流浪”发布视频讲解了房子烂尾后应该采取哪些措施来止损。该视频截至目前发文以收获16万点赞，超过10万收藏。\n博主表示房子烂尾后，在断供前可以先从各个平台贷款，再将钱转给已婚配偶或父母。房贷尽量先还6期，如果没钱还，就告诉贷款公司破产了，并设置陌生电话拦截，在等待银行起诉期间，将微信实名认证改为父母这样即使败诉，微信支付还可以正常使用。\n 除此之外，还可以把烂尾的房子出租给朋友，让朋友一次性签19年的租约，并让朋友一次性把19年的租金转给你，再把钱取出后还给朋友。这样即使银行拍卖断供的房子，因为有租约存在，银行需要赔偿一大笔钱。要么房子就无人竞拍，一直流拍，当价格到低点的时候，你还可以让朋友再拍回来。因为租约的存在，如果买房愿意赔付租金，你还可以拿到15-20万元的租金。",
    "hasPublished": true
  },
  {
    "id": "1785277270606655836",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 19:57:24",
    "content": "On April 27, Xi'an Public Security Police Camp Open Day Special Police Skills Demonstration\nComments deleted until only 9 left",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785277270606655836_0.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/30/1785277270606655836_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785277986108813688",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 20:00:15",
    "content": "Follow-up\nSeveral videos in which the anchor announced his candidacy were removed.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785277986108813688_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785283925545189824",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 20:23:51",
    "content": "The May Day holiday is coming, and some colleges and universities have recently issued a ban on group travel for students on campus.\nThe School of Public Administration of Central South University issued a notice stating that during the May Day holiday, the person in charge of holiday safety in each class should be clearly designated and reported to the school's student affairs office. Each class will hold a class meeting before the holiday. If there are students going out (including traveling or going home), they must ask for leave and cancel leave from the class monitor before going out and after returning to school. During the holidays, the contents of the \"Dormitory Safety Commitment\" should be implemented conscientiously. In principle, each class shall not organize student group activities to other places, and students are not encouraged to travel to other places in groups.\nThe Student Affairs Office, Graduate Affairs Department, and Security Office of Xuzhou Medical University issued a notice on doing a good job in student safety education during the May Day holiday. It is required that, in principle, during the holiday, it is strictly forbidden to organize student group activities by college or class. No unit or individual shall organize or participate in organizing students to participate in various tourism activities. Once discovered, they will be punished according to...",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785283925545189824_0.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785283925545189824_1.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785283925545189824_2.jpg,",
    "videos": "",
    "hasFullContentTranslated": false,
    "fullContent": "五一节假日来临，近日一些高校都出台了在校生组团出游的禁令。\n 中南大学公共管理学院发布通知称，，“五一”假期期间明确指定各班假期安全负责人并上报院学工办。各班于放假前召开班会，如有外出（包括外出旅游或回家）的学生，外出前和返校后必须向班长进行请假和销假。节假日期间，认真落实《寝室安全承诺书》内容，各班原则上不得组织去外地开展学生集体活动，不提倡学生集体到外地游玩。\n 徐州医科大学的学生工作处、研究生工作部、保卫处发布关于做好“五一”假期学生安全教育工作的通知。其中要求，原则上，放假期间，严禁以学院或班级为单位组织学生集体活动。任何单位和个人不得组织或参与组织学生参加各种旅游活动，一经发现将根据学校相关规定予以严肃处理。校内活动应向学校主管部门申报，批准后方可进行。各项活动须周密安排，应有辅导员参加，要制定好安全管理的预案，强化责任，落实到人。\n 在兰州交通大学网站上，发布了兰州交通大学学生工作部（处）劳动节假期学生安全教育管理的相关通知。其中提到，学校反对学生自行组织租车外出、团体旅游或骑自行车远游。特别提醒学生不乘坐非法客运车辆，严禁私自或组团包车外出。",
    "hasPublished": true
  },
  {
    "id": "1785284735876346141",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 20:27:04",
    "content": "On April 30, a video about \"One family, two generations of police\" by the Longgang Police Department in Shenzhen sparked ridicule among netizens.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785284735876346141_0.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785284735876346141_1.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785284735876346141_2.jpg,/tweet/image/whyyoutouzhele/2024/04/30/1785284735876346141_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785285163502428507",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 20:28:46",
    "content": "April 30, Neijiang, Sichuan. A man cut off a woman's ear in public. The man tried to escape after the attack but was caught up and subdued by passers-by.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/30/1785285163502428507_0.jpg,/tweet/video/whyyoutouzhele/2024/04/30/1785285163502428507_1.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785310389984465389",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 22:09:01",
    "content": "On the same day, people lined up to experience wearing handcuffs",
    "images": "/tweet/image/whyyoutouzhele/2024/04/30/1785310389984465389_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785321871577116822",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 22:54:38",
    "content": "On April 28, in Jinan, Shandong, a villager from Yaodezhuang Village reported that at about 1 a.m., a group of urban management officers broke into his home and forcibly demolished his legal residence.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/30/1785321871577116822_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1785321992469594351",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-30 22:55:07",
    "content": "https://t.co/Wwsgg6W14F",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/30/1785321992469594351_0.jpg,",
    "hasPublished": true
  }
]