[
  {
    "id": "1746970060738945293",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 02:58:14",
    "content": "Letter from a netizen: Thinking about the current situation, what else can we do? Hello, Mr. Li, I have been reading your reports for a long time, and I have also obtained a lot of information through Twitter. Thank you for always reporting wholeheartedly, but I have to say that most of these news are a bit heavy. After reading too much, I always feel a little powerless (I don’t know how many people feel the same way, it seems that we can do a survey). I know that many people have political depression, and I used to be a little like this...",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1746971235383173375",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 03:02:54",
    "content": "The employment situation is very good, and all walks of life have begun to make false claims.\nA few days ago, NetEase News and First Financial News \"maliciously slandered\" the living conditions of China's bottom-level workers.\nRecently, domestic media have continued to make efforts. They have successively launched takeaways for three years and earned 1.02 million yuan, a young man born after 1995 working as a bricklayer earns 2,000 yuan a day, and a rag picker born after 2000 earns 200,000 yuan a year, etc.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/16/1746971235383173375_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1747169477161013490",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 16:10:38",
    "content": "On January 16, Hu Jintao's son Hu Haifeng was appointed Vice Minister of Civil Affairs.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747169477161013490_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747183274240135317",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 17:05:28",
    "content": "On January 15, the well-known patriotic V Di Gua Xiong Lao Liu publicly complained that the employee restaurant of the Liaoning Brilliance BMW Plant \"did not have much food to eat\", which triggered a wide range of discussions among netizens. It is reported that the Liaoning Provincial Government invited a group of patriotic Vs to give advice on local tourism development and visit the BMW factory. When it was time for dinner, perhaps considering that the Vs were usually positive patriotic workers on the Internet, in order to show the local political outlook, they rejected BMW's invitation to the banquet, saying that they would strictly require the protection of the business environment and not bring burdens to enterprises, and only arranged employee meals for these Vs according to the government's 20 yuan lunch standard. As a result, many Vs were broken. Di Gua Xiong Lao Liu even directly complained that \"I ate leftovers\" and \"did not have much food to eat.\" Another V said, \"What kind of hospitality is it to only give me a 20 yuan meal? If I don't eat well, do you expect me to promote socialist industrial construction?\" There are also bloggers complaining that BMW took back the Bluetooth headsets they gave them after the visit. Some people even questioned whether there was a kickback in only giving people a 20 yuan meal. These remarks triggered ridicule from netizens. A local blogger said that workers usually eat these, and foreigners also eat these. These big Vs are used to eating big fish and meat, and now they can't swallow normal food.\nAnother blogger said that this group of positive energy always talks about the working class, competing to see who is more left-wing, but when they really eat in the workers' canteen, they become \"not human food\", and expel the working class from \"humanity\".\nA group of leftists put hats on others everywhere, saying that others have \"small Joe bourgeois thinking\", scolding Shanghai people for being petty bourgeoisie every day, saying that they love to go to the countryside and recall the bitterness and sweetness the most, but in reality they thoroughly implement the spirit of \"taking bribes\".\nAt the same time, many Liaoning netizens also accused the local government of not sending these gangsters of \"Quanmu Church\" and \"Okamoto Church\" to come, not only without traffic but also causing trouble for Liaoning people.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747183274240135317_0.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747183274240135317_1.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747183274240135317_2.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747183274240135317_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747185351410540567",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 17:13:43",
    "content": "January 15, Quzhou, Zhejiang. A man stabbed his ex-wife with a knife and then mutilated himself, and passers-by around him screamed in fear.\nAccording to a report from the Kaihua County Public Security Bureau of Quzhou, Zhejiang, a criminal case occurred on Tiantong Road, Majin Town, Kaihua County at around 14:00 on January 15. According to preliminary investigations, the suspect Wu (male, 44 years old, from Kaihua) stabbed his ex-wife (female, 36 years old, from Kaihua) with a fruit knife due to an emotional dispute, and then mutilated himself. At present, the two died after failed rescue efforts, and the case is under further investigation.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/16/1747185351410540567_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1747188406315089977",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 17:25:51",
    "content": "https://t.co/I4Yo0zpu6s",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747188406315089977_0.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747188406315089977_1.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747188406315089977_2.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747188406315089977_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747189478400160250",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 17:30:07",
    "content": "\"We never laugh at other people's jokes\" On January 16, the media reported that at the 4th China Short Video Conference, Shandong Radio and Television Party Committee Secretary and Director Lv Peng said: \"There is one thing I must report to all leaders. Lightning News never conducts cross-provincial public opinion supervision. We never laugh at other people's jokes. We never broadcast anything in the gray area. We only forward positive energy. Because Shandong Radio and Television is the TV station in Confucius' hometown, we keep in mind Confucius' golden rule-like motto accepted by all nations of mankind, that is, do not impose on others what you do not want others to do to you. As a person, especially a Shandong person, you must be kind. This is our basic principle. We never laugh at other people's jokes.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747189478400160250_0.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747189478400160250_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747191666887274819",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 17:38:49",
    "content": "On January 16, the news that an only child took care of four sick elderly people attracted the attention of netizens. Chou Bao (net name) from Jinan, Shandong, had a grandfather who was diagnosed with advanced colorectal cancer in May 2023 and passed away in October. His mother suffered from neurofibroma, and his grandmother had a sudden stroke and paralysis of the lower body. His grandfather also had heart disease. As an only child, Chou Bao took on the burden of taking care of four sick elderly people. In order to take care of them, Chou Bao quit his job and…",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/16/1747191666887274819_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1747192260016382394",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 17:41:10",
    "content": "Netizens lamented that \"the world is a huge Yu Hua novel\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747192260016382394_0.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747192260016382394_1.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747192260016382394_2.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747198053776236711",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 18:04:12",
    "content": "Hu Haifeng once briefly topped the Weibo hot search list",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747199464576586123",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 18:09:48",
    "content": "Recently, Taipei Mayor Jiang Wanan has become popular again. Under a video on the Straits New Line, \"Jiang Wanan accused the Democratic Progressive Party of becoming more and more professional under its rule, one-party dominance, corruption, and high-ranking officials making a lot of money while the people suffer,\" 60,000 netizens collectively said, \"Good scolding, I agree.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/16/1747199464576586123_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1747203546318045603",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 18:26:01",
    "content": "On January 16, a reporter asked how he viewed Philippine President Marcos' post on social media congratulating Lai Ching-te on his election as Taiwan's president. Foreign Ministry spokesman Mao Ning suggested that President Marcos read more books.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747203546318045603_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747204788675080686",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 18:30:57",
    "content": "Previously, Changsha University of Science and Technology also issued a notice stating that the payment of wages in January 2024 would be delayed because the financial indicators at the beginning of the year had not been issued.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747204788675080686_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747223863488922073",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 19:46:45",
    "content": "Some netizens from Shandong said that Shandong TV was not like this back then. Shandong TV had a program called \"Investigation\". When reporting some major events in the country, it would send reporters to the local area for interviews. For example, after the stampede on the Bund in Shanghai in 2014, Shandong TV reporters went to Shanghai for interviews the next day.\nIn addition, there was an incident in 2009 when a man from Shandong went to Tianjin to work and his son fell into the factory's wastewater pool. Then Wang Xi, a female reporter from Qilu TV (now merged with Shandong TV), was slapped by the factory owner when she went to Tianjin for an interview.\nThis scene was captured by a reporter from a newspaper who went with her, and this photo had a great influence at the time.\nAt that time, whether it was Shandong TV, which had satellites that could broadcast nationwide, or Qilu TV, which only broadcast within the province, they could go outside the province to conduct public opinion supervision interviews. As a result, as time goes by, the director of Shandong TV now stands up and says, \"We only forward positive energy.\" This kind of words really makes me feel sad...",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747223863488922073_0.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747223863488922073_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747232805031907386",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 20:22:17",
    "content": "Exclusive\nOn January 9, the Central Leading Group for the Study and Implementation of Xi Jinping Thought on Socialism with Chinese Characteristics for a New Era issued an internal instruction to the Party committees and governments across the country to promote the habit of living a tight life in the Party and government organs.\nThe document stated that it is necessary to deeply grasp the spirit of Xi Jinping's important instructions and urge the Party and government organs at all levels and Party members and cadres to form the habit of living a tight life.\nIt also pointed out that at present, there is a lack of strict control over government expenditures, a trend of extravagance and enjoyment in official receptions, and unfinished livelihood projects. \"People's projects\" have become \"troublesome projects.\" Some places have invested more funds in the development of government information platforms, squeezing out grassroots wages and operating expenses. If it is not corrected in time, it will seriously affect the people's trust and confidence in the Party and the government.\nAll localities, departments and units should fully realize the extreme importance and practical urgency of the Party and government organs living a tight life from the perspective of the Party's ruling foundation and ruling status.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747232805031907386_0.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747232805031907386_1.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747232805031907386_2.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747232805031907386_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747235449863614667",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 20:32:47",
    "content": "On January 16, it was reported online that 11 current students of Huazhong Agricultural University collectively reported to the public the academic fraud of Huang Feiruo, a professor of the School of Animal Science and Veterinary Medicine.\nThe article stated that Huang Feiruo and the two postdoctoral fellows he supervised had serious academic misconduct, forcing students to tamper with data and fabricate experimental results during their studies, which violated academic ethics.\nAt the same time, in the process of guiding students, they adopted high-pressure and harsh methods, frequently carried out personal attacks and insults, which seriously hurt the self-esteem and self-confidence of academics, causing many people to have mental anxiety and depression. At the same time, they also forced academics to do private work that was not related to their studies.\nStudents are loyal to science and education, so they cannot stand idly by. They also called on school leaders to strengthen the management of the teaching staff, protect the legitimate rights and interests and academic ethics of students and scientific researchers, and provide a good learning environment for the affected teachers and students.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747235449863614667_0.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747235449863614667_1.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747235449863614667_2.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747251364588134484",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 21:36:02",
    "content": "On January 15, there was a follow-up to \"Working for Byte for two years, being maliciously persuaded to quit and asked to return all wages.\"\nThe party concerned, Mr. Han, responded to Byte's rumor-busting on his WeChat public account.\nHe said that after the incident on January 12, ByteDance's legal department demanded 50,000 yuan in compensation plus an apology from the entire network.\nHe also said that in April 2022, ByteDance asked his parents to write a reconciliation letter in person and to explain the family's difficulties to the leaders.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747251364588134484_0.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747251364588134484_1.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747251364588134484_2.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747251364588134484_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1747251518179270735",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-16 21:36:38",
    "content": "https://t.co/GPBSml5Mi8",
    "images": "/tweet/image/whyyoutouzhele/2024/01/16/1747251518179270735_0.jpg,/tweet/image/whyyoutouzhele/2024/01/16/1747251518179270735_1.jpg",
    "videos": "",
    "hasPublished": true
  }
]