[{"id":"1869052796731035765","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 00:11:26","content":"December 17, Tianjin. A \"Ding Yizhen-style window\" appeared at the Dachang Motor Vehicle Inspection Center in Xiqing District. Because the counter was set too low, citizens had to kneel on the ground to handle business. \nCurrently, the video has been deleted.","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869052796731035765_0.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869052796731035765_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/12/18/1869052796731035765_0.jpg,","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":150,"replies":23,"retweets":19,"views":30283,"originVideos":"https://video.twimg.com/ext_tw_video/1869052174640295936/pu/vid/avc1/720x1280/1zmkAUm2GkUhOqwy.mp4?tag=12,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1869073335914807321","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 01:33:03","content":"Recently, a man posted a video saying that he spent 100,000 RMB to enroll in a Japanese IT language school, whose president is Chinese, but he found out that he was cheated after arriving in Japan. At present, his Japanese is only at N2 level, and his money is about to run out, so he can only survive by eating instant noodles every day.\nThe man said that the school is called \"Karuizawa\" Language School, located in Nagano, Japan. Before that, he worked as a takeaway and online car-hailing worker in China. Due to the great pressure in China, he happened to see the president of the school sharing his extravagant life in Japan on Douyin every day, so he spent 100,000 yuan to enroll.\nBut after arriving in Japan, he found out that the school's IT teacher had previously worked in decoration in China, and students could only ask AI if they had any questions, while students in other classes learned through online classes. After discovering that he was cheated, he applied to the school for a refund of the fee and rent. But the school said that if they wanted to refund the rent, they needed to sign an agreement first and promise not to discuss the matter publicly on the Internet.\nThe man also revealed that the president...","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869073335914807321_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/12/18/1869073335914807321_0.jpg,/tweet/video/whyyoutouzhele/2024/12/18/1869073335914807321_1.jpg,/tweet/video/whyyoutouzhele/2024/12/18/1869073335914807321_2.jpg,","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":253,"replies":87,"retweets":33,"views":57182,"originVideos":"https://video.twimg.com/ext_tw_video/1869071579684143104/pu/vid/avc1/408x724/RdFcMaCY8Eb-9OeD.mp4?tag=12,https://video.twimg.com/ext_tw_video/1869071591084310528/pu/vid/avc1/408x724/iswDWjPeAU9ZDB9v.mp4?tag=12,https://video.twimg.com/ext_tw_video/1869071607240781824/pu/vid/avc1/408x724/gWyScYVdq1VKtd8h.mp4?tag=12,","hasFullContentTranslated":false,"fullContent":"近日，一男子发视频称，他花费10万人民币报名一家日本It语言学校，社长是华人，可到了日本以后才发现被骗。目前自己日语仅有N2水平，并且钱也要花光了，每天只能靠吃泡面度日。\n 男子称该校名叫“轻井泽”语言学校，位于日本长野。此前自己在国内从事外卖员和网约车工作，因国内压力大，恰巧又看到该校社长每天都在抖音分享在日本的奢靡生活，于是便花费10万元报了名。\n 可来到日本后才发现，学校的it老师此前在国内从事装修工作，并且学员有问题只能请教AI,其他班级的学员通过网课学习。自己在发现被骗后向学校提出退费退房租的申请。但学校表示想要退房租就需要先签署协议，并且保证不再网络公开讨论此事。\n 男子还透露社长恐吓学员“我让在日本消失你信不信”并且此前就有被骗学员跳楼维权。\n 目前，该社长并未出面回应，而是把抖音账号设置为私密。","hasPublished":true},{"id":"1869078450058953153","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 01:53:22","content":"December 17, Huanggang City. Netizens said that the community came to the residents' homes and asked them to fill out a \"Special Issues Investigation Form\"","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869078450058953153_0.jpg,","videos":"","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":84,"replies":28,"retweets":5,"views":31095,"originVideos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1869168388326703484","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 07:50:45","content":"The 2022 students of the Yaohai Campus of Hefei No. 1 Middle School posted big-character posters because they were dissatisfied with the school management, quoting Marx, Lenin, and Mao, calling on all the oppressed students of the grade to unite. He called some of the school management the bureaucratic class and believed that they oppressed students. There are also the following unreasonable behaviors: 1. Strictly check lateness on Monday and Saturday mornings when there are exams every Sunday. 2. Forcibly wake up when sleeping during evening self-study. 3. Students are not allowed to play ball in the yard. 4. Force students to learn Tai Chi. The big-character posters in the film quoted a lot of class struggle and revolutionary theories of Marx and Lenin, and even quoted \"Rebellion is justified. Where there is oppression, there is resistance!\" from Mao's Selected Works, calling on everyone to unite and resist without cooperation.","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869168388326703484_0.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869168388326703484_1.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869168388326703484_2.jpg,","videos":"","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":481,"replies":72,"retweets":43,"views":86556,"originVideos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1869173196303601844","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 08:09:52","content":"Children are not allowed to leave the classroom during recess in Shanghai primary schools. Parents are called in when children play during recess. The school is \"keeping children in captivity\" for \"safety\"\nOn December 16, a Shanghai parent posted a post on the forum complaining that children are not allowed to leave the classroom for 10 minutes during recess in Shanghai primary schools (except for going to the toilet). There is very limited movement in the classroom. Children in the front row cannot walk to the back row. They are not allowed to go to the playground.\nAnother parent said: The child was notified of reading the book \"New Standard Japanese\" during the class meeting, and education was strengthened\nSeveral children in the same class of the blogger's child were jogging and chasing each other near the toilet corridor. Occasionally, they would hide in the toilet for a few seconds before coming out, and their parents were also called.","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869173196303601844_0.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869173196303601844_1.jpg,","videos":"","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":220,"replies":49,"retweets":19,"views":45767,"originVideos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1869174242807529964","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 08:14:01","content":"On December 17, Hefei City issued a risk warning: There are 50,000 online ride-hailing vehicles and 100,000 licensed drivers in the city. However, the average daily order volume for online ride-hailing vehicles is only 11.5, and the empty driving rate reaches 45%. Eighty percent of online ride-hailing drivers have an average daily turnover of less than 300 yuan.","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869174242807529964_0.jpg,","videos":"","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":171,"replies":34,"retweets":21,"views":37621,"originVideos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1869175020045660276","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 08:17:07","content":"Netizens added","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869175020045660276_0.jpg,","videos":"","isReply":true,"isRetweet":false,"isSelfThread":false,"likes":135,"replies":11,"retweets":8,"views":34921,"originVideos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1869178895939068365","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 08:32:31","content":"December 16th Shenzhen Luohu Evergrande Tianxi construction site workers threatened to jump off the building to demand their wages, from day to night. Some workers sat on the rooftop terraces of the 20th and 30th floors, and used loudspeakers to demand their wages. The police \"persuaded\" them to leave until night.","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869178895939068365_0.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869178895939068365_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/12/18/1869178895939068365_0.jpg,/tweet/video/whyyoutouzhele/2024/12/18/1869178895939068365_1.jpg,","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":140,"replies":41,"retweets":19,"views":27025,"originVideos":"https://video.twimg.com/ext_tw_video/1869178217405562880/pu/vid/avc1/848x464/vtsuSCtHO3e_RC0Q.mp4?tag=12,https://video.twimg.com/ext_tw_video/1869178237261328384/pu/vid/avc1/848x464/-hrOdT0_E615ZvCp.mp4?tag=12,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1869186320008110408","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 09:02:01","content":"Netizen submission: The victim, who had posted a message for help and claimed that she was the second Li Yixue, was forcibly sent to a mental hospital for injections and medication by the man’s family who broke up with her. On May 15, she jumped off a building in Zhengjia Plaza in Tianhe District, Guangzhou to defend her rights. Before the girl attempted suicide, she had just experienced being humiliated and framed by the judge and the man in court, and was unfairly sentenced to lose the case. It is reported that the man’s mother is a senior executive of China Unicom, his father is the director of a traditional Chinese medicine hospital, and his grandfather is a general.","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869186320008110408_0.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869186320008110408_1.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869186320008110408_2.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869186320008110408_3.jpg,","videos":"","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":109,"replies":28,"retweets":12,"views":24238,"originVideos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1869188742059282933","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 09:11:38","content":"On December 17, Yu Donglai released the compensation standards for personal dignity, and stated: When personal dignity is violated, everyone must have the awareness and courage to take legal measures to protect their own rights and interests. It is not allowed to easily sign a letter of apology. At the same time, actively apply to the company for compensation for violation of personal dignity. If necessary, ask a psychological counselor to provide psychological counseling to reduce the psychological damage to employees. A minimum compensation of 4,000 yuan will be made to employees whose dignity was previously damaged.","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869188742059282933_0.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869188742059282933_1.jpg,","videos":"","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":148,"replies":28,"retweets":12,"views":18840,"originVideos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1869192141001593234","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 09:25:08","content":"Netizen contribution: A \"luxurious\" school was established in Fuping County, Weinan City, Shaanxi Province. The school was named Zhongxun School after Xi Zhongxun, the father of the current President Xi Jinping.\nThe school also has a handwritten inscription by Qi Xin","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869192141001593234_0.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869192141001593234_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/12/18/1869192141001593234_0.jpg,","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":83,"replies":37,"retweets":10,"views":13980,"originVideos":"https://video.twimg.com/ext_tw_video/1869191435158949888/pu/vid/avc1/720x1280/aSjGUr5zopf2xxbm.mp4?tag=12,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1869194122856399184","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 09:33:01","content":"The \"Guangzhou Electric Bicycle Management Regulations\" will be implemented on December 30, and a special license plate for electric bicycles will be introduced, and more than 200 electronic capture devices will be used for electric bicycles.\nThe regulations require that the maximum speed of electric bicycles on non-motorized vehicle lanes cannot exceed 15 kilometers per hour. Delivery drivers reported that the speed limit would cause delivery timeouts.","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869194122856399184_0.jpg,/tweet/image/whyyoutouzhele/2024/12/18/1869194122856399184_1.jpg,","videos":"","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":44,"replies":20,"retweets":0,"views":7582,"originVideos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1869196391760969745","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-18 09:42:02","content":"Dean Huang of Henan University of Science and Technology bought \"official\" wine on credit for 90,000 yuan. The seller asked for it many times but to no avail. Huang said that he did not drink and refused to admit it. When the seller came to collect the debt, he died of cerebral hemorrhage.\nOn December 16, some netizens reported online that the staff of the School of Continuing Education of Henan University of Science and Technology had bought \"official wine\" from his relatives for more than 90,000 yuan on credit, saying that the leader wanted to buy it, and issued an IOU. After asking for it many times but to no avail, the relatives suddenly died of cerebral hemorrhage when they asked for it.\nThe netizen posted: \"Henan University of Science and Technology owes me money for cigarettes and alcohol, and I have an IOU signed and handprinted by Director Wu. The IOU states that it is for official wine required by Henan University of Science and Technology... I have gone to the school several times over the years to ask them to shirk responsibility and pass the buck without solving the problem... The child's father was so angry that he went to Henan University of Science and Technology alone to argue... I don't know what happened at the time, but he died of cerebral hemorrhage in the hospital with hatred...\"\nThe reporter contacted Dean Huang mentioned in the IOU. A resume published by a college of Henan University of Science and Technology in 2023 shows...","images":"/tweet/image/whyyoutouzhele/2024/12/18/1869196391760969745_0.jpg,","videos":"","isReply":false,"isRetweet":false,"isSelfThread":false,"likes":13,"replies":7,"retweets":4,"views":2258,"originVideos":"","hasFullContentTranslated":false,"fullContent":"河南科技大学黄院长买“公务用”酒赊账9万，卖家多次索要无果，黄某称其不喝酒不认账，卖家上门要账时脑出血死亡\n12月16日 有网友在网上反映称，河南科技大学继续教育学院工作人员曾向其亲属购买了“公务用酒”，赊账9万多元，称是领导要买的，并出具欠条，多次索要无果，后亲属要账时突发脑出血死亡。\n这名网友发文称：“河南科技大学欠我烟酒款不结帐，有武主任签字手印欠条，欠条上载明为河科大要的公务用酒……这些年数次去学校要他们互相推诿踢皮球不解决……孩子爹气不过就孤身去河科大理论…不知道当时发生啥情况就脑出血住院含恨离世了……”\n记者联系上欠条中提及的黄某某院长。河南科技大学某学院2023年公布的一份简历显示，当时黄某某已是河南科技大学研究生工作部部长，某博士生导师。 “你信吗？个人借款行为，和我没有关系，（欠条）公章都没有。我都不喝酒的，我要那么多酒干嘛？”黄某某对记者表示，此事与其无关。关于更多的情况，黄某某建议记者询问学校方面。","hasPublished":false}]