[{"id":"1745489788151472363","name":"李老师不是你老师","createdDate":"2024-01-12 00:56:09","content":"On January 11, the Harbin Medical University Hospital issued an internal notice requiring a statistics of the number of people who can speak Russian.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745489788151472363_0.jpg","videos":"","hasPublished":true},{"id":"1745490629767885267","name":"李老师不是你老师","createdDate":"2024-01-12 00:59:30","content":"On January 10, a netizen on V2EX recounted his story from how he changed his profile picture to a \"Winnie\" on Xiaohongshu to being invited for tea by the police.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745490629767885267_0.jpg","videos":"","hasPublished":true},{"id":"1745533557945037015","name":"李老师不是你老师","createdDate":"2024-01-12 03:50:05","content":"Nanjing Normal University student submission:","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745533557945037015_0.jpg","videos":"","hasPublished":true},{"id":"1745533976427573489","name":"李老师不是你老师","createdDate":"2024-01-12 03:51:45","content":"https://t.co/jNEwwf9BK1","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745533976427573489_0.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745533976427573489_1.jpg","videos":"","hasPublished":true},{"id":"1745585838572892532","name":"李老师不是你老师","createdDate":"2024-01-12 07:17:49","content":"On January 11, the National Immigration Administration further relaxed the convenience for foreigners to come to China. \nFor foreigners who urgently need to come to China for business, visits, investment, visiting relatives and handling personal affairs, and who do not have time to apply for a visa abroad, they can apply for a visa on arrival at the port visa authority with an invitation letter and other relevant supporting documents.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745585838572892532_0.jpg","videos":"","hasPublished":true},{"id":"1745586296754487683","name":"李老师不是你老师","createdDate":"2024-01-12 07:19:39","content":"However, a day ago, official media collectively reported the news that foreign spies took advantage of port clearance convenience to engage in infiltration and sabotage activities.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745586296754487683_0.jpg","videos":"","hasPublished":true},{"id":"1745627405136642296","name":"李老师不是你老师","createdDate":"2024-01-12 10:03:00","content":"On the evening of January 10, it was reported online that someone went to the Shanghai Financial Exchange and wrote graffiti: \"Myanmar A Fraud Exchange\". This is where the Shanghai Stock Exchange is located.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745627405136642296_0.jpg","videos":"","hasPublished":true},{"id":"1745717869642473511","name":"李老师不是你老师","createdDate":"2024-01-12 16:02:28","content":"On January 12, the verdict was announced in the first instance of Dalian Pastor Kan Xiaoyong’s case.\nThe six defendants, Kan Xiaoyong, Wang Fengying, Chu Xinyu, Zhao Qianjiao, Zhang Songai, and Liang Dongzhi, were suspected of using superstition to undermine law enforcement and illegal business operations. They were found guilty but not found guilty of fraud.\nPastor Kan Xiaoyong was sentenced to 14 years, his wife was sentenced to 4 years, and four church volunteers were sentenced to 3 to 10 years. ","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745717869642473511_0.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745717869642473511_1.jpg","videos":"","hasPublished":true},{"id":"1745718945397514415","name":"李老师不是你老师","createdDate":"2024-01-12 16:06:45","content":"On January 12, migrant workers at China Resources Land Yuejun City in Hangzhou demanded their wages.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745718945397514415_0.jpg","videos":"","hasPublished":true},{"id":"1745720749279658099","name":"李老师不是你老师","createdDate":"2024-01-12 16:13:55","content":"On January 12, Shaanxi police released a video saying that on Police Day, a man in Jingyang County, Xianyang City, posted a comment online saying \"traffic police are all idiots\" and was detained for ten days and publicly apologized.\nThis caused netizens to complain in the comment section","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745720749279658099_0.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745720749279658099_1.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745720749279658099_2.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745720749279658099_3.jpg","videos":"","hasPublished":true},{"id":"1745724230371623091","name":"李老师不是你老师","createdDate":"2024-01-12 16:27:45","content":"On January 12, schools in Daqing notified parents not to make false statements before the new policy was introduced.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745724230371623091_0.jpg","videos":"","hasPublished":true},{"id":"1745724255055077887","name":"李老师不是你老师","createdDate":"2024-01-12 16:27:51","content":"At present, the video has been taken down by Shaanxi police.","images":"","videos":"","hasPublished":true},{"id":"1745726924264013834","name":"李老师不是你老师","createdDate":"2024-01-12 16:38:27","content":"@woyongdehuawei can be called Little Potato","images":"","videos":"","hasPublished":true},{"id":"1745727279181828344","name":"李老师不是你老师","createdDate":"2024-01-12 16:39:52","content":"https://t.co/uvzArJBxD5","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745727279181828344_0.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745727279181828344_1.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745727279181828344_2.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745727279181828344_3.jpg","videos":"","hasPublished":true},{"id":"1745727412166377770","name":"李老师不是你老师","createdDate":"2024-01-12 16:40:23","content":"Some netizens directly rushed to the tower in the comment area","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745727412166377770_0.jpg","videos":"","hasPublished":true},{"id":"1745740778507252166","name":"李老师不是你老师","createdDate":"2024-01-12 17:33:30","content":"On January 10, according to the WeChat public account \"Beautiful Yingjiang\" of the Publicity Department of Yingjiang County Party Committee, at the Eighth Plenary Session of the 13th Committee of Yingjiang County, the plenary session reviewed and passed the \"Resolution on Yingjiang County's Application for the Rename of Zhina Township to Jie Na Township\", and the county party secretary Li Xingzhuang explained to the plenary session on the matter of renaming Zhina Township to Jie Na Township.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745740778507252166_0.jpg","videos":"","hasPublished":true},{"id":"1745742689595797514","name":"李老师不是你老师","createdDate":"2024-01-12 17:41:06","content":"On January 11, it was reported online that the incense money of Xifang Jingyuan in Putuo Mountain, Zhoushan, Zhejiang was stolen by several foreign tourists, which caused the surrounding Chinese tourists to angrily surround and quarrel with the Chinese tour guide. On January 12, a staff member of Xifang Jingyuan said that foreigners did steal money, but the amount was not clear at present.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/12/1745742689595797514_0.jpg","hasPublished":true},{"id":"1745744134042796240","name":"李老师不是你老师","createdDate":"2024-01-12 17:46:50","content":"On January 12, the National Business Daily reported that the CPC Guangdong Provincial Committee and the Guangdong Provincial People's Government issued the \"Implementation Opinions on Promoting the Development and Growth of the Private Economy and Further Promoting the High-Quality Development of the Private Economy\". It mentioned that private enterprises are encouraged to participate in the mixed ownership reform of state-owned enterprises. Except for areas that the state clearly stipulates should be controlled by state-owned capital, private capital can hold controlling stakes in mixed-ownership enterprises to protect the rights and interests of private capital in mixed ownership. A mixed-ownership project release mechanism should be established, relying on appropriate property rights trading institutions to publicly release cooperation projects on a regular basis.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745744134042796240_0.jpg","videos":"","hasPublished":true},{"id":"1745746193269801156","name":"李老师不是你老师","createdDate":"2024-01-12 17:55:01","content":"January 11, Yantai, Shandong. A cleaner heard a baby crying while cleaning the restroom in a shopping mall. After opening a black woven bag, she found a naked abandoned baby.\nThe Nan Dajie Police Station responded that the child had been sent to the welfare home and had been properly handled.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/12/1745746193269801156_0.jpg","hasPublished":true},{"id":"1745746415471493377","name":"李老师不是你老师","createdDate":"2024-01-12 17:55:54","content":"@xiaozhangyor This is how being a big blogger in China works. Understanding life","images":"","videos":"","hasPublished":true},{"id":"1745748097534197927","name":"李老师不是你老师","createdDate":"2024-01-12 18:02:35","content":"On January 11, the Hebei Provincial Government agreed to establish Xiongan New Area as a \"provincial-level high-tech industrial development zone.\" This sparked doubts among netizens.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745748097534197927_0.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745748097534197927_1.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745748097534197927_2.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745748097534197927_3.jpg","videos":"","hasPublished":true},{"id":"1745750427390345595","name":"李老师不是你老师","createdDate":"2024-01-12 18:11:51","content":"Recently, a villager from Shigouai Village, Banzhuang Town, Lianyungang City, filmed a video saying that he and fellow villagers reported their village party secretary's corruption and illegal behavior to the local Commission for Discipline Inspection, but they have not received a reply from the Commission for Discipline Inspection. During their inquiry to the Commission for Discipline Inspection, Wei, the secretary of the Banzhuang Town Commission for Discipline Inspection, not only did not answer the villagers' questions, but when the villagers asked for the results of the investigation, he cursed \"I want your ass\" and then drove them out of the office.\nMeng Qingquan said that he never thought that the villagers only asked for a written reply, and the town Commission for Discipline Inspection secretary treated the villagers so rudely\nAfter the incident fermented online, on the evening of January 11, the Banzhuang Town Government Propaganda Office replied that the town party secretary had severely criticized and educated Wei, the secretary of the town Commission for Discipline Inspection, and ordered him to make a profound review, and the village secretary has been suspended.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/12/1745750427390345595_0.jpg","hasPublished":true},{"id":"1745755903322677538","name":"李老师不是你老师","createdDate":"2024-01-12 18:33:36","content":"On January 11, a student jumped off a building at Fujian Medical University.\nAccording to the younger brother of the deceased, it was suspected that the exam schedule was extremely unreasonable and the students were under too much pressure. He also said that this was the second student suicide in recent times.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745755903322677538_0.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745755903322677538_1.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745755903322677538_2.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745755903322677538_3.jpg","videos":"","hasPublished":true},{"id":"1745760809697849446","name":"李老师不是你老师","createdDate":"2024-01-12 18:53:06","content":"Recently, a vocational and technical school in Foshan, Guangdong, was suspected of illegal over-enrollment, resulting in a large number of students finding out that they did not have a student status after one semester. The incident caused dissatisfaction among parents and students, who went to the school to ask for an explanation from the leaders.\nA school leader at the scene shouted, \"It's useless for me to say it, or should we go to the Education Bureau to communicate now?\" As a result, the students unanimously agreed, causing him to awkwardly lower his head and check his phone.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/12/1745760809697849446_0.jpg","hasPublished":true},{"id":"1745772022645358939","name":"李老师不是你老师","createdDate":"2024-01-12 19:37:39","content":"On January 12, netizens in Hohhot received a group text message reminding migrant workers not to gather and petition governments and relevant departments at all levels in illegal ways such as petitioning for wages or endangering social public order. \nThe legal complaint channel phone number was also announced.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745772022645358939_0.jpg","videos":"","hasPublished":true},{"id":"1745783510613291094","name":"李老师不是你老师","createdDate":"2024-01-12 20:23:18","content":"A company in Fengxian County was fined 100,000 yuan for using Xi Jinping's portrait in violation of regulations. On January 9, the Xuzhou Fengxian Forum released a \"typical case of violating advertising\". Xuzhou Hongxun Motorcycle Co., Ltd. was fined 100,000 yuan for setting up an advertising space in its factory area with a picture of Xi Jinping applauding. It was found to be using the image of the national leader for commercial promotion in disguise.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745783510613291094_0.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745783510613291094_1.jpg","videos":"","hasPublished":true},{"id":"1745784363814437128","name":"李老师不是你老师","createdDate":"2024-01-12 20:26:42","content":"@midwaydude The city side or the dock side, the inner city is full of bridges and it's hard to walk with luggage","images":"","videos":"","hasPublished":true},{"id":"1745790805099340214","name":"李老师不是你老师","createdDate":"2024-01-12 20:52:17","content":"On January 12, a PDF titled \"Working for ByteDance for two years, was maliciously persuaded to quit and asked to return all wages\" circulated online.\nThe author said that he often saw many people on Maimai who were helpless in the face of malicious layoffs. So he decided to show everyone the actual details and experience of workers fighting against head capital.\nThe author said in the article that he joined the company through social recruitment in March 2020, with a grade of 2-1, a basic monthly salary of 12,000 yuan, and a position as UG product manager. The author said that after joining the project team, it was normal to work overtime until 12 o'clock every night, which caused him to suffer from \"carotid artery plaque\" at a young age. In addition to working overtime frequently, when the leader feels helpless in dealing with a matter, he, as a subordinate, has to take the blame for the project.\nIn April 2021, the author completed the Spring Festival Gala project well, and his annual performance in 2020 was E, and he was successfully promoted and given a salary increase. However, even so, the author's salary only reached the average level of fresh graduates. The previous promise of salary determination based on level by leader Wu Xiaodan and HR was not fulfilled.\nIn May 21, the author had an argument with leader Wu Xiaodan in the Feishu work group over work issues. Since then, leaders Wu Xiaodan and Zhang Nan have long neglected and marginalized the author. And in June, the author still had to deal with work every day during his annual leave.\nAccording to the author's recollection, during September-October 2021, the leader Zhang Nan confessed to herself after drinking, \"Do you know why I never pay attention to your work? Because what you do is not important to me.\" Then she pointed to the classmate who was doing the activity and said, \"What he does is the most important to me.\" \nIt was not until April 2022 that Zhang Nan and HR Li Mingyang informed the author that the annual performance evaluation was M-, and HR told the author that M- could not be transferred internally and could only resign. And give the author one month to find a job. \nIn mid-May, the author successfully found an offer from Kuaishou's overseas team and told HR Li Mingyang that he could go through the resignation process, but Li Mingyang urged him to sign the \"Notice of the Start of the Non-competition Agreement\" as soon as possible so that he could get a resignation certificate. \nIn April 2023, after the author joined the overseas department of Kuaishou, he received a notice from the Haidian Arbitration Committee that ByteDance sued the author for violating the professional agreement and demanded compensation of 600,000 yuan for breach of contract. At present, the author and ByteDance still have four lawsuits in progress on this matter. The author said frankly: Although the chances of winning each lawsuit seem very low, he will continue to update the document and provide some valuable suggestions to ByteDance workers.\nNetizens said that the abuse of non-compete agreements by large companies is serious, and the scope of restrictions basically covers all well-known companies.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745790805099340214_0.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745790805099340214_1.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745790805099340214_2.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745790805099340214_3.jpg","videos":"","hasPublished":true},{"id":"1745792362331148606","name":"李老师不是你老师","createdDate":"2024-01-12 20:58:29","content":"https://t.co/1F4pzKvVNv","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745792362331148606_0.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745792362331148606_1.jpg,/tweet/image/whyyoutouzhele/2024/01/12/1745792362331148606_2.jpg","videos":"","hasPublished":true},{"id":"1745793615677251634","name":"李老师不是你老师","createdDate":"2024-01-12 21:03:27","content":"On January 12, Douyin officially issued a clarification statement in response to the online article \"Worked hard for Byte for two years, was maliciously persuaded to quit and asked to return all wages\", saying that after verification, the article contained false and one-sided content. It also said that the other party frequently checked Douyin's core data before leaving, and in order to prevent the leakage of core business secrets, it signed a non-compete agreement with the employee in accordance with the law. Later, it was discovered that the employee violated the non-compete agreement and joined a competing company while receiving dedication compensation, and decided to initiate the prosecution process.","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745793615677251634_0.jpg","videos":"","hasPublished":true},{"id":"1745837794352648312","name":"李老师不是你老师","createdDate":"2024-01-12 23:59:00","content":"https://t.co/9bNiSCiyyS","images":"/tweet/image/whyyoutouzhele/2024/01/12/1745837794352648312_0.jpg","videos":"","hasPublished":true}]