[{"id":"1846228646086037785","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 00:36:25","content":"October 15, Kaifeng, Henan. Sima Nan said during a live broadcast at the Kaifeng Mansion scenic spot, \"Now we need thousands of Bao Zhengs. If Mr. Bao were here, he would cut the emperor to death with one blow. If the emperor breaks the law, he would be punished just like the common people. He would be executed on the spot.\" Then his live broadcast room was banned by the platform.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846228646086037785_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846252388216414446","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 02:10:45","content":"October 11, Taiyuan, Shanxi. The shops of Zhengda International Modern Plaza were left unfinished, and some people jumped off the building to defend their rights.\nOctober 12, Puyuan Town, Tongxiang City, Jiaxing, Zhejiang. Workers marched to demand their wages.\nOctober 14, Luoyang, Henan. The owners of Rongshengchengyuan protested against the unfinished project.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846252388216414446_0.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846252388216414446_1.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846252388216414446_2.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846252388216414446_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846285576317579407","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 04:22:38","content":"October 9, Shilou Town, Panyu District, Guangzhou, Guangdong. The underground garage of Asian Games City Tianfeng Community is not designed properly. The space of each parking space is very small. It is easy to scratch the chassis, roof, and tires when parking. There are only a few parking spaces available, and the owners have to find parking spaces outside the community every day. Under such circumstances, on October 9, the community property issued a notice that it would start to collect a mandatory parking fee of 400 yuan per month. This move caused dissatisfaction among the owners, and the owners gathered at the entrance of the community to protest.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846285576317579407_0.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846285576317579407_1.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846285576317579407_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846306164578910336","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 05:44:27","content":"On October 13, in Lujiang County, Hefei, Anhui, the owners of Zhongfa Century City Community held an owners' meeting because they were dissatisfied with the property management service. The property management was worried that they would be removed, so they sent people to disrupt the meeting on the grounds that they had not paid the property management fees, resulting in the meeting being unable to proceed.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846306164578910336_0.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846306164578910336_1.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846306164578910336_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846313347840360940","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 06:12:59","content":"On October 15 (published), the owners of Central Mansion in Huixian County, Henan Province, protested against multiple sales of one house and indefinite delays in delivery.\nOn October 15 (published), the owners of Panlong Huafu in Huangpi District, Wuhan, Hubei Province, protested against the unfinished project.\nOn October 14, Changsha, Hunan Province. Workers in the lobby of Jingtian Square demanded their wages, and the police directly threatened that protesting was illegal.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846313347840360940_0.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846313347840360940_1.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846313347840360940_2.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846313347840360940_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846326064282587307","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 07:03:31","content":"On October 15, Ren Zeping, a famous economist, and Dan Bin, a private equity tycoon, debated the Chinese stock market for several days, which eventually led to both of them being banned from the Internet. Dan Bin believes that after a sharp rise, there will be a sharp fall. Now that we are standing at a high position, we will not be able to get out of the trap for ten years. He also frankly said that if this rise stops and there is no sharp fall, my 32 years of experience in the industry will be in vain.","images":"/tweet/image/whyyoutouzhele/2024/10/16/1846326064282587307_0.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846326064282587307_1.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846326064282587307_2.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846326064282587307_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846332900926476562","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 07:30:41","content":"Details: More than 40 workers are demanding about HK$2 million in wages in front of the HKUST dormitory. They have been delayed in getting paid for two months. The Hong Kong Construction Industry Employees General Union posted on social media that dozens of subcontractors have been owed more than HK$2 million in wages by the general contractor, and the project payment exceeds HK$60 million. More than 60 people are involved, and about 40 of them are on site today. At the same time, the chairman of the General Union said that the world is not doing well, and many contractors have financial problems, and related incidents are expected to occur again.","images":"/tweet/image/whyyoutouzhele/2024/10/16/1846332900926476562_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846337600090480775","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 07:49:21","content":"On October 15, at about 12 noon local time, North Korea blew up part of the Gyeongui Line and the East Sea Line connecting the two Koreas, north of the military demarcation line. The General Staff of the Korean People's Army issued a statement on October 9, announcing that it would completely cut off the railways and roads connecting to South Korea from that day on, and carry out fortification and reinforcement of defense facilities. At present, the only road connecting the two Koreas is the Panmunjom Joint Security Area.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846337600090480775_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846339121876173307","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 07:55:24","content":"According to a netizen’s contribution, the admissions office of the Songshan Shaolin Temple Martial Arts School claims that it can not only help children quit internet addiction and change their rebelliousness, but also correct transgenderism.","images":"/tweet/image/whyyoutouzhele/2024/10/16/1846339121876173307_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846341159473311969","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 08:03:30","content":"On October 15, a first-grade girl from Jingsheng Primary School in Lingshi County, Jinzhong, Shanxi Province cried and said she wanted to drop out of school because eight classmates bullied her. From the video, it can be seen that the little girl's mouth was full of blood. She said that the bullying classmates blocked her and prevented her from going to the teacher. In response to this matter, the staff of Lingshi County Public Security Bureau responded, \"There is such a case in Jingsheng Primary School, but we are still investigating the situation.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846341159473311969_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846352498803548404","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 08:48:33","content":"A new model for making money from education. Recently, some netizens discovered that many QR codes appeared in some textbooks, and they had to scan and pay to \"unlock new knowledge.\" A law textbook had 46 charging points inserted into it. If you wanted to understand the content of a charging point, you had to pay 3 yuan, a total of 138 yuan.","images":"/tweet/image/whyyoutouzhele/2024/10/16/1846352498803548404_0.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846352498803548404_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846354356225950177","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 08:55:56","content":"Follow-up to the 9-month wage arrears incident at Xinxiang Fourth People's Hospital:\nOn October 14, a reporter called the Xinxiang Municipal Health Commission, and the relevant staff said that the matter had been resolved and all the arrears had been paid. However, the reporter then called the hospital again, and when the reporter asked whether the wages had been paid, the other party said that the hospital was not accepting interviews for the time being.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846354356225950177_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846381298597933444","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 10:43:00","content":"\"Chinese Terror\"\nOn October 10, Changsha announced the completion of the country's first \"Marriage and Childbirth Culture Street\"","images":"/tweet/image/whyyoutouzhele/2024/10/16/1846381298597933444_0.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846381298597933444_1.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846381298597933444_2.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846381298597933444_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846468118899745165","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 16:27:59","content":"October 15, Guangzhou, Guangdong. The vendor was about to leave on his bike, but several urban management officers refused to let him go, causing the vendor to get furious. He pulled out a baton from his electric bike and chased after the urban management officers, shouting \"I won't live any longer.\" One of the urban management officers was so scared that he fled.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846468118899745165_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846473836033974705","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 16:50:42","content":"Recently, Zhang Zetian attended an alumni art exhibition. Because she wore an \"all-seeing eye\" accessory on her chest, some netizens questioned whether she had joined the organization \"Illuminati\". On October 16, JD.com issued a statement saying that Liu Qiangdong and Zhang Zetian were the subjects of organized rumors and smear campaigns, and that they had reported the case to the police, and the police are coordinating the investigation.","images":"/tweet/image/whyyoutouzhele/2024/10/16/1846473836033974705_0.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846473836033974705_1.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846473836033974705_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846473836033974705_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1846479596306461135","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 17:13:36","content":"On October 14, after China announced the holding of the \"Joint Sword-2024b\" military exercise, CCTV Agriculture released a program called \"Frog Farming to Prevent Escape and Disease\" that day, popularizing bullfrog farming techniques, which triggered a large number of netizens. Netizens replied, \"Is this the art of language?\" \"Remember? Red frogs are the cutest.\"","images":"/tweet/image/whyyoutouzhele/2024/10/16/1846479596306461135_0.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846479596306461135_1.jpg,/tweet/image/whyyoutouzhele/2024/10/16/1846479596306461135_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846479596306461135_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]