[{"id":"1846228646086037785","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 00:36:25","content":"October 15, Kaifeng, Henan. Sima Nan said during a live broadcast at the Kaifeng Mansion scenic spot, \"Now we need thousands of Bao Zhengs. If Mr. Bao were here, he would cut the emperor to death with one blow. If the emperor breaks the law, he would be punished just like the common people. He would be executed on the spot.\" Then his live broadcast room was banned by the platform.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846228646086037785_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846252388216414446","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 02:10:45","content":"October 11, Taiyuan, Shanxi. The shops of Zhengda International Modern Plaza were left unfinished, and some people jumped off the building to defend their rights.\nOctober 12, Puyuan Town, Tongxiang City, Jiaxing, Zhejiang. Workers marched to demand their wages.\nOctober 14, Luoyang, Henan. The owners of Rongshengchengyuan protested against the unfinished project.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846252388216414446_0.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846252388216414446_1.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846252388216414446_2.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846252388216414446_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846285576317579407","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-16 04:22:38","content":"October 9, Shilou Town, Panyu District, Guangzhou, Guangdong. The underground garage of Asian Games City Tianfeng Community is not designed properly. The space of each parking space is very small. It is easy to scratch the chassis, roof, and tires when parking. There are only a few parking spaces available, and the owners have to find parking spaces outside the community every day. Under such circumstances, on October 9, the community property issued a notice that it would start to collect a mandatory parking fee of 400 yuan per month. This move caused dissatisfaction among the owners, and the owners gathered at the entrance of the community to protest.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/16/1846285576317579407_0.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846285576317579407_1.jpg,/tweet/video/whyyoutouzhele/2024/10/16/1846285576317579407_2.jpg,","hasFullContentTranslated":true,"hasPublished":true}]