[
  {
    "id": "1732078866036904298",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 00:45:56",
    "content": "Shenzhen Xunmei Technology Plaza, Ruihao Decoration Company owes wages to migrant workers",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732078866036904298_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/7IaISoXfzI",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732080771073024237",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 00:53:30",
    "content": "@xiaozhangyor I'm dying of laughter",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732080932352324030",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 00:54:09",
    "content": "Netizens commented on the Mayday lip-syncing incident:",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732080932352324030_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/nzKSPLllzN",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732114769073598489",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 03:08:36",
    "content": "Since December 3, residents of Taopu Town, Putuo District, Shanghai have been protesting against the construction of a new garbage treatment plant near the community outside the Putuo District Government.\nIt is reported that Putuo District has built an 800-ton wet garbage treatment plant 100 meters away from the Taopu Town residential area without approval. In the future, there will be about 400 garbage trucks going back and forth to the community gate every day. The incineration outlet faces the residential area directly, which will affect the health of more than 20,000 residents in the surrounding area;",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732114769073598489_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/hzBokUDs4t",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732185986711638066",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 07:51:36",
    "content": "In a university in Chenzhou, Hunan, the counselor asked students to participate in various social surveys at will. Today, the counselor asked students to falsify the \"National Civilized City\" survey for Chenzhou in the Agricultural Bank of China APP.\nSome students questioned why such things happened every day. The counselor threatened the graduation certificate and said, \"Before you get the graduation certificate, everyone must cooperate with the school's work.\"",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732185986711638066_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/wM9Um66bUK",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732191531803750852",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 08:13:38",
    "content": "On December 5, after China lifted most of its sanctions on Lithuania, Lithuania responded by listing China as a country posing a threat to national security.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732191531803750852_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/MmnMGdZTw3",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732356761665839259",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 19:10:12",
    "content": "Recently, a well-known blogger in Northeast China named \"Gray Pigeon\" released a series of videos exposing the various high-priced scams in Heilongjiang Snow Village, sparking discussions among netizens.\nOn December 6, the Harbin police issued an announcement stating that the offender Zhang Moubin (net name \"Gray Pigeon\") pretended to be a tourist from another province, took the initiative to create trouble, maliciously edited and quoted out of context, and was suspected of smearing the image of Heilongjiang Province's tourism. He has been administratively detained by the public security organs in accordance with the law.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732356761665839259_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/lx6XIVkD4I",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732357698929238250",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 19:13:55",
    "content": "On December 5, a netizen living in Shenzhen posted his own water and electricity bill. It can be seen that under the basic water and electricity fee column, there are two more items: \"public power equipment maintenance and room electrical appliance loss fee\" and \"tertiary pressure water pump maintenance fee and loss fee, etc.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732357698929238250_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/lwAojwBHdv",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732357937685815369",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 19:14:52",
    "content": "December 5, Beijing. A woman posted a video saying that her land was seized by the local government, and that security guards forcibly dragged her out of the land, surrounded her hand in hand, and restricted her personal freedom.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732357937685815369_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/BvoGb8VSfS",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732358366117142865",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 19:16:34",
    "content": "Netizen contribution\nOn December 6, at the forced demolition site in Dayu Village, Zhoukou City, urban management officers forcibly dragged the owners out of the houses one by one and demolished the houses in front of them.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732358366117142865_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/UQ9WnUAqy6",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732364008022258076",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 19:38:59",
    "content": "Netizen contribution\nOn the evening of December 5, a reporter interviewed a villager from Xiaoliu Village, Diaowo Town, Zhuozhou City.\nThe villager faced the camera with a happy smile on her face. She told the reporter: At my age, I can still earn about 300 yuan a day.\"\nThis caused netizens to complain",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732364008022258076_0.jpg,/tweet/image/whyyoutouzhele/2023/12/06/1732364008022258076_1.jpg,/tweet/image/whyyoutouzhele/2023/12/06/1732364008022258076_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/SHARozU6Pk",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732364281713144078",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 19:40:05",
    "content": "Netizen contribution\nDecember 5, Nanping, Fujian. Travel bloggers \"Ling Xiao and his wife\" were traveling by car through Nanping when they saw an old man picking up scraps on the roadside pushing a worn-out bicycle, so they approached and asked.\nThe old man said that he was 75 years old today and came from Anhui. He lived a wandering life by picking up scraps and usually lived at a roadside station. Because his son owed millions of debts outside and could not bear the responsibility of supporting the elderly, he drove the old man out.\nIn the end, the blogger stuffed 300 yuan into the old man and asked him to stay in the city at night to repair the car. The blogger's mother also gave the only 100 yuan she had to the old man, and the old man immediately knelt down and kowtowed to express his gratitude.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732364281713144078_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732365232352251961",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 19:43:51",
    "content": "Netizen contribution\nOn December 4, a man in Guangdong had just joined a freight company and had already had two accidents and scratched other people's vehicles. Worried about being fired by the company, the man sat on the ground helplessly and sobbed.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732365232352251961_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/CcgK9Ar6JQ",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732368378126328209",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 19:56:21",
    "content": "Netizen contribution\nDecember 5, Qitaihe City, Heilongjiang Province.\nA netizen took a photo of the desolate scene along the street. There was no one on the road and all the shops along the street were closed.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732368378126328209_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/9qE8R9SliG",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732369890474905855",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 20:02:22",
    "content": "Netizen contribution\nDecember 6, Xi'an, Shaanxi. Ma Yuemei, 66, from Henan, and her husband Xue Xifa worked as sanitation workers in Xi'an from 2007 to 2019, responsible for road sweeping and garbage transfer. They were dismissed in 2019 and did not receive any compensation.\nIn the 13 years that the couple worked as sanitation workers, regardless of wind, rain, cold or hot weather, they went out early and returned late every day, had no holidays throughout the year, no overtime pay or social security, and were often deducted from their wages. Because they did not pay social security, the two elderly people now have no source of income and their lives are difficult.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732369890474905855_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732371034567852065",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 20:06:55",
    "content": "Netizen contribution\nDecember 5, Mianyang City, Sichuan Province. It was reported online that an old man’s 300,000 yuan deposit was used by the bank to invest in financial products, and he could not withdraw a single cent. The old man sat on the ground and cried bitterly.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732371034567852065_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/JxctGk5hgf",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732373292449669497",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 20:15:53",
    "content": "On December 6, in Zhumadian, Henan, the relocated residents protested their rights at the property development and demanded “return my resettlement housing and resettlement fees”",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732373292449669497_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/X4c6M6MUbr",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732375563879215413",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 20:24:55",
    "content": "Netizen contribution\nOn the evening of December 5, Beicheng Bridge in Nantong, Jiangsu. A delivery boy jumped off the bridge due to emotional reasons, leaving behind an electric bike, two bottles of beer and a bag of snacks. Later, another delivery boy arrived and rescued him.\nOn December 5, Limin Bridge in Yangzhou, Jiangsu. A man jumped into the river and was then carried to the hospital in an ambulance for emergency treatment",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/06/1732375563879215413_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/pHNiQtSC3L",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732381340295692738",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 20:47:52",
    "content": "On December 6, the media published a long article to restore the Shanghai \"Blood Trough Sister\" incident. The article said that the \"little aunt\" was 60 years old this year and was a worker in a handicraft joint factory before retirement; after the incident, the \"little aunt\" contacted her daughter-in-law, who then asked for help from the unit leader. During this period, many enthusiastic people relayed the information and finally contacted the Shanghai Municipal People's Government Office in Tibet.\n\"Blood Trough Sister\" Ms. Yu is 27 years old this year and currently works as a lobby assistant in a bank branch in Shanghai. Yu's father used to be engaged in freight and has more than 30 years of driving experience. He is now a shuttle bus driver for a company in Fengxian, Shanghai. Yu's mother works in a company and is engaged in financial work. Ms. Yu's husband, Mr. Tao, is from Henan, 29 years old, and is currently a skateboard coach.\nThe Shanghai Municipal Health Commission stated that no Shanghai Municipal Health Commission staff knew the patient and his family or received their requests.\nThe Shanghai Municipal Government Office in Tibet stated that there was no action caused by improper factors such as personal relationships in this matter.\nMr. Tao and the local hospital said that the blood donation was not organized by the government, and the donors came to donate blood voluntarily with the help of the hospital and their families.\nThe charter flight was funded by the money borrowed by Yu's mother from the company's leaders.\nMr. Tao said that the WeChat chat records exaggerated the facts and were intended to encourage his wife. After the online public opinion broke out, his aunt criticized him more than once.\nMs. Yu said, \"Seeing all kinds of comments and speculations on the Internet, I feel that many innocent people have been implicated. I couldn't help crying these two days and felt sorry for those who sincerely helped me.\"\nNetizens generally expressed disbelief in the above content in the comment area.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732381340295692738_1.jpg,/tweet/image/whyyoutouzhele/2023/12/06/1732381340295692738_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732397416333058432",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 21:51:45",
    "content": "https://t.co/JPXwscrHZa",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732397416333058432_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/JPXwscrHZa",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732401201377865742",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 22:06:47",
    "content": "On December 3, the Italian government formally submitted a note to the Chinese government to withdraw from the Belt and Road Initiative.",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732408763695403385",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 22:36:50",
    "content": "On December 6, CCTV announced the Spring Festival Gala mascot \"Long Chenchen\". It said that the design inspiration of this mascot is a collection of \"dragon\" elements from five museums in China. However, netizens discovered that it was actually AI drawing, because AI cannot draw \"fingers\", and the number of toes on each foot of \"Long Chenchen\" is different, and the perspective is wrong, which cannot be a low-level mistake made by a human painter.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732408763695403385_0.jpg,/tweet/image/whyyoutouzhele/2023/12/06/1732408763695403385_1.jpg,/tweet/image/whyyoutouzhele/2023/12/06/1732408763695403385_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/QALjiFelC4",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732425119392473599",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 23:41:50",
    "content": "Some netizens added",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732425119392473599_0.jpg,/tweet/image/whyyoutouzhele/2023/12/06/1732425119392473599_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/FZMJ3S0Rt2",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1732425856885411904",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-06 23:44:45",
    "content": "When you bought the robot to swipe your screen, did you ever think that the robot would also talk nonsense?",
    "images": "/tweet/image/whyyoutouzhele/2023/12/06/1732425856885411904_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/3O1zGaR7Ua",
    "accountId": "whyyoutouzhele"
  }
]