[{"id":"1858906452758286582","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-20 00:13:29","content":"Summary of Xianzhong incidents we collected in the past year:\n\nDecember 26, Kaifeng, Henan. After a man and a woman quarreled in the car, the man beat the woman in the street, then hit the woman with his car, and even tried to hit passers-by indiscriminately at the intersection.\n\nFebruary 9, Ju County, Shandong. A man sneaked into the village during the New Year and killed many people randomly, and hid in the house to lure and kill the medical staff who came.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1858919532804321356","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-20 01:05:28","content":"The perspective of being carried onto a stretcher after being shot.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/20/1858919532804321356_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1859025430885634434","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-20 08:06:16","content":"On November 19, Huaiyin Normal University issued a notice to confiscate fruit knives, scissors, machetes, and watermelon knives in dormitories.","images":"/tweet/image/whyyoutouzhele/2024/11/20/1859025430885634434_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1859076400226943317","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-20 11:28:48","content":"Copy each paragraph in the search bar to directly view the corresponding tweets","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1859216704548565107","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-20 20:46:19","content":"On November 20, Calcium Orchard in Mengjia Town, Faku County, Shenyang City, Liaoning Province reported to the director of the Mengjia Town Police Station that he had engaged in acts of partiality, perverting the law, covering up inaction, etc.\nThe informant said that after many thefts occurred in the park in recent years, the operators placed GPS locators in important equipment. When the generator was stolen, the owner of the agricultural park and the local police went to the GPS location office to find the stolen equipment and Persons involved.\nPolice officers from the Mengjia Police Station who handled the case found some items in the suspect's home. Director Huang Jia released the suspect within 24 hours of the incident. Half of the items were determined to belong to the suspect. The reason is that the theft is not admitted and other stolen items will not be disposed of. The lost items worth more than 20,000 yuan were valued at 3,000 yuan as scrap metal. The new motor for the generator was valued at only 100 yuan and was given to the suspect. The GPS inside the motor was also identified as belonging to the suspect. After multiple complaints, the suspect was only criticized and the court refused to establish...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/20/1859216704548565107_0.jpg,","hasFullContentTranslated":false,"fullContent":"11月20日，辽宁省沈阳市法库县孟家镇的钙果园实名举报孟家镇派出所所长存在徇私枉法包庇不作为等行为\n举报人称，在近年园区发生了多起盗窃事件后，运营人员在重要设备内放入GPS定位器，当发电机被盗后，农业园主与当地民警一同前往GPS定位处找到了被盗设备以及涉案人员。\n孟家派出所办案民警在嫌疑人家中翻找到了部分物品，所长黄佳于事发24小时内放走了嫌疑人，其中一半物品判定为嫌疑人所有。理由是不承认偷窃，其他遭盗物品不予以处理。2万多元的丢失物品被当作废铁价格估值3000元，发电机的新电机仅作价100元并认定给嫌疑人。电机内的GPS也被认定为嫌疑人的所有物品。经多方投诉后，仅对嫌疑人通报批评，法院不予立案，钙果园没有任何赔偿。嫌疑人依旧没有任何处理结果，据了解嫌疑人的亲弟弟在镇政府工作。","hasPublished":false},{"id":"1859217408507908372","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-20 20:49:07","content":"On November 20, the 2024 World Internet Conference was held in Wuzhen.","images":"/tweet/image/whyyoutouzhele/2024/11/20/1859217408507908372_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1859219843989340397","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-20 20:58:48","content":"Be careful\nOn November 20, a car repeatedly ran over a pedestrian in Dawangdian, Baoding, Hebei.\nThe video shows that an SUV repeatedly ran over the person who fell to the ground. The person who filmed it exclaimed \"It's crazy, it ran over five times.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/20/1859219843989340397_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1859222153960255584","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-20 21:07:58","content":"On November 20, the people who were evicted from their homes in Yancheng went to the municipal government to defend their rights, demanding that the government reveal why they could not move back and where the state funding had gone.","images":"/tweet/image/whyyoutouzhele/2024/11/20/1859222153960255584_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/20/1859222153960255584_0.jpg,/tweet/video/whyyoutouzhele/2024/11/20/1859222153960255584_1.jpg,/tweet/video/whyyoutouzhele/2024/11/20/1859222153960255584_2.jpg,","hasFullContentTranslated":true,"hasPublished":false}]