[{"id":"1798396110974689684","name":"李老师不是你老师","createdDate":"2024-06-06 00:47:00","content":"June 4, Hong Kong. A man turned on his mobile phone flashlight and appeared near Victoria Park with a Winnie the Pooh doll hanging from his neck.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/06/1798396110974689684_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798685852572533227","name":"李老师不是你老师","createdDate":"2024-06-06 19:58:19","content":"As the 35th anniversary of June 4th approaches, we collaborate with Human Rights in China @hrichina and Humanitarian China @HChina89 to release a series of June 4th special photos from the scene of the 1989 Democracy Movement on the 24th (June 6)\n[Martial law soldiers ambush and kill 3 passers-by] [Shanghai train hits protesters, killing 6 and injuring 6]\nOn the third day after martial law troops imposed martial control on Beijing, citizens still did not stop resisting. At 3:30 a.m. that day, a group of citizens blocked the intersection with eight buses on the north side of Heping Street, and martial law troops opened fire to drive them away. At 8:30 a.m., a young man was shot to death by martial law soldiers for protesting at the northwest corner of Xidan intersection on West Chang'an Street. At that time, the body was lying on the roadside, with blood on the head and eyes wide open. At about 11 o'clock in the evening, when a total of 7 people, 5 men and 2 women, were riding bicycles through the intersection of Nanlishi Road, the martial law troops ambushing on both sides shouted, \"Don't move, raise your hands.\" They stopped immediately, but were stopped by the martial law troops. Shoot within 4 or 5 meters, causing...","images":"/tweet/image/whyyoutouzhele/2024/06/06/1798685852572533227_0.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798685852572533227_1.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798685852572533227_2.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798685852572533227_3.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"临近六四35周年，与中國人權@hrichina、人道中國@HChina89合作发布一系列六四专题图片八九民运现场之二十四（6月6日）\n【戒严军人伏击枪杀3路人】【上海火车撞抗议者6死6伤】\n戒严部队对北京实行军管第三天，市民仍没有停止反抗。当天凌晨3点半，一群市民在和平街北用八辆公共汽车堵住路口，戒严部队开枪驱赶。上午8点半，在西长安街西单路口西北角，一名年轻人因为抗议，被戒严军人开枪打死。当时遗体就躺在路边，头部都是血，瞪着双眼死不瞑目。晚上约11点，5男2女共7人结伴骑自行车经过南礼士路十字路口时，被埋伏在两边的戒严部队喊“不许动，举起手来”，他们立即停车，却遭戒严军人在4、5米内开枪，造成其中3个人当场死亡，2人重伤，后来残废。\n当天，在全国各地民众掀起了抗议北京当局对学运武力镇压的浪潮。西安、重庆、南京、兰州、武汉均发生学生、民众大规模示威抗议事件。尤其是在四川成都市，抗议的民众情绪十分激烈，官方最后调来武警部队镇压。东北工业重城长春，暴发了以工人为主的多达超过10万人的游行抗议。\n而在上海，由于工人大罢工，令全市几乎陷入瘫痪。当晚上海数万市民在火车站附近设置障碍，一列火车刹车不及，酿成6死6伤的惨剧。愤怒的市民烧毁了八节车厢，并造成沪宁、沪杭铁路中断。\n全球华人，同声一哭。香港、华盛顿、纽约、波士顿、芝加哥、洛杉机、加拿大、日本、马来西亚、比利时、法国、意大利、瑞典、波兰、西班牙、秘鲁等地华人、留学生举行示威游行及募款活动，抗议北京当局对学运的武力镇压。\n当天下午，中国国务院发言人袁木在记者会上面对镜头撒下坚称军人加市民学生总共才300人死亡，北京的大学生死亡23人。而目前所知，六四当天的死亡人数就达3000人左右。\n\n图片说明：\n1，北京城被军管第三天，戒严部队面对市民，仍然如临大敌。2，六四当天被烧毁的车辆仍在街头。3，上海一辆火车撞倒设置的路障，酿成6死6伤的惨剧，该火车有8节车厢遭愤怒的市民焚毁。4，北京政府对自己的人民大开杀戒，各国纷纷安排专机撤侨。图为机场内撤侨时的情况。","hasPublished":true},{"id":"1798687441739792704","name":"李老师不是你老师","createdDate":"2024-06-06 20:04:38","content":"June 5, Hangzhou, Zhejiang. Owners of the Hangyucheng community made legal demands to the Transportation Control Group, demanding that the building be resumed and restored to its original quality. During the period, there were no banners or parades, but some owners were arrested by the police.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/06/1798687441739792704_0.jpg,/tweet/video/whyyoutouzhele/2024/06/06/1798687441739792704_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798691900893110426","name":"李老师不是你老师","createdDate":"2024-06-06 20:22:21","content":"For more information click:\n","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798692227016987115","name":"李老师不是你老师","createdDate":"2024-06-06 20:23:39","content":"https://t.co/9tpYqualrK","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/06/1798692227016987115_0.jpg,","hasPublished":true},{"id":"1798692485142811004","name":"李老师不是你老师","createdDate":"2024-06-06 20:24:41","content":"https://t.co/HZSwRcCIDL","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/06/1798692485142811004_0.jpg,","hasPublished":true},{"id":"1798694376723612108","name":"李老师不是你老师","createdDate":"2024-06-06 20:32:12","content":"On June 6, Guizhou Province reported the follow-up of the incident in which a female entrepreneur asked for project funds. The parties involved, Ma Moumouyi, lawyer Hou Moutao and five others were found guilty of infringing citizens' personal information, but their crimes were minor. After being arrested, they all pleaded guilty and repented, and no criminal punishment was imposed. According to the law, the five people were decided to be relatively non-prosecuted. In December last year, the lawyer Hou Zhitao publicly released a video to seek help from the whole society, saying that he and his lawyer team were persecuted by the local government.","images":"/tweet/image/whyyoutouzhele/2024/06/06/1798694376723612108_0.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798694376723612108_1.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798694376723612108_2.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798694376723612108_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798697470769393885","name":"李老师不是你老师","createdDate":"2024-06-06 20:44:29","content":"\"Chinese people need to be managed\"\nOn June 5, a notice board for bathroom managers circulated online, sparking heated discussions. The picture showed that one cleaner was equipped with five \"managers\".","images":"/tweet/image/whyyoutouzhele/2024/06/06/1798697470769393885_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798698469810704810","name":"李老师不是你老师","createdDate":"2024-06-06 20:48:28","content":"On June 5, at the gate of Changchun City Petition Bureau, victims of the collapse of P2P platform Changchun Guanqun Chicheng defended their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/06/1798698469810704810_0.jpg,/tweet/video/whyyoutouzhele/2024/06/06/1798698469810704810_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798711424430358718","name":"李老师不是你老师","createdDate":"2024-06-06 21:39:56","content":"On June 6, Zhang Xiaoming, former deputy secretary-general of the National Committee of the Chinese People's Political Consultative Conference, resigned from his position as a member of the National Committee of the Chinese People's Political Consultative Conference. Zhang was the director of the Liaison Office of the Central People's Government in the Hong Kong Special Administrative Region and the director of the Hong Kong and Macau Affairs Office. During this period, two major social movements, Occupy Central and Anti-Extradition Bill, broke out in Hong Kong. In 2020, he was replaced by an airborne official and was transferred out of Hong Kong in 2022.\nIn 2014, Zhang Xiaoming, then director of the Liaison Office of the Central People's Government in the Hong Kong Special Administrative Region, said when meeting with Hong Kong pan-democratic lawmakers: \"Your survival has shown the tolerance of the central government.\"\nBut later he issued a statement saying that this was a malicious quoting out of context.","images":"/tweet/image/whyyoutouzhele/2024/06/06/1798711424430358718_0.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798711424430358718_1.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798711424430358718_2.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798711424430358718_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798718026285760603","name":"李老师不是你老师","createdDate":"2024-06-06 22:06:10","content":"Suicide note in the square\nXiao Jie, a student of the Journalism Department of Renmin University of China, was shot dead by martial law troops for taking photos at the south entrance of Nanchizi, Chang'an Avenue on the afternoon of June 5, 1989\nXiao Jie wrote a suicide note to his parents in Tiananmen Square, saying: \"I can never watch my country and my nation go further and further on the wrong path, sinking deeper and deeper into darkness and injustice... Even if my power is too small... I am always a force for justice\nvia @CHRDnet Human Rights Defender","images":"/tweet/image/whyyoutouzhele/2024/06/06/1798718026285760603_0.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798718026285760603_1.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798718026285760603_2.jpg,/tweet/image/whyyoutouzhele/2024/06/06/1798718026285760603_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798729307134754819","name":"李老师不是你老师","createdDate":"2024-06-06 22:51:00","content":"Recently, a song called \"Workers' Dance\" by Kaolang Brothers has become popular on the Internet. The song tells the difficulties of today's workers and resonates with netizens.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/06/1798729307134754819_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798731317322133642","name":"李老师不是你老师","createdDate":"2024-06-06 22:58:59","content":"On June 6, Shanghai Jiao Tong University's Docker Hub image accelerator was announced to be removed due to regulatory requirements.\nDocker Hub is currently the largest container image community, but due to the restrictions of the Great Firewall of China, it is inconvenient for programmers to obtain container images from Docker Hub. Docker Hub Image Accelerator can help developers download Docker images faster.","images":"/tweet/image/whyyoutouzhele/2024/06/06/1798731317322133642_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798735347129737631","name":"李老师不是你老师","createdDate":"2024-06-06 23:15:00","content":"Netizens lamented","images":"/tweet/image/whyyoutouzhele/2024/06/06/1798735347129737631_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1798744770107580602","name":"李老师不是你老师","createdDate":"2024-06-06 23:52:26","content":"Bloomberg: The combined market value of Nvidia, Microsoft and Apple has exceeded the total market value of the Chinese stock market.","images":"/tweet/image/whyyoutouzhele/2024/06/06/1798744770107580602_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]