[{"id":"1854558576460603876","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 00:16:35","content":"On November 3, in Ganzhou, Jiangxi, shop owners of Ouyada protested against the developer for not paying rent. One owner said, \"We bought the shop, rented it out, and they are unwilling to pay rent or return the shop to us. How is this different from robbery?\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854558576460603876_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854558576460603876_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854571402709397525","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 01:07:33","content":"On November 2, owners of MixC in Heze, Shandong Province gathered to protest that the developer had not made any water and electricity changes in the ten years since they moved in, and still used the power supply transferred by the property management company. The property management company collected electricity bills every month, with huge errors and frequent power outages. In addition, the property management company also tied the property management fees to the electricity bills, and often cut off the owners' water and electricity to achieve the purpose of forcibly collecting property management fees. The owners' desire to hire a new property management company was also obstructed at every level. The owners have been reporting the situation to the relevant departments for five years, but have always been perfunctory. It is reported that Tianhua Mansion and Four Seasons Flower City in the same city also have the same problem.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854571402709397525_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854571402709397525_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854574769967878337","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 01:20:56","content":"October 31, Xingtai, Hebei. The owners of Poly Time Impression Phase II protested against the developer's installation of air energy. It is understood that the contract signed between the developer and the owner stipulated that central heating should be provided, but when the house was delivered, it was privately changed to air energy heating. The green space on the south side of the community was occupied, the lighting of users on the lower floors was affected, and the noise generated by the air energy also seriously affected the lives of the residents.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854574769967878337_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854574769967878337_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854612861231726888","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 03:52:17","content":"Recently, in Zhongmou County, Zhengzhou, Henan, the owners of Xinyuan Yuefu set up a shed downstairs of the unfinished building to cook in protest of the unfinished project.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854612861231726888_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]