[{"id":"1854558576460603876","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 00:16:35","content":"On November 3, in Ganzhou, Jiangxi, shop owners of Ouyada protested against the developer for not paying rent. One owner said, \"We bought the shop, rented it out, and they are unwilling to pay rent or return the shop to us. How is this different from robbery?\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854558576460603876_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854558576460603876_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854571402709397525","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 01:07:33","content":"On November 2, owners of MixC in Heze, Shandong Province gathered to protest that the developer had not made any water and electricity changes in the ten years since they moved in, and still used the power supply transferred by the property management company. The property management company collected electricity bills every month, with huge errors and frequent power outages. In addition, the property management company also tied the property management fees to the electricity bills, and often cut off the owners' water and electricity to achieve the purpose of forcibly collecting property management fees. The owners' desire to hire a new property management company was also obstructed at every level. The owners have been reporting the situation to the relevant departments for five years, but have always been perfunctory. It is reported that Tianhua Mansion and Four Seasons Flower City in the same city also have the same problem.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854571402709397525_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854571402709397525_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854574769967878337","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 01:20:56","content":"October 31, Xingtai, Hebei. The owners of Poly Time Impression Phase II protested against the developer's installation of air energy. It is understood that the contract signed between the developer and the owner stipulated that central heating should be provided, but when the house was delivered, it was privately changed to air energy heating. The green space on the south side of the community was occupied, the lighting of users on the lower floors was affected, and the noise generated by the air energy also seriously affected the lives of the residents.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854574769967878337_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854574769967878337_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854612861231726888","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 03:52:17","content":"Recently, in Zhongmou County, Zhengzhou, Henan, the owners of Xinyuan Yuefu set up a shed downstairs of the unfinished building to cook in protest of the unfinished project.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854612861231726888_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854641682580394249","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 05:46:49","content":"October 28, Zhengzhou, Henan. Homeowners of Xingliancheng Tianjieyuan Community protested against the suspension of construction.\nOctober 31, Loudi, Hunan. Homeowners of Xinhua Country Garden Tianxiwan Community marched with banners to protest against the unfinished project.\nNovember 2, Dalian, Liaoning. Homeowners of Country Garden Wanghai Center protested against the delayed delivery of houses.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854641682580394249_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854641682580394249_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854641682580394249_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854641682580394249_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854645961370239124","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 06:03:49","content":"October 28, Yantai, Shandong. The owners of Tiantai Xuefu No. 1 went to the Yantai Municipal Bureau of Letters and Calls to ask the government to make a decision. It is understood that the building was on the verge of unfinished construction. After the forced delivery, the owners found that the water, electricity, gas, network, and basement did not meet the usage standards.\nNovember 2, Anqing, Anhui. The owners of Fengda Yikangfu protested against the developer's false propaganda, replacing the stone slabs with asphalt, and betraying the original promise of separating people and vehicles, and demanded to return the house.\nNovember 1, Deyang, Sichuan. The owners of Beixin International Tianfu Market protested that the shops were turned into warehouses and were deceived by the developer. According to the video, most of the owners are elderly people aged 50 to 80 who do not have social security.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854645961370239124_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854645961370239124_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854645961370239124_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854649684561698890","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 06:18:37","content":"October 31, Xi'an, Shaanxi. Owners of Lintong Sunac Taoyuan Mansion protested against unfinished projects and demanded to see the mayor.\nOctober 31, Xi'an, Shaanxi. Villagers of Dongsanyaobao went to the municipal government to defend their rights and protested against the change of the location of their resettlement housing, and were violently driven away by the police.\nNovember 4, Sanmenxia, Henan. Owners of Shengtang Jiangshanyue Community protested against unfinished projects.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854649684561698890_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854649684561698890_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854649684561698890_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854649684561698890_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854656209736835408","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 06:44:32","content":"November 4, Xi'an, Shaanxi. Owners of the Eurasia Scenery No. 3 LOFT community protested against the property's excessive heating charges.\nNovember 4, Yulin, Guangxi. Owners of the Yongli Impression community hung banners to protest the unfinished project and asked the government to take charge.\nNovember 4, Guangzhou, Guangdong. Owners of the Xicheng Duhui community protested against the property's random charges and demanded the establishment of an owner's committee.\nNovember 5, Luohe, Henan. Owners of the Changjian Guanjing community protested against the delayed delivery of houses.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854656209736835408_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854656209736835408_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854656209736835408_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854656209736835408_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854659389707194790","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 06:57:11","content":"November 3, Yulin, Shaanxi. Villagers from Xiaodungou Village, Jiejiabao Township, Shenmu County, reported Yaoqu Coal Mine for improper mining in real name.\nOctober 28, Zhangjiakou, Hebei. Villagers from Xuejiaying Village, Chuchangdi Township protested against the occupation of farmland for the construction of a photovoltaic power plant. It is understood that the village committee arbitrarily contracted the villagers' farmland to a company for the installation of photovoltaic power generation at a price of 100 yuan per mu for 26 years. The villagers collectively opposed it, and the construction unit also threatened them to force the installation.\nOctober 16, Tianmen, Hubei. Villagers from Jiangqiao Village, Wangchang Town, opposed the installation of wind turbines and were beaten during the process.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854659389707194790_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854659389707194790_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854659389707194790_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854659389707194790_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854662987853787360","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 07:11:28","content":"November 5, Zhengzhou, Henan. The owners of the third phase of Sunac Yuhu Chenyuan petitioned to protest the unfinished project.\nNovember 5, Guangzhou, Guangdong. The old owners of a community blocked the door of the marketing center to prevent others from buying houses because they were dissatisfied with the developer's price reduction.\nNovember 5, Heze, Shandong. Due to the random price increase of the property, the owners of Xinhe Jiayuan Community in Dingtao District demanded to change the property.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854662987853787360_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854662987853787360_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854662987853787360_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854662987853787360_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854666245012144176","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 07:24:25","content":"On November 5, in Nanchang, Jiangxi, the owners of Shanggao Central Community, developed by Jianglv Group, protested that they had not received their property certificates. According to the video, the reason for not being able to obtain the property certificates was that Jianglv Group had sold more houses than the quota allowed.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854666245012144176_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854666245012144176_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854666245012144176_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854666245012144176_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854711941056299105","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 10:26:00","content":"November 6, Zhengzhou, Henan. Owners of a Sunac project protested against the unfinished project.\nNovember 5, Yichun, Jiangxi. Teachers from Wanzai County went to the county government to petition for their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854711941056299105_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854711941056299105_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854805266191335829","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 16:36:50","content":"November 7 (Released) A little boy pointed at a foreigner and said angrily: I will beat you to death.\nForeigner: Why?\nLittle boy: Because foreigners cannot invade China.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854805266191335829_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854810716278342122","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 16:58:30","content":"On November 7, Shandong. Netizens posted a ticket for having more than one child in 1984, which showed a fine of 1,500 yuan. If the fine is not paid within the time limit, a fine and confiscation of property will be imposed.\nIn response to this, many netizens recalled in the comment area that they were also left in this world after their family members paid the fine, and were \"bought\" at a high price.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854810716278342122_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854810716278342122_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854810716278342122_2.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854810716278342122_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854814068735197577","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 17:11:49","content":"On November 3, Linyi, Shandong. Netizens posted a copy of the \"Family Planning Reward Reporting Instructions\" from the 1990s. Residents who report excessive births to the local authorities and attach a \"reporting password\" can receive a cash reward. The local authorities will then announce the winners' \"reporting passwords\" to protect the reporters.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854814068735197577_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854814068735197577_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854814068735197577_2.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854814068735197577_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854817123815899606","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 17:23:57","content":"November 8, Shanghai. A veteran, who is also a private company owner, reported the police officer and his wife of Shanghai Chengjiaqiao Police Station under their real names, demanding protection money from him and illegally misappropriating 3.2 million yuan from him.\nThe man said that his family is now broken up and he called on the Party and the country to handle veterans' issues fairly and impartially and give veterans justice.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854817123815899606_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854819643288146361","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 17:33:58","content":"On November 7, local time, Biden gave a speech after Harris lost the election.\nHe said he congratulated Donald Trump on his victory yesterday and promised that the Biden administration would do its best to transfer power peacefully.\n\"We accept the choice made by the country. You can't love your country only when you win, and you can't love your neighbor only when he agrees with you.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854819643288146361_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854825761989157307","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 17:58:17","content":"On January 24 this year, a particularly serious fire broke out in Xinyu, Jiangxi, killing 39 people in just 3 minutes. The economic loss was as high as 43.5284 million yuan. On November 8, CCTV disclosed the investigation of the Xinyu fire accident: the cold storage on the underground floor of Jialeyuan Community violated regulations, generating static electricity that ignited flammable gases. A large amount of thick smoke rolled out from the exit on the underground floor. The toxic gas was more than 5 times the normal lethal dose, and it only took a few breaths to lose the ability to move.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854825761989157307_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854826072015065328","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 17:59:31","content":"On November 8, the 12th session of the Standing Committee of the 14th National People's Congress reviewed and approved the most powerful debt reduction measure in recent years: increasing the local government debt limit by 6 trillion yuan.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854826072015065328_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854829134624833998","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 18:11:41","content":"On November 7, local time, Putin stated in public that Russia is willing to create conditions for a long-term solution to the Russia-Ukraine conflict so that Ukraine will eventually become an independent and sovereign state.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854829134624833998_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854836441848988141","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 18:40:43","content":"On November 6, Henan. When a girl was using her vivox100s mobile phone, the phone suddenly exploded and smoked. She contacted customer service but failed.\nCurrently, the original video has been deleted from the entire network, and the girl’s account has also been banned by the platform.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854836441848988141_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854836441848988141_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854836441848988141_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854840927631949955","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 18:58:33","content":"November 8, Shenyang, Liaoning. A bus carrying students overturned and caught fire on the Sujiatun Expressway. The video showed that the bus was devoured by raging fire and burned until only its skeleton was left. There were students covered in blood who were helped off the bus.\n According to reports, the passengers on the bus were all students from Liaoning Normal School.\n Sujiatun Central Hospital: Currently, 6 injured people from the school have been admitted. The specific situation cannot be disclosed. The reporter called Liaoning Normal University several times, but no one answered. ","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854840927631949955_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854840927631949955_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854840927631949955_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854846175880323437","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 19:19:24","content":"November 7, Tengchong, Yunnan. Xinjizhou Hot Spring Hotel refused to accommodate Japanese customers. The day after the video was released, many netizens sent flowers and food to the hotel to show their support, and the hotel lobby was filled with gifts from supporters.\nA large number of netizens also said in the comment section of the hotel account that they would go to Tengchong for a trip now.\n","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854846175880323437_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854846175880323437_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854846175880323437_2.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854848148696416539","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 19:27:14","content":"On November 6, a book called \"The Beiyang Rebellion\" was suddenly notified to be removed from the shelves due to controversial content.\nAccording to the author in the book, the book had been deleted and revised many times.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854848148696416539_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854848148696416539_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854848148696416539_2.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854848148696416539_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854850477407744440","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 19:36:29","content":"In the early morning of November 8, in Changsha, Hunan, someone committed suicide by jumping off the Yinpenling Bridge, leaving behind glasses, cigarettes, wallets, and mobile phones, all neatly arranged.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854850477407744440_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854856373307052118","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 19:59:55","content":"On November 6, the Education Bureau of Minhang District in Shanghai issued a notice, ordering the school involved to conduct a thorough inspection, severely criticize the interns involved, and terminate their internship arrangements.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854856373307052118_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854857231118090280","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 20:03:20","content":"November 8th is the 25th Journalist's Day in China.\nNetizens responded, \"A society without press freedom will not have the truth,\" \"There are many major events in society, and in-depth investigative reporters are urgently needed, but now they can't be seen,\" \"Now you need to climb over the wall to read the news.\"","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854857231118090280_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854857231118090280_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854857231118090280_2.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854857231118090280_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854862263808934082","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 20:23:20","content":"November 3 (Release) A blogger posted a video saying: If having children is a social responsibility, please ask society to fulfill its obligation to raise children. If having children is an individual responsibility, please ask society to respect individual choices. Every sentence does not talk about salary, every line is about dedication, every thing does not talk about good deeds, everything is about realm.\nTo be selfish, if the individual's difficulties have nothing to do with the collective, then what does the collective's integration have to do with the individual?","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854862263808934082_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854865354712895494","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 20:35:36","content":"On November 6, Taiwanese historian Xu Zhuoyun wrote that China needs to establish a good legal system and human rights protection internally. In addition, China should not use force to suppress others, but use its own strength to help and support the weak, so as to gain everyone's support.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854865354712895494_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854867957975023918","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 20:45:57","content":"November 7, Beijing. Several people holding national flags asked for help at the Hunan Provincial Office in Beijing: I am in trouble in Beijing, now I am homeless and living on the streets, I have no food to eat, no winter clothes to wear, please ask the government for help.\nThis video of help has been deleted.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854867957975023918_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854873980790095981","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 21:09:53","content":"November 7, Liaoning. A farmer posted a video saying: If you don't do anything, step down! Don't always stay in that position and bully the people. Now many people not only don't have a good life, but their original lives have been almost ruined by the leaders. The man's remarks made netizens sweat.\nNetizens replied \"I was so scared that I jumped out of bed\"\n\"I miss you, brother, you actually rushed to the tower\"\n\"I admire the Warriors, I like you\"","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854873980790095981_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854873980790095981_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854873980790095981_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854873980790095981_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854877375215157685","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 21:23:22","content":"November 7, Liaoning. A farmer posted a video saying: If you don't do anything, step down! Don't always stay in that position and bully the people. He was talking about some village cadres. Now many people not only have no good life, but their original lives have been almost ruined by the leaders. The man's remarks made netizens sweat.\nNetizens replied \"I was so scared that I jumped out of bed\"\n\"I miss you, brother, you actually rushed to the tower\"\n\"I admire the Warriors, I like you\"","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854877375215157685_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854877375215157685_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854877375215157685_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854877375215157685_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854880613649858714","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 21:36:14","content":"November 7 (Published) \"Positive Energy Blogger Chao Ma\" compares the Chinese and Western electoral systems: Every Chinese adult has the right to vote and vote. Compared with Europe and the United States, the biggest advantage of our electoral system is that our votes are valid, while votes in Europe and the United States can be bought with money.\nIn addition, China's elections are carried out from level to level, and the villagers know the candidates in detail, while votes in Europe and the United States can be completely manipulated.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854880613649858714_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854880613649858714_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854880613649858714_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854880613649858714_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854885960963834135","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 21:57:29","content":"On November 8, the Douyin account of the internet celebrity \"Love in Late Autumn\", who became popular for commenting on the stock market, was blocked. He had announced that he would start his first live broadcast on November 9. On October 30, the Shanghai uncle \"Love in Late Autumn\" opened a personal Douyin account. As of the time of posting, he had nearly 500,000 followers. From the opening to the ban, the account survived for only 9 days.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854885960963834135_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854885960963834135_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854887405536358592","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 22:03:14","content":"According to Wu Zhongda's Chinese brothers in Ukraine, the operation to retrieve Wu Zhongda's body is ongoing and the brothers are taking him home.\nIt is reported that in another battlefield, another volunteer soldier is performing a mission and his life or death is unknown. We are waiting for confirmation.\nWish them a safe return.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854887405536358592_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854894476952830024","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 22:31:20","content":"On the evening of November 8, a man wearing a Mao suit was broadcasting live, and he seemed to be cosplaying Mao Zedong. A netizen in the comment area replied, \"How dare you! If you imitate the great man, you will be in trouble.\" Then the live broadcast was suddenly interrupted.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854894476952830024_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854894476952830024_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854894476952830024_2.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854894476952830024_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854902914835202485","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 23:04:51","content":"On November 7, an Air China employee revealed that he had worked for Air China for six years and signed a contract with Golden Phoenix, a wholly-owned subsidiary of Air China. However, he now discovered that the company had no labor dispatch qualifications at all. It is reported that all Air China employees have signed labor contracts with Golden Phoenix since 1998.\nAccording to Qichacha, Golden Phoenix's business scope does not include labor dispatch services, and it has only 34 employees and is involved in dozens of labor disputes.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854902914835202485_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854902914835202485_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854902914835202485_2.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854902914835202485_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854904743551717832","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 23:12:07","content":"As we all know, North Koreans cheer and burst into tears when they see Kim Jong-un. Recently, a wave of imitations has been set off on Chinese social platforms, and even people have spread the phenomenon. Whether it is college students, high school students, or even elementary school students, they have begun to imitate it. Netizens call it the \"Gratitude Dance\", and the background music in the video is also called \"General's March\". Some netizens said: \"Learn the Gratitude Dance now, it will definitely be useful in the future.\"","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854904743551717832_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854904743551717832_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854904743551717832_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854904743551717832_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854908592899735741","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 23:27:25","content":"November 8, Weihai, Shandong. A boy was reported sitting on the roof of a square throwing flyers into the air.\nThe flyers said that the boy was 17 years old and his mother was beaten and seriously injured. He reported the case to the police many times but to no avail. The police repeatedly shirked the responsibility of assessing the injuries and failed to provide effective legal aid.\nIt was reported online that the boy was detained by the police for seven days because of his mother's rights protection.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854908592899735741_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854908592899735741_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854916475988889995","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 23:58:45","content":"On the evening of November 8, at this moment, a large group of college students in Zhengzhou are riding bicycles towards Kaifeng.\nAt present, traffic congestion is serious on the East Fourth Ring Road in Zhengzhou. Part of the Zhengkai Avenue from Zhengzhou to Kaifeng is completely occupied by the \"cycling army\".\n","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854916475988889995_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854916475988889995_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854916475988889995_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854916475988889995_3.jpg,","hasFullContentTranslated":true,"hasPublished":true}]