[{"id":"1854558576460603876","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 00:16:35","content":"On November 3, in Ganzhou, Jiangxi, shop owners of Ouyada protested against the developer for not paying rent. One owner said, \"We bought the shop, rented it out, and they are unwilling to pay rent or return the shop to us. How is this different from robbery?\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854558576460603876_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854558576460603876_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854571402709397525","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 01:07:33","content":"On November 2, owners of MixC in Heze, Shandong Province gathered to protest that the developer had not made any water and electricity changes in the ten years since they moved in, and still used the power supply transferred by the property management company. The property management company collected electricity bills every month, with huge errors and frequent power outages. In addition, the property management company also tied the property management fees to the electricity bills, and often cut off the owners' water and electricity to achieve the purpose of forcibly collecting property management fees. The owners' desire to hire a new property management company was also obstructed at every level. The owners have been reporting the situation to the relevant departments for five years, but have always been perfunctory. It is reported that Tianhua Mansion and Four Seasons Flower City in the same city also have the same problem.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854571402709397525_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854571402709397525_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854574769967878337","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 01:20:56","content":"October 31, Xingtai, Hebei. The owners of Poly Time Impression Phase II protested against the developer's installation of air energy. It is understood that the contract signed between the developer and the owner stipulated that central heating should be provided, but when the house was delivered, it was privately changed to air energy heating. The green space on the south side of the community was occupied, the lighting of users on the lower floors was affected, and the noise generated by the air energy also seriously affected the lives of the residents.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854574769967878337_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854574769967878337_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854612861231726888","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 03:52:17","content":"Recently, in Zhongmou County, Zhengzhou, Henan, the owners of Xinyuan Yuefu set up a shed downstairs of the unfinished building to cook in protest of the unfinished project.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854612861231726888_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854641682580394249","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 05:46:49","content":"October 28, Zhengzhou, Henan. Homeowners of Xingliancheng Tianjieyuan Community protested against the suspension of construction.\nOctober 31, Loudi, Hunan. Homeowners of Xinhua Country Garden Tianxiwan Community marched with banners to protest against the unfinished project.\nNovember 2, Dalian, Liaoning. Homeowners of Country Garden Wanghai Center protested against the delayed delivery of houses.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854641682580394249_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854641682580394249_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854641682580394249_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854641682580394249_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854645961370239124","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 06:03:49","content":"October 28, Yantai, Shandong. The owners of Tiantai Xuefu No. 1 went to the Yantai Municipal Bureau of Letters and Calls to ask the government to make a decision. It is understood that the building was on the verge of unfinished construction. After the forced delivery, the owners found that the water, electricity, gas, network, and basement did not meet the usage standards.\nNovember 2, Anqing, Anhui. The owners of Fengda Yikangfu protested against the developer's false propaganda, replacing the stone slabs with asphalt, and betraying the original promise of separating people and vehicles, and demanded to return the house.\nNovember 1, Deyang, Sichuan. The owners of Beixin International Tianfu Market protested that the shops were turned into warehouses and were deceived by the developer. According to the video, most of the owners are elderly people aged 50 to 80 who do not have social security.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854645961370239124_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854645961370239124_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854645961370239124_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854649684561698890","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 06:18:37","content":"October 31, Xi'an, Shaanxi. Owners of Lintong Sunac Taoyuan Mansion protested against unfinished projects and demanded to see the mayor.\nOctober 31, Xi'an, Shaanxi. Villagers of Dongsanyaobao went to the municipal government to defend their rights and protested against the change of the location of their resettlement housing, and were violently driven away by the police.\nNovember 4, Sanmenxia, Henan. Owners of Shengtang Jiangshanyue Community protested against unfinished projects.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854649684561698890_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854649684561698890_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854649684561698890_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854649684561698890_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854656209736835408","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 06:44:32","content":"November 4, Xi'an, Shaanxi. Owners of the Eurasia Scenery No. 3 LOFT community protested against the property's excessive heating charges.\nNovember 4, Yulin, Guangxi. Owners of the Yongli Impression community hung banners to protest the unfinished project and asked the government to take charge.\nNovember 4, Guangzhou, Guangdong. Owners of the Xicheng Duhui community protested against the property's random charges and demanded the establishment of an owner's committee.\nNovember 5, Luohe, Henan. Owners of the Changjian Guanjing community protested against the delayed delivery of houses.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854656209736835408_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854656209736835408_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854656209736835408_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854656209736835408_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854659389707194790","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 06:57:11","content":"November 3, Yulin, Shaanxi. Villagers from Xiaodungou Village, Jiejiabao Township, Shenmu County, reported Yaoqu Coal Mine for improper mining in real name.\nOctober 28, Zhangjiakou, Hebei. Villagers from Xuejiaying Village, Chuchangdi Township protested against the occupation of farmland for the construction of a photovoltaic power plant. It is understood that the village committee arbitrarily contracted the villagers' farmland to a company for the installation of photovoltaic power generation at a price of 100 yuan per mu for 26 years. The villagers collectively opposed it, and the construction unit also threatened them to force the installation.\nOctober 16, Tianmen, Hubei. Villagers from Jiangqiao Village, Wangchang Town, opposed the installation of wind turbines and were beaten during the process.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854659389707194790_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854659389707194790_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854659389707194790_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854659389707194790_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854662987853787360","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 07:11:28","content":"November 5, Zhengzhou, Henan. The owners of the third phase of Sunac Yuhu Chenyuan petitioned to protest the unfinished project.\nNovember 5, Guangzhou, Guangdong. The old owners of a community blocked the door of the marketing center to prevent others from buying houses because they were dissatisfied with the developer's price reduction.\nNovember 5, Heze, Shandong. Due to the random price increase of the property, the owners of Xinhe Jiayuan Community in Dingtao District demanded to change the property.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854662987853787360_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854662987853787360_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854662987853787360_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854662987853787360_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854666245012144176","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 07:24:25","content":"On November 5, in Nanchang, Jiangxi, the owners of Shanggao Central Community, developed by Jianglv Group, protested that they had not received their property certificates. According to the video, the reason for not being able to obtain the property certificates was that Jianglv Group had sold more houses than the quota allowed.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854666245012144176_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854666245012144176_1.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854666245012144176_2.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854666245012144176_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854711941056299105","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 10:26:00","content":"November 6, Zhengzhou, Henan. Owners of a Sunac project protested against the unfinished project.\nNovember 5, Yichun, Jiangxi. Teachers from Wanzai County went to the county government to petition for their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854711941056299105_0.jpg,/tweet/video/whyyoutouzhele/2024/11/08/1854711941056299105_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854805266191335829","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 16:36:50","content":"November 7 (Released) A little boy pointed at a foreigner and said angrily: I will beat you to death.\nForeigner: Why?\nLittle boy: Because foreigners cannot invade China.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/08/1854805266191335829_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854810716278342122","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 16:58:30","content":"On November 7, Shandong. Netizens posted a ticket for having more than one child in 1984, which showed a fine of 1,500 yuan. If the fine is not paid within the time limit, a fine and confiscation of property will be imposed.\nIn response to this, many netizens recalled in the comment area that they were also left in this world after their family members paid the fine, and were \"bought\" at a high price.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854810716278342122_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854810716278342122_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854810716278342122_2.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854810716278342122_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854814068735197577","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-08 17:11:49","content":"On November 3, Linyi, Shandong. Netizens posted a copy of the \"Family Planning Reward Reporting Instructions\" from the 1990s. Residents who report excessive births to the local authorities and attach a \"reporting password\" can receive a cash reward. The local authorities will then announce the winners' \"reporting passwords\" to protect the reporters.","images":"/tweet/image/whyyoutouzhele/2024/11/08/1854814068735197577_0.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854814068735197577_1.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854814068735197577_2.jpg,/tweet/image/whyyoutouzhele/2024/11/08/1854814068735197577_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]