[
  {
    "id": "1651893338507735041",
    "name": "李老师不是你老师",
    "createdDate": "2023-04-28 18:17:17",
    "content": "Netizen contribution\nWang Shuixing, a 63-year-old rural postman in Shehongshi Township, Suining, Sichuan, has not retired yet.\nAccording to his description, he paid the pension money to the postal department, but many years later he found that the postal department did not pay the money to the Social Security Bureau. Now it is time to retire, but his name is not on the Social Security Bureau.\nHe can only shamelessly \"stay\" at his post and continue to work. No pension means that leaving the job means losing the source of livelihood, otherwise \"what will I eat?\"",
    "images": "/tweet/image/whyyoutouzhele/2023/04/28/1651893338507735041_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1651896674955010055",
    "name": "李老师不是你老师",
    "createdDate": "2023-04-28 18:30:32",
    "content": "Netizen contribution\nOn April 25, Nantong City, Jiangsu Province issued a notice on the digital RMB pilot work plan.",
    "images": "/tweet/image/whyyoutouzhele/2023/04/28/1651896674955010055_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/iZb5Cb9vGu",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1651897921409884160",
    "name": "李老师不是你老师",
    "createdDate": "2023-04-28 18:35:29",
    "content": "Netizen submissions\nOn April 28, the Central Cyberspace Affairs Commission issued a document: Focus on the governance of maliciously spreading the \"private enterprises sell out the country\" and other arguments by labeling and other means\nThe focus of governance includes \"labeling\", \"leading the rhythm\", \"magnifying glass\" and other methods to maliciously spread the so-called \"private enterprises sell out the country\", \"private enterprises leave the market\", \"state advances and private retreats\" and other arguments, exaggerating and inciting resistance to state-owned economy and private enterprises. Disclose corporate business secrets, fabricate topics about entrepreneurs' private lives, hype entrepreneurs' personal privacy, and disclose entrepreneurs' biometrics, medical health, financial accounts, whereabouts, home addresses, ID numbers, phone numbers and other personal information.\nUse \"title party\" to distort the original meaning of the news, quote entrepreneurs' past remarks out of context, and interpret corporate financial statements one-sidedly to interfere with the normal operation of enterprises.\nMalicious marketing by hyping hot events involving enterprises, and intensive posting by multiple accounts across platforms to maliciously attack enterprises and entrepreneurs.\nUse their own convenience in information release, as well as technology, traffic, and influence advantages to fabricate and spread false and misleading information, smear and attack competitors, etc.",
    "images": "/tweet/image/whyyoutouzhele/2023/04/28/1651897921409884160_0.jpg,/tweet/image/whyyoutouzhele/2023/04/28/1651897921409884160_1.jpg,/tweet/image/whyyoutouzhele/2023/04/28/1651897921409884160_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1651902054229483520",
    "name": "李老师不是你老师",
    "createdDate": "2023-04-28 18:51:55",
    "content": "Netizen contribution\nOn April 26, the State Council issued a notice to widely mobilize various enterprises, institutions, social organizations, etc. to recruit no less than 1 million youth internship positions. Internship subsidies will be provided to those who employ interns.",
    "images": "/tweet/image/whyyoutouzhele/2023/04/28/1651902054229483520_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/rlEgJSfxC5",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1651915640150556672",
    "name": "李老师不是你老师",
    "createdDate": "2023-04-28 19:45:54",
    "content": "Netizen contribution\nOn April 28, the first golden week after China ended the zero-COVID policy, the Shanghai Railway Station welcomed the highest single-day passenger flow this year, and Shanghai Hongqiao Station announced that all tickets to stations across the country on that day were sold out.\nAccording to the forecast of the China Railway Corporation, during the May Day holiday this year, the national railway is expected to send 120 million passengers, which will exceed the highest level in the same period in history\nIn terms of civil aviation, the current May Day holiday ticket bookings exceed 6 million, and it is estimated that civil aviation will transport about 9 million passengers during the May Day holiday. This means that the number of civil aviation passengers during this year's May Day holiday will exceed the pre-epidemic level, becoming the busiest May Day holiday in history.",
    "images": "/tweet/image/whyyoutouzhele/2023/04/28/1651915640150556672_0.jpg,/tweet/image/whyyoutouzhele/2023/04/28/1651915640150556672_1.jpg,/tweet/image/whyyoutouzhele/2023/04/28/1651915640150556672_2.jpg,/tweet/image/whyyoutouzhele/2023/04/28/1651915640150556672_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  }
]