[{"id":"1758074953402888455","name":"李老师不是你老师","createdDate":"2024-02-15 18:25:07","content":"February 14, Minfeng Village, Dongkou County, Shaoyang, Hunan. Local residents posted a video saying that a homicide occurred in the village. The son-in-law went to his mother-in-law's house to pay New Year's greetings and hacked his mother-in-law and father-in-law. A total of 4 people were injured. The father-in-law was not saved and the other 3 were injured. Today, more than a dozen police cars entered and exited the village, and the intersections were blocked. Now there are drones in the sky over the mountains. Today, the trunks of cars going out have been checked. The village broadcast reminded the villagers to close the doors and windows and pay attention to safety.\nIt is understood that the Dongkou County Public Security Bureau issued a reward notice on the 14th. The notice stated that at about 23:00 on February 13, 2024, an intentional injury case occurred in Minfeng Village, Xuefeng Street, Dongkou County, and the suspect Tang Yongdong (male, Han nationality, nicknamed \"Nao Ga\", 46 years old) fled with the case.\nAnother Dongkou County resident said, \"The suspect has fled to our town.\" He said he was in Gaosha Town. Another netizen revealed: The suspect often abused his wife. The last time he abused her, he broke several of her ribs. The woman's family had always wanted her to divorce, but the man refused, so this incident happened.","images":"/tweet/image/whyyoutouzhele/2024/02/15/1758074953402888455_0.jpg,/tweet/image/whyyoutouzhele/2024/02/15/1758074953402888455_1.jpg,/tweet/image/whyyoutouzhele/2024/02/15/1758074953402888455_2.jpg,/tweet/image/whyyoutouzhele/2024/02/15/1758074953402888455_3.jpg","videos":"","hasPublished":true},{"id":"1758080193711726941","name":"李老师不是你老师","createdDate":"2024-02-15 18:45:56","content":"On February 14, Zhumadian, Henan. Many netizens took photos of purple smoke coming out of the chimney of the fertilizer plant in Yicheng District. Some netizens questioned whether it was toxic gas. An employee of Henan Junhua Fertilizer Plant responded that it was because of equipment maintenance at the time, and the gas that needed to be replaced was put into the fire cabinet to burn, and the released gas was non-toxic and harmless.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/15/1758080193711726941_0.jpg,/tweet/video/whyyoutouzhele/2024/02/15/1758080193711726941_1.jpg","hasPublished":true},{"id":"1758083312793313598","name":"李老师不是你老师","createdDate":"2024-02-15 18:58:20","content":"On December 19, a student from Tsinghua University Shenzhen Graduate School jumped off a building because his supervisor had promised him a doctoral degree but failed to do so and because of some emotional problems.\nOn February 15, a student on campus said that the place where the student fell from the building had been patched up with a piece of cement.\n\"Only that piece of cement proves that he existed\"","images":"/tweet/image/whyyoutouzhele/2024/02/15/1758083312793313598_0.jpg,/tweet/image/whyyoutouzhele/2024/02/15/1758083312793313598_1.jpg","videos":"","hasPublished":true},{"id":"1758087538747548130","name":"李老师不是你老师","createdDate":"2024-02-15 19:15:07","content":"More on-site footage of the explosion at Building 9, Jinwan Mengdu, Xingjiawan Community","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/15/1758087538747548130_0.jpg,/tweet/video/whyyoutouzhele/2024/02/15/1758087538747548130_1.jpg","hasPublished":true},{"id":"1758090689621917964","name":"李老师不是你老师","createdDate":"2024-02-15 19:27:38","content":"Some netizens found that all comments related to the Taiwan side's expulsion of a Fujian fishing boat on February 14, which resulted in the death of two people, have been banned or selected, and all related topics have been removed from the hot search list in an attempt to cool down the incident.\nHowever, in March 2020, domestic media had advocated that a mainland fishing boat forcefully rammed a Taiwan patrol boat, and the barrage was full of applause at the time.","images":"/tweet/image/whyyoutouzhele/2024/02/15/1758090689621917964_0.jpg,/tweet/image/whyyoutouzhele/2024/02/15/1758090689621917964_1.jpg","videos":"/tweet/video/whyyoutouzhele/2024/02/15/1758090689621917964_0.jpg","hasPublished":true},{"id":"1758092566799466710","name":"李老师不是你老师","createdDate":"2024-02-15 19:35:06","content":"On February 15, at the Langfang High-speed Railway Station in Hebei Province, a man was stopped by the police because his child was carrying a toy gun. The man kicked the gun to pieces in anger.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/15/1758092566799466710_0.jpg","hasPublished":true},{"id":"1758095019758473559","name":"李老师不是你老师","createdDate":"2024-02-15 19:44:51","content":"As of February 15, there are still people in black guarding the entrance to Zhaike Village, and only local villagers or their relatives and friends can enter the village.","images":"/tweet/image/whyyoutouzhele/2024/02/15/1758095019758473559_0.jpg,/tweet/image/whyyoutouzhele/2024/02/15/1758095019758473559_1.jpg","videos":"","hasPublished":true},{"id":"1758107450710888829","name":"李老师不是你老师","createdDate":"2024-02-15 20:34:14","content":"Around 7pm on February 15, in Dongguan, a car hit two electric bikes and fled. Afterwards, the tire of the vehicle was punctured (some say it was shot by the police) and then it hit another electric bike and was stopped.","images":"/tweet/image/whyyoutouzhele/2024/02/15/1758107450710888829_0.jpg","videos":"/tweet/video/whyyoutouzhele/2024/02/15/1758107450710888829_0.jpg","hasPublished":true},{"id":"1758111276914352574","name":"李老师不是你老师","createdDate":"2024-02-15 20:49:27","content":"On February 15, in Wuzhou, Guangxi, a worker posted a video saying that Chiji Steel Co., Ltd. would not give a holiday during the Spring Festival, and if a worker did not come to work during the Spring Festival, all wages would be deducted and the worker would be fired.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/15/1758111276914352574_0.jpg","hasPublished":true},{"id":"1758118234841067748","name":"李老师不是你老师","createdDate":"2024-02-15 21:17:06","content":"At present, the local authorities have issued a notice asking villagers and their relatives and friends not to post about the incident on Douyin, WeChat, or Weibo to avoid causing adverse effects. At the same time, they are also checking whether there are any abnormalities in their homes.","images":"/tweet/image/whyyoutouzhele/2024/02/15/1758118234841067748_0.jpg","videos":"","hasPublished":true},{"id":"1758125809376674014","name":"李老师不是你老师","createdDate":"2024-02-15 21:47:12","content":"One netizen added:","images":"/tweet/image/whyyoutouzhele/2024/02/15/1758125809376674014_0.jpg","videos":"","hasPublished":true}]