[{"id":"1843683048916955436","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:01:07","content":"On October 6, a Douyin blogger named \"The Fake Association of the Village Behind Enemy Lines\" released a video criticizing domestic self-media for playing word games when writing news headlines. When Israel was attacked, domestic media reported that it was done by the Houthi armed forces, Hamas and Hezbollah; and when Israel fought back, domestic media said that it was Yemen, Palestine and Lebanon that were attacked.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/09/1843683048916955436_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843684879151837675","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:08:23","content":"On October 4, the Straits Exchange Foundation, which is responsible for cross-strait non-governmental exchanges in Taiwan, revealed that since January last year, there have been a total of 77 cases of Taiwanese people losing contact while traveling to the mainland, of which more than 40 are still missing. Among the other 30-plus people, except for some who lost contact due to personal reasons, most of the others were related to fraud cases in the mainland.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843684879151837675_0.jpg,/tweet/image/whyyoutouzhele/2024/10/09/1843684879151837675_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843686831440707824","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:16:09","content":"On October 8, Zhu Fenglian, spokesperson for the Taiwan Affairs Office of the State Council of China (TAO), criticized Taiwan President Lai Ching-te's \"motherland theory\" as a Taiwan independence fallacy of \"old wine in new bottles\", which once again exposed his stubborn Taiwan independence stance and his sinister intention to escalate hostility and confrontation. The spokesperson also said: \"On October 25, 1945, the Chinese government declared \"the resumption of sovereignty over Taiwan\". On October 1, 1949, the Central People's Government of the People's Republic of China was established, replacing the government of the Republic of China as the only legitimate government representing all of China. This is a regime change in which China, as a subject of international law, has not changed. China's sovereignty and inherent territorial boundaries have not changed. The government of the People's Republic of China naturally enjoys and exercises China's sovereignty, including sovereignty over Taiwan.\"","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843686831440707824_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843691208897347818","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:33:32","content":"On October 8, China's Ministry of Commerce decided to implement temporary anti-dumping measures on imported brandy originating from the EU. The Ministry of Commerce's communiqué stated that it was preliminarily determined that there was dumping of imported brandy originating from the EU, \"the domestic brandy industry is threatened with substantial damage, and there is a causal relationship between dumping and the threat of substantial damage.\" According to Deutsche Welle, this is considered a response to the EU countries' vote to impose tariffs on Chinese electric vehicles last week, especially a punishment for France, an important promoter of the tariffs. Paris has stated that it is \"unacceptable\", and China is still studying measures such as raising tariffs on imported large-displacement fuel vehicles.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843691208897347818_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843697015940894856","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:56:37","content":"On October 8, Bloomberg reported that the World Bank warned that China's economic growth may slow further next year. The International Monetary Fund said in its semi-annual economic outlook report that China's economic growth is expected to drop from 4.8% in 2024 to 4.3% next year.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843697015940894856_0.jpg,/tweet/image/whyyoutouzhele/2024/10/09/1843697015940894856_1.jpg,/tweet/image/whyyoutouzhele/2024/10/09/1843697015940894856_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843699088774312155","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 01:04:51","content":"According to Lianhe Zaobao, the share prices of French wine merchants fell. As of October 8, the share price of Pernod Ricard, the world's second largest wine and spirits production group, fell by 4%, and the share price of Remy Cointreau, a French wine giant, fell by 8.3%. The single-day share price declines of the two companies will hit new lows in 11 and 10 months respectively.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843699088774312155_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843705285720076609","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 01:29:29","content":"Recently, a netizen uploaded this video to Bilibili, and netizens in the comment section expressed their support and hope that he would succeed. Some people lamented that \"now even the director can only report under his real name\", and some people said sarcastically \"please go through the formal channels\".","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843705285720076609_0.jpg,/tweet/image/whyyoutouzhele/2024/10/09/1843705285720076609_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843707220581908546","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 01:37:10","content":"On October 8, a netizen posted a video and pictures saying that someone in Ningbo Raffles Square jumped off a building due to stock market failure. On the afternoon of the 8th, a reporter learned from the mall that someone fell from a building at noon and was sent to the hospital. The local official report said that the woman who fell from the building had unfortunately passed away, and the connection between the incident and the stock market was a rumor, and the rumor-mongering suspect had been summoned to court.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843707220581908546_0.jpg,/tweet/image/whyyoutouzhele/2024/10/09/1843707220581908546_1.jpg,/tweet/image/whyyoutouzhele/2024/10/09/1843707220581908546_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/09/1843707220581908546_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843721022396076293","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 02:32:01","content":"\"Changjin Lake\" premiered in Iran. From September 23 to 27, the 4th China Film Week was held in Tehran, the capital of Iran. Many Chinese films, including \"Changjin Lake\", were shown to Iranian audiences. Meng Yaqi, an Iranian blogger, posted a video of watching the movie on TikTok. The video showed that before the movie was shown, the national anthem of the People's Republic of China sounded, and all the audience stood up and looked forward. The atmosphere was solemn. In the subsequent screening, the audience looked at the screen attentively.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/09/1843721022396076293_0.jpg,/tweet/video/whyyoutouzhele/2024/10/09/1843721022396076293_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843763060575789273","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 05:19:03","content":"On October 8, the main funds of A-shares fled in large numbers","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843763060575789273_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843764747982029281","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 05:25:46","content":"Veteran exposes child marriage but is exposed by officials. On August 28, 2023, a Weibo user exposed a child marriage of a 16-year-old girl in Xining, Qinghai. The relevant departments of Xining then obtained the blogger's mobile phone number through Weibo and leaked it to the bride's family, instructing and threatening to delete the post. Under pressure, the blogger was forced to apologize online. On October 8, more than a month after the incident, the blogger said that the local officials had not yet explained, acknowledged or expressed their views on the matter.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843764747982029281_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843767867604402567","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 05:38:09","content":"A woman in Chongqing beat up a delivery boy. On October 8, a video of a woman beating up a delivery boy near University City West Road in Chongqing was circulated on the Internet. In the video, a woman stomped on the face of a delivery rider who fell to the ground. The beaten delivery rider posted that he was beaten to the emergency room on his first day at work, which caused him a lot of trauma. He was kicked in the head many times, but he did not fight back. According to police investigation, Huang drank alcohol that day and took his friend Zhang to University City West Road on an electric bicycle. Because he swayed left and right in an S shape on the road, Ran accused him when he overtook him, and the two sides had an argument. Huang pulled Ran to the ground and kicked and beat him, causing Ran to be injured. At present, Huang has been criminally detained by the public security organs in accordance with the law, and the case is under further investigation and processing.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843767867604402567_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/09/1843767867604402567_0.jpg,/tweet/video/whyyoutouzhele/2024/10/09/1843767867604402567_1.jpg,/tweet/video/whyyoutouzhele/2024/10/09/1843767867604402567_2.jpg,","hasFullContentTranslated":true,"hasPublished":true}]