[{"id":"1843683048916955436","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:01:07","content":"On October 6, a Douyin blogger named \"The Fake Association of the Village Behind Enemy Lines\" released a video criticizing domestic self-media for playing word games when writing news headlines. When Israel was attacked, domestic media reported that it was done by the Houthi armed forces, Hamas and Hezbollah; and when Israel fought back, domestic media said that it was Yemen, Palestine and Lebanon that were attacked.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/09/1843683048916955436_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843684879151837675","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:08:23","content":"On October 4, the Straits Exchange Foundation, which is responsible for cross-strait non-governmental exchanges in Taiwan, revealed that since January last year, there have been a total of 77 cases of Taiwanese people losing contact while traveling to the mainland, of which more than 40 are still missing. Among the other 30-plus people, except for some who lost contact due to personal reasons, most of the others were related to fraud cases in the mainland.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843684879151837675_0.jpg,/tweet/image/whyyoutouzhele/2024/10/09/1843684879151837675_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843686831440707824","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:16:09","content":"On October 8, Zhu Fenglian, spokesperson for the Taiwan Affairs Office of the State Council of China (TAO), criticized Taiwan President Lai Ching-te's \"motherland theory\" as a Taiwan independence fallacy of \"old wine in new bottles\", which once again exposed his stubborn Taiwan independence stance and his sinister intention to escalate hostility and confrontation. The spokesperson also said: \"On October 25, 1945, the Chinese government declared \"the resumption of sovereignty over Taiwan\". On October 1, 1949, the Central People's Government of the People's Republic of China was established, replacing the government of the Republic of China as the only legitimate government representing all of China. This is a regime change in which China, as a subject of international law, has not changed. China's sovereignty and inherent territorial boundaries have not changed. The government of the People's Republic of China naturally enjoys and exercises China's sovereignty, including sovereignty over Taiwan.\"","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843686831440707824_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843691208897347818","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:33:32","content":"On October 8, China's Ministry of Commerce decided to implement temporary anti-dumping measures on imported brandy originating from the EU. The Ministry of Commerce's communiqué stated that it was preliminarily determined that there was dumping of imported brandy originating from the EU, \"the domestic brandy industry is threatened with substantial damage, and there is a causal relationship between dumping and the threat of substantial damage.\" According to Deutsche Welle, this is considered a response to the EU countries' vote to impose tariffs on Chinese electric vehicles last week, especially a punishment for France, an important promoter of the tariffs. Paris has stated that it is \"unacceptable\", and China is still studying measures such as raising tariffs on imported large-displacement fuel vehicles.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843691208897347818_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843697015940894856","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 00:56:37","content":"On October 8, Bloomberg reported that the World Bank warned that China's economic growth may slow further next year. The International Monetary Fund said in its semi-annual economic outlook report that China's economic growth is expected to drop from 4.8% in 2024 to 4.3% next year.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843697015940894856_0.jpg,/tweet/image/whyyoutouzhele/2024/10/09/1843697015940894856_1.jpg,/tweet/image/whyyoutouzhele/2024/10/09/1843697015940894856_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1843699088774312155","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-09 01:04:51","content":"According to Lianhe Zaobao, the share prices of French wine merchants fell. As of October 8, the share price of Pernod Ricard, the world's second largest wine and spirits production group, fell by 4%, and the share price of Remy Cointreau, a French wine giant, fell by 8.3%. The single-day share price declines of the two companies will hit new lows in 11 and 10 months respectively.","images":"/tweet/image/whyyoutouzhele/2024/10/09/1843699088774312155_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]