[{"id":"1865066148473307192","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-07 00:09:55","content":"A Chinese soldier named \"A Pao Ge\" who joined the army in Russia wrote: Does Sino-Russian friendship really exist? The battalion commander wanted to leave all the Chinese on the front line without withdrawing any of them, and then find a reason to report them missing to his superiors.\nBefore the mission, the battalion commander also confiscated our bank cards, and our two Apple phones were also taken by the battalion commander.","images":"/tweet/image/whyyoutouzhele/2024/12/07/1865066148473307192_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1865071823366558157","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-07 00:32:28","content":"Recently, a large number of netizens sent private messages to the official account of the \"All-China Federation of Trade Unions\", asking questions such as when the 8-hour work system can be implemented. \nCurrently, the official account of the \"All-China Federation of Trade Unions\" has turned on the \"ban comments\" mode.","images":"/tweet/image/whyyoutouzhele/2024/12/07/1865071823366558157_0.jpg,/tweet/image/whyyoutouzhele/2024/12/07/1865071823366558157_1.jpg,/tweet/image/whyyoutouzhele/2024/12/07/1865071823366558157_2.jpg,/tweet/image/whyyoutouzhele/2024/12/07/1865071823366558157_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1865084116766724280","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-07 01:21:19","content":"Chinese diplomat Xu Wei was expelled for urging Paraguay to recognize China instead of Taiwan, saying that this choice would benefit Paraguay. Paraguay accused him of interfering in its internal affairs.\nIt is reported that Paraguay is Taiwan's only remaining diplomatic ally in South America.","images":"/tweet/image/whyyoutouzhele/2024/12/07/1865084116766724280_0.jpg,/tweet/image/whyyoutouzhele/2024/12/07/1865084116766724280_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1865111932346220985","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-07 03:11:51","content":"TikTok is one step closer to being banned in the United States. On December 6, three judges of the U.S. Court of Appeals for the District of Columbia Circuit rejected TikTok's request to overturn the bill. The bill requires TikTok's parent company ByteDance to sell TikTok to a non-Chinese company by January 19, otherwise it will face a U.S. ban.","images":"/tweet/image/whyyoutouzhele/2024/12/07/1865111932346220985_0.jpg,/tweet/image/whyyoutouzhele/2024/12/07/1865111932346220985_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1865194067891753105","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-07 08:38:14","content":"On June 27, an explosion occurred at the Menzigou Gold Mine in Pan'an Township, Xiaojin County, Aba Prefecture, Sichuan Province. The drill bit hit the explosive left behind, causing an explosion, which caused a man to remove his left eyeball and blurred vision in his right eye. The injured believed that this was a work-related injury, but the mine owner not only failed to provide reasonable compensation and treatment, but also tried to shirk responsibility and blamed the accident on the injured. The injured then petitioned and was detained for five days, and was accused of \"stealing national resources\". The injured felt very wronged and helpless about this accusation. He said that he came here through an introduction and worked for only 5 days. He knew nothing about the operation and management of the gold mine and did not gain any vested interests. He questioned: \"Is my eye blinded by the explosion, and justice has also abandoned me?\"","images":"/tweet/image/whyyoutouzhele/2024/12/07/1865194067891753105_0.jpg,/tweet/image/whyyoutouzhele/2024/12/07/1865194067891753105_1.jpg,/tweet/image/whyyoutouzhele/2024/12/07/1865194067891753105_2.jpg,/tweet/image/whyyoutouzhele/2024/12/07/1865194067891753105_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1865203096173084840","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-07 09:14:06","content":"The truck driver who jumped off the elevated bridge in Zhengzhou, his last life video before leaving home on the day of the jump, and the grief reaction of his family members after learning the news of the jump were posted on Douyin by his family.\nThe family has two children, one of whom is only four years old and in kindergarten.\nThe driver who jumped off the bridge was also working for his boss as a truck driver","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/07/1865203096173084840_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1865210330013667460","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-07 09:42:51","content":"November 30th, Shanxi Luliang, a farmer reported in real name that Shanxi Coking Coal occupied farmland and abandoned coal slag to cause pollution\nDecember 3rd, Shaanxi Weinan, Pinyang Zijun Community, owners protested that they had paid heating fees but did not receive heating\nDecember 3rd, Shaanxi Xianyang, Qindu District Government, workers demanded wages\nDecember 4th, Guangdong Meizhou, Zhihao Electronic Technology Co., Ltd. workers marched to demand wages","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/07/1865210330013667460_0.jpg,/tweet/video/whyyoutouzhele/2024/12/07/1865210330013667460_1.jpg,/tweet/video/whyyoutouzhele/2024/12/07/1865210330013667460_2.jpg,/tweet/video/whyyoutouzhele/2024/12/07/1865210330013667460_3.jpg,","hasFullContentTranslated":true,"hasPublished":true}]