[{"id":"1851410753837769200","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 07:48:15","content":"On October 29, Nanjing Happy Valley urgently removed all Halloween elements from its shelves. Beijing Shijingshan Park announced the cancellation of its parade performances.","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851410753837769200_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851410753837769200_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851414843565445507","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 08:04:30","content":"October 29, Hangzhou.\nThe Yuhang Subdistrict Office opened the gate for the construction of Taoyuanli single-family villa area on the wall of the neighboring community, which caused dissatisfaction among the owners of the community and their rights protection.\nA large number of stability maintenance personnel were dispatched to the construction site, and black plastic bags were used to cover the cameras.","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851414843565445507_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851414843565445507_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/30/1851414843565445507_0.jpg,/tweet/video/whyyoutouzhele/2024/10/30/1851414843565445507_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851416128729346323","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 08:09:37","content":"On the evening of October 28, Beijing. A student from Beijing Wudao Art Studio stabbed a classmate next to him with a knife.\nAccording to the contributor, it was because of the approaching unified examination, the studio's high-intensity management, and the very late get out of class time every day, which caused the student to have a mental breakdown.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/30/1851416128729346323_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851421652866703451","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 08:31:34","content":"Updated on October 30, 2024:\nMay 31, 2024, points out the direction for the development of China-Arab relations in the new era\nMay 31, 2024, points out the direction for how to accelerate the construction of a China-Arab community of shared future\nJune 1, 2024, points out the direction for the development of prosperous China-Arab relations\nJune 1, 2024, points out the direction for the comprehensive strategic partnership between China and Saudi Arabia\nJune 3, 2024, points out the direction for the development of advanced manufacturing in the central region\nJune 3, 2024, points out the direction for the development of China's engineering technology\nJune 10, 2024, points out the direction for the development of agriculture and rural areas in the central region\nJune 13, 2024, points out the direction for global sustainable development and international cooperation\nJune 14, 2024, points out the direction for the development of advanced manufacturing in the central region\nJune 21, 2024, points out the direction for accelerating the construction of a beautiful new Ningxia\nJune 22, 2024, points out the direction for the tea industry...","images":"","videos":"","hasFullContentTranslated":false,"fullContent":"2024年10月30日更新：\n2024年5月31日 为新时代中阿关系发展指明方向\n2024年5月31日 为中阿命运共同体建设如何跑出加速度指明方向\n2024年6月1日 为繁荣的阿中关系指明了发展方向\n2024年6月1日 为中沙全面战略伙伴关系指明方向\n2024年6月3日 为中部地区壮大先进制造业指明方向\n2024年6月3日 为中国工程科技发展指明方\n2024年6月10日 为中部地区农业农村发展指明方向\n2024年6月13日 为全球可持续发展和国际合作指明方向\n2024年6月14日 为中部地区壮大先进制造业指明方向\n2024年6月21日 为加快建设美丽新宁夏指明方向\n2024年6月22日 为茶业健康发展指明方向\n2024年6月25日 为做好新时代科技工作指明前进方向\n2024年6月29日 进一步健全全面从严治党体系指明方向\n2024年7月5日 为上合组织应对时代变局指明了方向\n2024年7月9日 为中乌关系高水平发展指明方向\n2024年7月11日 为优化人口发展战略指明工作方向\n2024年7月11日 为中国所罗门群岛关系未来发展进一步指明方向\n2024年7月15日 为抓改革、促发展指明奋进方向\n2024年7月22日 为世界探索和平发展之路指明了前行方向\n2024年7月22日 为中德关系未来发展指明方向\n2024年7月25日为推动民航业高质量发展、建设交通强国指引方向\n2024年7月26日 为各地各部门开展防汛抗洪救灾指明方向\n2024年7月28日 为退役军人工作指明方向\n2024年8月3日 为构建高水平社会主义市场经济体制指明方向\n2024年8月7日为新时代推动世界遗产事业高质量发展指明方向\n2024年8月13日 为建设文化强国指明方向\n2024年8月21日 为深化中国越南务实合作指明方向\n2024年8月21日 为进一步发展体育事业指明方向\n2024年8月26日 为同建设网上精神家园指明方向\n2024年8月30日 为全党进一步加强党的纪律建设指明方向\n2024年9月2日 为中国南非两国关系发展指明方向\n2024年9月6日 为中非如何共逐现代化之梦指明方向\n2024年9月11日 为推进乡村全面振兴、加快农业农村现代化步伐指明方向\n2024年9月12日 为服务业发展指明方向\n2024年9月13日 为统筹推进山水林田湖草沙一体化保护和系统治理指明方向\n2024年9月14日 为人民代表大会制度的完善发展指明方向。\n2024年9月15日 为新时代加强和改进人大工作指明方向。\n2024年9月15日为推动黄河流域生态保护和高质量发展擘画蓝图、指明方向\n2024年9月21日 为为新时代新征程人民政协事业高质量发展指明方向\n2024年10月06日 为百年变局中的动荡世界指明方向\n2024年10月06日 为乡村振兴和现代化建设新局面指明方向\n2024年10月19日 为绿色低碳发展指明方向\n2024年10月24日 为推动“大金砖合作”行稳致远指明五个方向\n2024年10月24日 为维护人类共同安全指明方向\n2024年10月24日 为紧跟时代步伐，培育薪资生产力指明方向\n2024年10月24日 为金砖国家融入全球绿色低碳转型指明方向\n2024年10月24日 为全球治理体系改革指明方向\n2024年10月24日 为中印关系重回稳定发展轨道指明方向\n2024年10月25日 为“大金砖合作”指明方向\n2024年10月28日 为民政事业发展指明方向","hasPublished":true},{"id":"1851474110448041985","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 12:00:01","content":"Recently, blogger \"Tie Xiaojun\" reported that a Chinese woman \"Ye Ting\" fled back to China after killing someone in the United States while driving under the influence. A year later, she posted on Xiaohongshu again. \nOn the 29th, Tie Xiaojun posted that the post was reported by a user named Ye.\n","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851474110448041985_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851474110448041985_1.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851474110448041985_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851546719890371055","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 16:48:32","content":"October 29 (Release) Hebei. Blogger \"Xiaolu\" shared a passage from the book \"Common Bottom Line\": Under unrestrained power, they go left and right, first robbing in the name of the left, then dividing the spoils in the name of the right. In the name of socialism, the private interests of the common people are \"public\", and in the name of the market economy, they are turned into the private interests of the powerful....\nThe video has been deleted.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/30/1851546719890371055_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851551954499256371","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 17:09:20","content":"On October 29, Huang Wenzhen, a population expert, said: The fewer children you have, the more expensive it is to raise them. He was ridiculed by many netizens.\nNetizens replied: \"Give birth to more children to serve you as cattle and horses?\"\n\"If the sheep don't give birth to children, the wolf will be angry\"\n\"When you are unemployed after the age of 40 and beg for food with your children, one more child can indeed help you get an extra bowl of rice\"","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851551954499256371_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851551954499256371_1.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851551954499256371_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/30/1851551954499256371_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851557325099978929","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 17:30:41","content":"October 29, Guangzhou, Guangdong. A netizen posted that he went to a Huawei store to buy a mobile phone today and asked the clerk what the mobile phone processor was. The clerk said it was a \"national secret formula\". When he checked the configuration online, the CPU column showed: Not announced","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851557325099978929_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851560341496541484","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 17:42:40","content":"On October 30, the National Health Commission’s official account “Healthy China” published an article: Four major benefits of having children for women:","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851560341496541484_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851560341496541484_1.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851560341496541484_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851561072236609968","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 17:45:34","content":"On October 29, Hong Kong media reported that a mainland woman broke into a wedding lunch at a Tsim Sha Tsui hotel without giving a red envelope, and even took a video and posted it on TikTok. At the time of the incident, neither the host nor the guests realized that the internet celebrity was eating for free until the next day. In Hong Kong, people who eat at other people's wedding banquets are called \"wedding banquet cockroaches.\"","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851561072236609968_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/30/1851561072236609968_0.jpg,/tweet/video/whyyoutouzhele/2024/10/30/1851561072236609968_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851568019002232836","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 18:13:10","content":"Recently, a murder case in Melbourne, Australia, was re-opened. A Chinese student killed two Chinese and Korean sex workers within 24 hours. Two years after being arrested, he admitted to manslaughter and his sentence was greatly reduced.\nIn the winter of 2022, 22-year-old Chinese student Lin Xiaozheng and Chinese prostitute Luo Yuqi had a dispute over fees. During the dispute, Lin Xiaozheng strangled her with his arm. Later, he went to the apartment of Korean prostitute Quan Xianshu and strangled her to death.\nLin Xiaozheng's father said that they lived in the countryside and had a daughter who was the only source of income for the family. After Lin Xiaozheng pleaded guilty, according to local law, the standard sentence for murder is 25 years, with a maximum of life imprisonment. The maximum sentence for manslaughter is 25 years.","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851568019002232836_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851568019002232836_1.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851568019002232836_2.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851568019002232836_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851574749929050208","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 18:39:55","content":"October 29, Zhejiang. A patriotic blogger posted a video saying: Japan committed a brutal massacre in Nanjing. This is Japan's internal affairs. Can't we interfere?\nThis video caused a lot of dissatisfaction and boycott from netizens. Currently, the blogger's works are no longer visible.","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851574749929050208_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851574749929050208_1.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851574749929050208_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/30/1851574749929050208_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851580518607040878","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 19:02:50","content":"On October 29, New Zealand (publishing IP) blogger \"Jason\" posted: \nThe minimum wage in Shanghai is 2,690 yuan/month, while the minimum social security payment base in 24 years is as high as 7,384 yuan/month. \nAssuming that a worker in Shanghai has a monthly salary of 2,690 yuan, the company has to pay 4,883.79 yuan per month for this minimum wage employee. After deducting insurance, the employee only gets 1,726.38 yuan. In other words, the money received by the employee is not as much as the social security department.","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851580518607040878_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851580518607040878_1.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851580518607040878_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851583679904292935","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 19:15:24","content":"Recently, Hezbollah appointed a new leader, Naim Qassem.\nOn October 29, the Israeli Defense Minister posted a message on X saying \"It's a temporary appointment, it won't last long\" and attached a photo of Naim Qassem.","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851583679904292935_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851586474128679130","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 19:26:30","content":"On October 30, police cars were still parked in rows along Julu Road in Shanghai.\nThe previously installed railings were not removed.\nThe police were stationed at the scene as if they were facing a major enemy.","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851586474128679130_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851586474128679130_1.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851586474128679130_2.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851586474128679130_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851604293079765065","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 20:37:19","content":"Recently, Shenzhen, Guangdong. The Internet reported that a 9-year-old female student jumped from a building at Gengzi Shouyi School in Yantian District.\nAccording to the child's father, on the 24th, his daughter was slandered by the school for stealing things and was severely criticized by the class teacher in public. Before school was over that day, his daughter rushed out of the school and ran straight to the community, and jumped from the 31st floor. However, after checking the surveillance, no girl was found to steal.\nAfterwards, the class teacher never showed up, and the school was arrogant and tried to settle the matter with 100,000 yuan.","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851604293079765065_0.jpg,/tweet/image/whyyoutouzhele/2024/10/30/1851604293079765065_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1851604878613000364","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-30 20:39:38","content":"https://t.co/XNT8DgmQh9","images":"/tweet/image/whyyoutouzhele/2024/10/30/1851604878613000364_0.jpg,","videos":"","hasPublished":true}]