[{"id":"1747879711823237556","name":"李老师不是你老师","createdDate":"2024-01-18 15:12:51","content":"On January 18, the A-share market once fell below 2,800 points, and has now rebounded to 2,845 points. Hu Xijin announced on Weibo that he would increase his holdings by 120,000, fulfilling his previous promise to \"increase holdings if it falls below 2,800.\"","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747879711823237556_0.jpg","videos":"","hasPublished":true},{"id":"1747880452579315931","name":"李老师不是你老师","createdDate":"2024-01-18 15:15:48","content":"I need to clarify for Lao Hu that \"jumping off the building at 2800 points\" is actually two sentences spliced together.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747880452579315931_0.jpg","hasPublished":true},{"id":"1747882734247186466","name":"李老师不是你老师","createdDate":"2024-01-18 15:24:52","content":"On January 17, the Changwu County Public Security Bureau in Shaanxi Province issued a notice to collect clues about online rumors from the public.","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747882734247186466_0.jpg,/tweet/image/whyyoutouzhele/2024/01/18/1747882734247186466_1.jpg","videos":"","hasPublished":true},{"id":"1747889117361233934","name":"李老师不是你老师","createdDate":"2024-01-18 15:50:14","content":"On January 16, the Hubei Provincial Committee of the Communist Youth League issued a document stating that renovation workers earn 30,000 to 40,000 yuan a month, attracting a large number of young people to join the industry.","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747889117361233934_0.jpg,/tweet/image/whyyoutouzhele/2024/01/18/1747889117361233934_1.jpg","videos":"","hasPublished":true},{"id":"1747900716708978691","name":"李老师不是你老师","createdDate":"2024-01-18 16:36:19","content":"Wu Xiaoqiu, president of the National Institute of Finance of the Chinese People's Congress, said that now is not a battle to defend the 3,000-point level, but how to get back to the 3,000-point level.\nWe must have confidence in the market. If stockholders can't stand it, they can go for a run and exercise. Health is very important at this time.","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747900716708978691_0.jpg","videos":"","hasPublished":true},{"id":"1747903205206262251","name":"李老师不是你老师","createdDate":"2024-01-18 16:46:13","content":"On January 17, a customer was stabbed in a barbershop on Fengle Road, Tianhe District, Guangzhou, Guangdong. According to netizens, the customer was dissatisfied with the haircut and had an argument with the barber, who then stabbed him with a pair of art scissors.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747903205206262251_0.jpg","hasPublished":true},{"id":"1747908684691231136","name":"李老师不是你老师","createdDate":"2024-01-18 17:07:59","content":"Some netizens discovered that the direction of the stock market's development had actually been pointed out as early as 2015.","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747908684691231136_0.jpg","videos":"","hasPublished":true},{"id":"1747915742094262393","name":"李老师不是你老师","createdDate":"2024-01-18 17:36:02","content":"On January 18, in Shahe City, Xingtai, Hebei Province, the deposits of Agricultural Bank of China depositors were turned into funds and could not be withdrawn. Dozens of property owners went to the bank branch to defend their rights that day, but were blocked outside by leaders and security guards.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747915742094262393_0.jpg","hasPublished":true},{"id":"1747925036684468646","name":"李老师不是你老师","createdDate":"2024-01-18 18:12:58","content":"January 17, Guiyang, Guizhou. A company required job seekers to pay a 300 yuan medical examination fee before joining the company. After realizing they were cheated, many job seekers went to the company to get the money back. During the negotiation with the company, the staff actually sprayed the job seekers with fire extinguishers.\nOn the 18th, the police said that the case had been handled and the money had been returned to the job seekers. As for the incident of spraying people with fire extinguishers, further investigation will be conducted.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747925036684468646_0.jpg","hasPublished":true},{"id":"1747926579211026882","name":"李老师不是你老师","createdDate":"2024-01-18 18:19:06","content":"On January 17, under the topic \"The national population in 2023 will be 2.08 million less than the previous year\", netizens celebrated and congratulated in a sarcastic way.\nOne netizen mocked: You reap what you sow. It's not that there is no birth, but that there is a regulation of birth. It is a dynamic birth, a dialectical birth, a planned birth, a gradual birth, and an all-round, multi-level, integrated birth.","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747926579211026882_0.jpg,/tweet/image/whyyoutouzhele/2024/01/18/1747926579211026882_1.jpg","videos":"","hasPublished":true},{"id":"1747928318026858651","name":"李老师不是你老师","createdDate":"2024-01-18 18:26:00","content":"January 18, Zhengzhou.\nBecause Henan Taihang Logistics ran away, merchants went to the provincial government to defend their rights and were beaten and driven away.\nIt is reported that on January 15, Henan Taihang Logistics ran away overnight, and at the same time, the goods that were resold before running away, together with employee wages, branch company deposits, etc., fled with the money.\nOn January 16, merchants went to the company headquarters to defend their rights, but found that the building was empty and the person in charge had disappeared. After that, the merchants decided to go to the provincial government to defend their rights, but they were violently treated by the police.\nNetizens said that the logistics company specializes in logistics and transportation between Henan and Shanxi. In 2023, it was awarded the \"Integrity Management Demonstration Enterprise\" of Zhengzhou City. Now the logistics company has run away, and hundreds of merchants have been victimized, and the amount involved is at least tens of millions.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747928318026858651_0.jpg","hasPublished":true},{"id":"1747928499967377762","name":"李老师不是你老师","createdDate":"2024-01-18 18:26:43","content":"https://t.co/4PYXfE3CCU","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747928499967377762_0.jpg,/tweet/image/whyyoutouzhele/2024/01/18/1747928499967377762_1.jpg,/tweet/image/whyyoutouzhele/2024/01/18/1747928499967377762_2.jpg","videos":"","hasPublished":true},{"id":"1747935490710372501","name":"李老师不是你老师","createdDate":"2024-01-18 18:54:30","content":"At present, the topic related to \"Hu Xijin once said that there is gold everywhere below 2,800 points\" has been banned on Weibo.","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747935490710372501_0.jpg","videos":"","hasPublished":true},{"id":"1747943631732769102","name":"李老师不是你老师","createdDate":"2024-01-18 19:26:51","content":"After the founding of the People's Republic of China, no spirits are allowed\nRecently, Henan Yuntaishan Scenic Area invited two COSERs to play \"male and female Daji\" to attract tourists, which triggered widespread discussion on the Internet\nOn the 18th, People's Daily published an editorial criticizing that cultural tourism marketing also needs to stick to principles, bottom lines, and rules.\nAfterwards, the two Cosers publicly apologized online and said that they would no longer perform related activities.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747943631732769102_0.jpg","hasPublished":true},{"id":"1747944701259382964","name":"李老师不是你老师","createdDate":"2024-01-18 19:31:06","content":"This move has caused widespread dissatisfaction among netizens. They all said that the tourism industry in various places has been booming recently, and there is a lot of fun online and offline. The actors' performances and interactions are very measured. Who is it that is not happy and can't stand others doing well? Some netizens also suggested that People's Daily should change its name and not let the people take the blame.","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747944701259382964_0.jpg","videos":"","hasPublished":true},{"id":"1747956731802521909","name":"李老师不是你老师","createdDate":"2024-01-18 20:18:54","content":"Netizen contribution\nOn December 28, the Changsha Education Bureau organized a meeting of all educational training institutions in the city, and without any written documents, required each institution to pay a \"risk deposit\" of 30,000 yuan.\nSince the meeting, they have been constantly urging","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747956731802521909_0.jpg,/tweet/image/whyyoutouzhele/2024/01/18/1747956731802521909_1.jpg","videos":"","hasPublished":true},{"id":"1747961093488513337","name":"李老师不是你老师","createdDate":"2024-01-18 20:36:14","content":"On January 18, the media reported again that a courier in Hangzhou earned 1.08 million in three years.\nAccording to him, he has bought a house in his hometown through his own efforts, bought himself a car, and brought his children to Hangzhou to study.\nCurrently, he is mainly responsible for the express packaging and delivery of a clothing wholesale market in Hangzhou, and has found two people to help. Li Jianfei said: There are many people in the company who earn more than him","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747961093488513337_0.jpg","hasPublished":true},{"id":"1747964838641348691","name":"李老师不是你老师","createdDate":"2024-01-18 20:51:07","content":"Following the unfinished buildings, unfinished cars are also here\nOn January 18, Lincun Industrial Park, Tangxia Town, Dongguan, Guangdong. Yongao Group Automobile Dealer Group went bankrupt, and the buildings were empty overnight.\nIt is reported that Yongao Group, as one of the top 100 dealers in China, has more than 80 4S stores. Its high-end brands include Mercedes-Benz, Audi, Volvo, as well as mid- and low-end brands such as Lynk & Co., Geely and other commercial vehicles.\nIt is said that the reason for the store's closure is the broken capital chain. At present, the vehicles in the store garage and showroom have been towed away overnight, and the employees' wages have not been paid. Some car owners paid deposits but did not get the car, and some car owners picked up the car but did not get the license plate without the certificate of conformity, and the supplier's payment has not been settled.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747964838641348691_0.jpg","hasPublished":true},{"id":"1747966656519733281","name":"李老师不是你老师","createdDate":"2024-01-18 20:58:21","content":"Netizens added","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747966656519733281_0.jpg","videos":"","hasPublished":true},{"id":"1747970087749931345","name":"李老师不是你老师","createdDate":"2024-01-18 21:11:59","content":"On the evening of January 17, Shanghai. The property management of Tianhe Hubin Home Community arbitrarily raised the parking price during the validity period of the contract. If the owner did not pay, his private car could not enter the community garage, which caused dissatisfaction among the owners. That night, the owners gathered in the community to sing the national anthem to defend their rights. During the period, there was a conflict with the police, and some owners were forcibly taken away by the police. At the scene (1 minute 23 seconds), the owner loudly questioned the police who came to maintain stability, is it the people who feed the government or the government that feeds the people?","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747970087749931345_0.jpg","hasPublished":true},{"id":"1747985677487075400","name":"李老师不是你老师","createdDate":"2024-01-18 22:13:56","content":"January 17, Guangzhou, Guangdong. Hongtian International Hotel Supplies Procurement Center owed wages to migrant workers. After repeated attempts to recover the wages failed, the workers had no choice but to gather outside the company to demand their wages.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747985677487075400_0.jpg","hasPublished":true},{"id":"1747985808374534625","name":"李老师不是你老师","createdDate":"2024-01-18 22:14:27","content":"January 17, Xiamen, Fujian. Dozens of migrant workers stood on the edge of the roof and wanted to jump off the building to demand their wages. Firefighters laid air cushions downstairs.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/18/1747985808374534625_0.jpg","hasPublished":true},{"id":"1747987556032029114","name":"李老师不是你老师","createdDate":"2024-01-18 22:21:24","content":"On January 17, Jiangsu Kunshan Fugang Electronics announced that it had decided to suspend operations and take a six-month holiday starting on January 19, ending on July 31.","images":"/tweet/image/whyyoutouzhele/2024/01/18/1747987556032029114_0.jpg","videos":"","hasPublished":true}]