[
  {
    "id": "1758420391020601443",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 17:17:45",
    "content": "Later, some netizens added that the owner of the car had committed a murder, and the police set up a checkpoint to intercept him, and then the scene in the video appeared.",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758421283774087369",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 17:21:18",
    "content": "On February 15, CCTV released a news report about a shooting at the Super Bowl parade in Kansas City, USA, which left 1 dead and 22 injured. However, many netizens in the comment section were asking what happened in Ju County, Rizhao.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/16/1758421283774087369_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1758426476762878366",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 17:41:56",
    "content": "Netizen contribution\nOn February 16, the train from Fuzhou Station to Beijing arranged two rows of security inspectors to be responsible for secondary security checks",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/16/1758426476762878366_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1758429500499497037",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 17:53:57",
    "content": "\"The atmosphere is here\"\nAfter two mainland fishermen drowned in Kinmen waters when they were driven away by the Taiwan Coast Guard, many netizens flooded into the Eastern Theater Command's Weibo comment section on February 15, accusing the Eastern Theater Command of not taking action and \"playing grandson\", saying, \"What's the point of having you?\"\nCurrently, the Eastern Theater Command has deleted the Weibo post.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/16/1758429500499497037_0.jpg,/tweet/image/whyyoutouzhele/2024/02/16/1758429500499497037_1.jpg,/tweet/image/whyyoutouzhele/2024/02/16/1758429500499497037_2.jpg,/tweet/image/whyyoutouzhele/2024/02/16/1758429500499497037_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758433051716026482",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 18:08:04",
    "content": "Last week, at a bar in the San Francisco Bay Area, people held up white papers during the performance of \"They\" and \"The Square\".",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/16/1758433051716026482_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1758439113772966211",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 18:32:09",
    "content": "On February 15, in Changchun, Jilin, a man posted a video claiming to be the owner of the developer of the unfinished building \"Shenghai Cuihu Garden\". In the video, he said in tears that it was not his fault that the building was unfinished, as it had been completed in 2016. It was the local evil forces who extorted 500 million yuan that caused the building to be unfinished.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/16/1758439113772966211_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1758441171217449212",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 18:40:20",
    "content": "It is understood that the community has been unfinished for more than ten years. According to an insider, the community is located at Shenghai Cuihu Garden, No. 881, Qianjin Street. The owners have not moved into the houses they bought because the developer mortgaged the houses that had already been sold to the \"micro-loan\" company, which led to the seizure of the houses. Moreover, it is unknown who the houses that have been paid for belong to. The owners bought small apartments at a unit price of more than 5,000 yuan at the beginning of the purchase, but the actual house area is 20 to 30 square meters more. The extra area requires the owners to pay more than 9,000 yuan per square meter. Some owners choose to withdraw from the house, but they cannot get a refund. As early as 2016, the \"Watching the City\" column of Jilin TV's Urban Channel reported this incident. The owners told reporters that the developer's houses were unfinished, there was no water or electricity, and one house was sold to multiple people.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/16/1758441171217449212_0.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/16/1758441171217449212_0.jpg,/tweet/video/whyyoutouzhele/2024/02/16/1758441171217449212_1.jpg,/tweet/video/whyyoutouzhele/2024/02/16/1758441171217449212_2.jpg",
    "hasPublished": true
  },
  {
    "id": "1758474361265086781",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 20:52:13",
    "content": "On the afternoon of February 16, a shuttle bus to the North Scenic Area of Changbai Mountain in Jilin Province overturned after hitting an oncoming car due to the driver's fatigue. According to tourists at the scene, the ambulance arrived about 25 minutes late. Two people have died in the accident so far, and the scene has been covered with construction cloth.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/16/1758474361265086781_0.jpg,/tweet/image/whyyoutouzhele/2024/02/16/1758474361265086781_1.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/16/1758474361265086781_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1758494279201112309",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 22:11:22",
    "content": "On February 16, the media reported that Lei Qian, chairperson of the All-China Women's Federation of Taiwan, praised the mainland's full-process democracy in a Taiwanese program, saying that democracy is not just a one-person-one-vote election, and that the whole world needs to think carefully about it. \nThis triggered 40,000 netizens to collectively express their sarcasm in the comment section.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/16/1758494279201112309_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1758494931339935921",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 22:13:57",
    "content": "Regarding whole-process democracy\nCompared to Director Lei’s foggy view\nPerhaps the actual experience of the Chinese people is more convincing\n",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758500242712891399",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 22:35:03",
    "content": "Netizens added",
    "images": "/tweet/image/whyyoutouzhele/2024/02/16/1758500242712891399_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758502336681431059",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 22:43:23",
    "content": "On February 15, in Horqin County, Inner Mongolia Autonomous Region, the Inner Mongolia Police Vocational College new campus construction project owed workers wages. Workers gathered outside the Police Vocational College with banners demanding their wages.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/16/1758502336681431059_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1758507178598486199",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-16 23:02:37",
    "content": "On February 15, the family members continued to protest outside the mall. During the protest, one of them climbed onto the roof of a police car and tried to jump out, but was stopped by a nearby police officer.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/16/1758507178598486199_0.jpg",
    "hasPublished": true
  }
]