[{"id":"1841883896893337728","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-04 00:51:56","content":"Short plays sing the main theme. On September 29, the Network Audiovisual Department of the State Administration of Radio, Film and Television held a promotion meeting for key online audiovisual programs during the National Day. 29 excellent short micro-plays such as \"I Open a Supermarket on the Long March\", \"Dali Village Superman\" and \"Go South\" were broadcast. These short micro-plays are rich in content, diverse in subject matter and diverse in genre. For example, \"I Open a Supermarket on the Long March\" tells the story of the protagonist Su Meimei delivering supplies to the Red Army during the Long March and witnessing the Red Army soldiers fighting bloody battles time and time again from a cross-temporal perspective, conveying the feelings of home and country. \"Return to the Yongle Encyclopedia\" revolves around the story of the ancient book restorer and traces the creation process of the classics. \"Dali Village Superman\" takes \"Village Superman\" as the background and shows the characters' beautiful feelings for their hometown.","images":"/tweet/image/whyyoutouzhele/2024/10/04/1841883896893337728_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841883896893337728_1.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841883896893337728_2.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841883896893337728_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1841884455306137712","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-04 00:54:09","content":"\"I Open a Supermarket on the Long March\" swept the entire network, with over 10 million views and dominating the charts during the National Day holiday. The single episode had over 10 million views in 7 hours, and the full-length film had nearly 20 million views in 24 hours. The topic volume exceeded 200 million in 24 hours, dominating the charts of many social media.","images":"/tweet/image/whyyoutouzhele/2024/10/04/1841884455306137712_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841884455306137712_1.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841884455306137712_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1841887096450994547","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-04 01:04:39","content":"On October 3, a netizen submitted a post saying that the high school holidays in Liaocheng, Shandong Province, were only two and a half days. Although the Education Bureau stipulated that students could choose to study on their own voluntarily, in reality, all high schools forced students to attend classes on campus. Someone called 12345 to complain, but the Education Bureau only reminded the principals in the group chat and did not take any practical measures.","images":"/tweet/image/whyyoutouzhele/2024/10/04/1841887096450994547_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841887096450994547_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1841889306702487703","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-04 01:13:26","content":"According to Vietnamese state media, at least 10 Vietnamese fishermen were injured when their boat was attacked by two foreign ships while fishing near the Paracel Islands (Xisha Islands) in the South China Sea, which are claimed by both China and Vietnam, on September 29. In response, Vietnamese Foreign Ministry spokesperson Pham Thu Hang expressed \"extreme concern and dissatisfaction\" on October 2, and said that \"we firmly oppose the Chinese law enforcement forces' brutal actions against Vietnamese fishermen and fishing boats operating in the waters of the Vietnamese Hoang Sa Islands, causing injuries to Vietnamese fishermen, endangering their lives, and damaging their property.\"","images":"/tweet/image/whyyoutouzhele/2024/10/04/1841889306702487703_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841889306702487703_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1841978143642406996","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-04 07:06:26","content":"When Lee Meng-ju interviewed human rights lawyer Yu Wensheng in 2023, Yu Wensheng disclosed to him the torture he experienced in prison\n@Morrisonlee2020 @the29principles","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/04/1841978143642406996_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1842120593430425754","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-04 16:32:29","content":"October 3 (Released) A man greeted a Japanese passerby on the street in Japan, but the next second he insulted the other person in Chinese.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/04/1842120593430425754_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1842123527534919702","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-04 16:44:08","content":"September 30, Hubei. A netizen posted that she received a \"Spiritual Hubei\" gratitude card for her participation in aiding Hubei during the epidemic. The card allows free admission to A-level tourist attractions in Hubei Province, and the card is valid for life. However, the netizen said that his gratitude card could not be used, and the system showed \"the user card has been blocked or not activated\"","images":"/tweet/image/whyyoutouzhele/2024/10/04/1842123527534919702_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1842123527534919702_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1842129567047434354","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-04 17:08:08","content":"During the National Day holiday, a large number of videos with titles such as \"Japanese dogs are not allowed to eat for seven days during the National Day\" and \"Little Japanese, your dad is 75 years old\" appeared on social platforms.","images":"/tweet/image/whyyoutouzhele/2024/10/04/1842129567047434354_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/04/1842129567047434354_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]