[
  {
    "id": "1841883896893337728",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 00:51:56",
    "content": "Short plays sing the main theme. On September 29, the Network Audiovisual Department of the State Administration of Radio, Film and Television held a promotion meeting for key online audiovisual programs during the National Day. 29 excellent short micro-plays such as \"I Open a Supermarket on the Long March\", \"Dali Village Superman\" and \"Go South\" were broadcast. These short micro-plays are rich in content, diverse in subject matter and diverse in genre. For example, \"I Open a Supermarket on the Long March\" tells the story of the protagonist Su Meimei delivering supplies to the Red Army during the Long March and witnessing the Red Army soldiers fighting bloody battles time and time again from a cross-temporal perspective, conveying the feelings of home and country. \"Return to the Yongle Encyclopedia\" revolves around the story of the ancient book restorer and traces the creation process of the classics. \"Dali Village Superman\" takes \"Village Superman\" as the background and shows the characters' beautiful feelings for their hometown.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1841883896893337728_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841883896893337728_1.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841883896893337728_2.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841883896893337728_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1841884455306137712",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 00:54:09",
    "content": "\"I Open a Supermarket on the Long March\" swept the entire network, with over 10 million views and dominating the charts during the National Day holiday. The single episode had over 10 million views in 7 hours, and the full-length film had nearly 20 million views in 24 hours. The topic volume exceeded 200 million in 24 hours, dominating the charts of many social media.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1841884455306137712_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841884455306137712_1.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841884455306137712_2.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1841887096450994547",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 01:04:39",
    "content": "On October 3, a netizen submitted a post saying that the high school holidays in Liaocheng, Shandong Province, were only two and a half days. Although the Education Bureau stipulated that students could choose to study on their own voluntarily, in reality, all high schools forced students to attend classes on campus. Someone called 12345 to complain, but the Education Bureau only reminded the principals in the group chat and did not take any practical measures.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1841887096450994547_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841887096450994547_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1841889306702487703",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 01:13:26",
    "content": "According to Vietnamese state media, at least 10 Vietnamese fishermen were injured when their boat was attacked by two foreign ships while fishing near the Paracel Islands (Xisha Islands) in the South China Sea, which are claimed by both China and Vietnam, on September 29. In response, Vietnamese Foreign Ministry spokesperson Pham Thu Hang expressed \"extreme concern and dissatisfaction\" on October 2, and said that \"we firmly oppose the Chinese law enforcement forces' brutal actions against Vietnamese fishermen and fishing boats operating in the waters of the Vietnamese Hoang Sa Islands, causing injuries to Vietnamese fishermen, endangering their lives, and damaging their property.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1841889306702487703_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1841889306702487703_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1841978143642406996",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 07:06:26",
    "content": "When Lee Meng-ju interviewed human rights lawyer Yu Wensheng in 2023, Yu Wensheng disclosed to him the torture he experienced in prison\n@Morrisonlee2020 @the29principles",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1841978143642406996_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842120593430425754",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 16:32:29",
    "content": "October 3 (Released) A man greeted a Japanese passerby on the street in Japan, but the next second he insulted the other person in Chinese.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1842120593430425754_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842123527534919702",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 16:44:08",
    "content": "September 30, Hubei. A netizen posted that she received a \"Spiritual Hubei\" gratitude card for her participation in aiding Hubei during the epidemic. The card allows free admission to A-level tourist attractions in Hubei Province, and the card is valid for life. However, the netizen said that his gratitude card could not be used, and the system showed \"the user card has been blocked or not activated\"",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1842123527534919702_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1842123527534919702_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842129567047434354",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 17:08:08",
    "content": "During the National Day holiday, a large number of videos with titles such as \"Japanese dogs are not allowed to eat for seven days during the National Day\" and \"Little Japanese, your dad is 75 years old\" appeared on social platforms.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1842129567047434354_0.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1842129567047434354_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842134173949301023",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 17:26:26",
    "content": "Recently, several Chinese people in Laos revealed that the Lao police have recently arrested many Chinese who came here to find wives. Local girls will cooperate with the police, lure Chinese men to live with them, and then contact the police to say that they are minors. The police will arrest the men on the grounds of non-cohabitation, and they will only be released after paying a huge fine.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1842134173949301023_0.jpg,/tweet/video/whyyoutouzhele/2024/10/04/1842134173949301023_1.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842154113704050752",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 18:45:40",
    "content": "On October 3, Japanese media reported: Can you make a lot of money by investing in Chinese Pu'er tea? Recently, many Japanese men have been scammed by beautiful women who contacted the victim through the LINE chat software. After establishing a close relationship with the victim, they began to sell him Pu'er tea. However, the Pu'er tea that the victim spent tens of millions of yen to buy turned out to be ordinary cheap goods.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1842154113704050752_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842155237320315099",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 18:50:08",
    "content": "According to a report on October 3, three Chinese people flew from Hong Kong to Singapore and lied at many local subway stations that they could only pay via WeChat and could not eat at nearby Chinese restaurants. They then \"borrowed money\" from the public and defrauded more than 2,600 Singapore dollars. The Shin Min Daily News reported that the three defendants were finally arrested on August 15, the day before they left Singapore. Two of the female defendants were sentenced to six months in prison; the prosecution requested an eight-month sentence for the male defendant.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1842155237320315099_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1842155237320315099_1.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1842155237320315099_2.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842159131832320192",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 19:05:37",
    "content": "October 3, Shandong. A parent reported that his child was in the third year of junior high school this year, and he used 100 sheets of paper just to print the test papers for the holiday. Of course, this was just the test papers, not the exercise books. The parent said, \"Teacher, we have a seven-day holiday, not a seven-year holiday.\" After searching, it was found that many netizens and parents were posting about too much holiday homework.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1842159131832320192_0.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1842159131832320192_1.jpg,/tweet/image/whyyoutouzhele/2024/10/04/1842159131832320192_2.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842162999395811647",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 19:20:59",
    "content": "On October 1, Linyi, Shandong. Blogger \"Market Life\" interviewed a girl who was selling sesame cakes on the roadside. The girl said she was 19 years old and dropped out of school early to help relieve the pressure on her family. She currently works 12 hours a day. The girl's mother said that there are two daughters in the family, one of whom is disabled. She feels very distressed, but there is nothing she can do. As long as she can raise her daughter to adulthood, it's fine.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1842162999395811647_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842178037204582471",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 20:20:44",
    "content": "October 2, Thailand. A netizen posted that he and his friend wrote \"Long Live the People's Republic of China\" on a message board at a tourist attraction in Chiang Mai, and then several Taiwanese people came and wrote \"Long Live the Republic of China\" on the message board. Then another tourist crossed out the words \"Long Live the Republic of China\" on the message board and added \"only one China\" under \"People's Republic of China\".",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1842178037204582471_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842180096658219355",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 20:28:55",
    "content": "October 3 (Released) A blogger counted the number of foreign companies that withdrew their investment from China in the past year.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1842180096658219355_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842198997622313443",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 21:44:02",
    "content": "On October 3, Regina Ip Lau Suk-yee, chairwoman of the pro-establishment New People's Party in Hong Kong, reposted an article from Time magazine on X, captioning that Israel may win the war between Hamas and Hezbollah, but will lose the country. She also suggested that if Israelis want to live and raise their children in a safe place, they can consider Hong Kong. \"You can live happily and joyfully in our city.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1842198997622313443_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842203738821587026",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 22:02:52",
    "content": "October 4, Beijing. A blogger posted a video saying that Fang Bing, a professor at the National Defense University, had previously claimed that he would sacrifice 200 cities. If he wanted to play with the United States, the worst that could happen would be that we would all return to the Stone Age. However, there are only more than 330 prefecture-level cities in my country, and he sacrificed 2/3 of them with a stroke of his pen. Are he and his family on the sacrifice list he drew up? Are we all his victims?",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1842203738821587026_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842217012757668100",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 22:55:37",
    "content": "October 1, Shenzhen, Guangdong. Vanke Future Light real estate project was delayed in delivery, and owners gathered at the sales office to defend their rights, shouting \"return the money\"\nOctober 1, Yichun, Jiangxi. Donghua Academy No. 1 real estate project was unfinished, and owners held banners to defend their rights, and had a scuffle with the police.\nOctober 1, Hezhou, Guangxi. The Wanyou Village Committee of Wanggao Town selfishly sold the village's collective land for mining. The villagers stopped the construction site and had a dispute with the police who were defending their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/04/1842217012757668100_0.jpg,/tweet/video/whyyoutouzhele/2024/10/04/1842217012757668100_1.jpg,/tweet/video/whyyoutouzhele/2024/10/04/1842217012757668100_2.jpg,/tweet/video/whyyoutouzhele/2024/10/04/1842217012757668100_3.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842221365686071470",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-04 23:12:55",
    "content": "Under the accusations and abuse from many netizens, Luo Xiang deleted the video.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/04/1842221365686071470_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]