[
  {
    "id": "1881018822322475206",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-20 00:40:09",
    "content": "J-20 chief designer Yang Wei and general manager Hao Zhaoping were dismissed, and the management of China Aviation Industry Corporation continued to adjust.\nAccording to Caixin.com, the leadership team column of AVIC's official website changed on Saturday night, and Hao Zhaoping and Yang Wei's resumes were removed.\nPublic information shows that Yang Wei is 62 years old this year. At the age of 37, he became China's youngest aircraft chief designer. In 2018, he became the deputy general manager of AVIC. He also served as the chief designer of China's fifth-generation fighter J-20.\nHao Zhaoping is 57 years old this year. He has worked in the aerospace industry system for many years since 1994 and was promoted to general manager in 2022.\nPreviously, Tan Ruisong, the former chairman of AVIC, was dismissed in March 2023. Later, he was investigated by the official notification in August last year for suspected violations of discipline and law.",
    "images": "/tweet/image/whyyoutouzhele/2025/01/20/1881018822322475206_0.jpg,/tweet/image/whyyoutouzhele/2025/01/20/1881018822322475206_1.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 89,
    "replies": 23,
    "retweets": 7,
    "views": 20649,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1881040230645739631",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-20 02:05:13",
    "content": "On January 20, TikTok issued a statement saying: TikTok is resuming service in accordance with the agreement reached with our service providers. We thank President Trump for providing the necessary clarity and assurances to our service providers to ensure that they will not face any penalties when providing TikTok services to more than 170 million American users, while also allowing more than 7 million small businesses to prosper.\nThis is a strong defense of the First Amendment and a firm opposition to arbitrary censorship. We will work with President Trump to seek a long-term solution to ensure that TikTok can continue to stay in the United States.",
    "images": "/tweet/image/whyyoutouzhele/2025/01/20/1881040230645739631_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 460,
    "replies": 158,
    "retweets": 47,
    "views": 269376,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1881089580214214729",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-20 05:21:19",
    "content": "The chairman of the U.S. House of Representatives' Ad Hoc Committee on China wrote to the Thai ambassador to the United States, urging the Thai government not to repatriate Uyghurs who have fled China and are in its custody, as they are likely to be sent to concentration camps; and stressed that those who assist the Chinese Communist Party in trampling on human rights should face U.S. sanctions.",
    "images": "",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 195,
    "replies": 39,
    "retweets": 26,
    "views": 63796,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]