[
  {
    "id": "1873401902811283698",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 00:13:14",
    "content": "A Boeing 737 passenger plane of Jeju Air in South Korea crashed, killing 179 people.\nIt is said on the Internet that one of the victims sent a message to his mother before the plane crashed: \"Mom\" \"She said that the plane seemed to be stuck by a bird and could not land, so she asked me to call\"\n\"Because you didn't answer, I left a message, Mom, I love you\"\n",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873401902811283698_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873401902811283698_1.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 182,
    "replies": 38,
    "retweets": 11,
    "views": 55298,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873405360377315657",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 00:26:58",
    "content": "On December 29, Xinhua News Agency selected the top ten domestic news in 2024: \nArticle 7: Adhere to the development of full-process people's democracy and better play the superiority of the political system.",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873405360377315657_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 64,
    "replies": 23,
    "retweets": 7,
    "views": 21229,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873411929978581362",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 00:53:05",
    "content": "December 29, Dongguan, Guangdong. A man came to a park and was stopped by security guards. The security guards said that the fenced area was all government units, and you can be outside but not inside.\nNetizens responded, \"Is this the Royal Garden?\" \"Find a way to fence off the sun\"",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873411929978581362_0.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/12/30/1873411929978581362_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 58,
    "replies": 23,
    "retweets": 4,
    "views": 10437,
    "originVideos": "https://video.twimg.com/ext_tw_video/1873411085774278656/pu/vid/avc1/720x1280/Nx0Wrp1Q724LS16H.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873418774197735473",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 01:20:16",
    "content": "A mother in her 50s successfully fought cancer for more than a year. After her health finally improved, she went on a trip, but she didn't expect to embark on a road of no return....\nThe screenshot is the last conversation between Kim's brother and sister (22 years old and 15 years old) and their mother. The mother sent a text message to her son on the 27th, the second day after she went on a trip to Bangkok with her friends.\nThe childish brother and sister held hands and kept staring at the TV broadcasting the accident news at the airport. The first floor of the airport building was filled with screams and cries of the bereaved, and two funeral cars were parked in the parking lot in front of the building.\nThe brother and sister were staying at their home in Gwangju that day. When they heard the news of the accident, they hurried from Gwangju to Muan Airport. The brother and sister said, \"Because I don't watch the news on weekdays, I didn't know the news. I learned about it when my mother's friend contacted me around 12 noon.\" He cried and said, \"I took a relative's car to the airport.\"\nThe mother of the brother and sister was in her early 50s and had been fighting stomach cancer for more than a year...",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873418774197735473_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873418774197735473_1.jpg,",
    "videos": "",
    "isReply": true,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 134,
    "replies": 11,
    "retweets": 8,
    "views": 43841,
    "originVideos": "",
    "hasFullContentTranslated": false,
    "fullContent": "一位50多岁的母亲抗癌成功一年多，身体终于好转后去旅行，没想到踏上了一条不归路....\n   截图是金某兄妹（22岁·15岁）与母亲的最后一次对话。母亲在和朋友去曼谷旅行的第二天27日给儿子发了短信。\n    还很孩子气的兄妹们牵着双手，一直盯着在机场播放事故消息的电视。机场大楼1楼充满了遗属的尖叫声和哭声，大楼前的停车场已经停了两辆出殡车。\n    兄妹俩当天在光州的家里待着，得知事故消息，急忙从光州赶到务安机场。兄妹说：“因为平时不看新闻，所以不知道消息，中午12点左右妈妈的朋友联系了我才得知。”他哭着说：“坐了亲戚的车来到了机场。”\n    兄妹的母亲在50岁出头，因胃癌进行了1年多的抗癌生活，最近健康状况好转后，才计划了这次旅行。\n    兄妹说：“母亲因抗癌生活辛苦了很长一段时间，这次旅行社推出了'圣诞曼谷旅行套餐'，久违地才和朋友们一起去曼谷玩。旅行中也时不时会联系问好，突然传来的事故消息让人难以置信”",
    "hasPublished": false
  }
]