[
  {
    "id": "1873401902811283698",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 00:13:14",
    "content": "A Boeing 737 passenger plane of Jeju Air in South Korea crashed, killing 179 people.\nIt is said on the Internet that one of the victims sent a message to his mother before the plane crashed: \"Mom\" \"She said that the plane seemed to be stuck by a bird and could not land, so she asked me to call\"\n\"Because you didn't answer, I left a message, Mom, I love you\"\n",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873401902811283698_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873401902811283698_1.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 182,
    "replies": 38,
    "retweets": 11,
    "views": 55298,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873405360377315657",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 00:26:58",
    "content": "On December 29, Xinhua News Agency selected the top ten domestic news in 2024: \nArticle 7: Adhere to the development of full-process people's democracy and better play the superiority of the political system.",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873405360377315657_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 64,
    "replies": 23,
    "retweets": 7,
    "views": 21229,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873411929978581362",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 00:53:05",
    "content": "December 29, Dongguan, Guangdong. A man came to a park and was stopped by security guards. The security guards said that the fenced area was all government units, and you can be outside but not inside.\nNetizens responded, \"Is this the Royal Garden?\" \"Find a way to fence off the sun\"",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873411929978581362_0.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/12/30/1873411929978581362_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 58,
    "replies": 23,
    "retweets": 4,
    "views": 10437,
    "originVideos": "https://video.twimg.com/ext_tw_video/1873411085774278656/pu/vid/avc1/720x1280/Nx0Wrp1Q724LS16H.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873418774197735473",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 01:20:16",
    "content": "A mother in her 50s successfully fought cancer for more than a year. After her health finally improved, she went on a trip, but she didn't expect to embark on a road of no return....\nThe screenshot is the last conversation between Kim's brother and sister (22 years old and 15 years old) and their mother. The mother sent a text message to her son on the 27th, the second day after she went on a trip to Bangkok with her friends.\nThe childish brother and sister held hands and kept staring at the TV broadcasting the accident news at the airport. The first floor of the airport building was filled with screams and cries of the bereaved, and two funeral cars were parked in the parking lot in front of the building.\nThe brother and sister were staying at their home in Gwangju that day. When they heard the news of the accident, they hurried from Gwangju to Muan Airport. The brother and sister said, \"Because I don't watch the news on weekdays, I didn't know the news. I learned about it when my mother's friend contacted me around 12 noon.\" He cried and said, \"I took a relative's car to the airport.\"\nThe mother of the brother and sister was in her early 50s and had been fighting stomach cancer for more than a year...",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873418774197735473_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873418774197735473_1.jpg,",
    "videos": "",
    "isReply": true,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 134,
    "replies": 11,
    "retweets": 8,
    "views": 43841,
    "originVideos": "",
    "hasFullContentTranslated": false,
    "fullContent": "一位50多岁的母亲抗癌成功一年多，身体终于好转后去旅行，没想到踏上了一条不归路....\n   截图是金某兄妹（22岁·15岁）与母亲的最后一次对话。母亲在和朋友去曼谷旅行的第二天27日给儿子发了短信。\n    还很孩子气的兄妹们牵着双手，一直盯着在机场播放事故消息的电视。机场大楼1楼充满了遗属的尖叫声和哭声，大楼前的停车场已经停了两辆出殡车。\n    兄妹俩当天在光州的家里待着，得知事故消息，急忙从光州赶到务安机场。兄妹说：“因为平时不看新闻，所以不知道消息，中午12点左右妈妈的朋友联系了我才得知。”他哭着说：“坐了亲戚的车来到了机场。”\n    兄妹的母亲在50岁出头，因胃癌进行了1年多的抗癌生活，最近健康状况好转后，才计划了这次旅行。\n    兄妹说：“母亲因抗癌生活辛苦了很长一段时间，这次旅行社推出了'圣诞曼谷旅行套餐'，久违地才和朋友们一起去曼谷玩。旅行中也时不时会联系问好，突然传来的事故消息让人难以置信”",
    "hasPublished": false
  },
  {
    "id": "1873569087198261340",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 11:17:34",
    "content": "A blogger in Jianshan Village, Xiangcheng Town, Zoucheng City, Shandong Province, posted a video exposing the illegal sand mining in the area. He was followed by an unknown vehicle during the investigation.\nDozens of trucks were involved in the illegal sand mining, crushing the villagers' asphalt roads and cement village roads.\nNetizens in the comment area admired the blogger's courage and asked him to pay attention to safety.\nInformed netizens revealed that the town government leadership team used various projects to privately dig and trample on basic farmland for several years, stealing sand and stones and making a fortune of more than 100 million yuan.",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873569087198261340_0.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/12/30/1873569087198261340_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 163,
    "replies": 18,
    "retweets": 22,
    "views": 38758,
    "originVideos": "https://video.twimg.com/ext_tw_video/1873566367666130944/pu/vid/avc1/480x848/A0ljUyIiHsCoBrSD.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873570996374192348",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 11:25:09",
    "content": "Recently, after the incident of Li Yixue being diagnosed with mental illness and missing in Nanchang, Jiangxi, many people across the country began to boycott Nanchang. Many netizens posted videos appealing that everyone should not do business with Nanchang, not buy goods from Jiangxi, not receive express delivery from Jiangxi, etc. On various platforms, everyone is still trying their best to speak up for Li Yixue, risking being blocked and being teased.",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873570996374192348_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873570996374192348_1.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873570996374192348_2.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 505,
    "replies": 59,
    "retweets": 68,
    "views": 73434,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873586092685037974",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 12:25:08",
    "content": "Wuwei, Gansu: Parents were kicked out of the group for questioning the late assignment of homework. Follow-up:\nUnder media attention, the parent rejoined the group, and the English teacher sent a \"warm welcome\" emoticon. A parent took the initiative to speak on behalf of the parents involved and said: It's okay, I understand the teacher\n\"The head teacher and the English teacher apologized. The school held a meeting to emphasize that WeChat will not allow assignments in the future, and all assignments will be assigned on the blackboard on time\"\nOnline comment: Assigning homework so late will affect the birth rate of newborns",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873586092685037974_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873586092685037974_1.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873586092685037974_2.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873586092685037974_3.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 82,
    "replies": 21,
    "retweets": 4,
    "views": 26352,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873586973736386593",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 12:28:38",
    "content": "Follow-up of the school cafeteria in Benxi, Liaoning, feeding students with leftovers from the trash can:\nThe State Council Food Safety Office, together with the Ministry of Education and the State Administration for Market Regulation, summoned the main person in charge of the People's Government of Benxi City, Liaoning Province on the 27th, but no punishment was imposed\nThe summons required that Benxi City must improve its political stance, always tighten the string of food safety, and effectively enhance the sense of responsibility, urgency and mission of doing a good job in the region;\nWe must take effective measures to further consolidate the responsibilities of all parties for campus food safety, re-check risks and hidden dangers, and re-attack law enforcement and case handling, and do a good job in problem rectification and implementation; We must insist on learning from one case and applying it to other cases, not only \"immediately change\", but also \"long-term\", promote the improvement of campus food safety system, and effectively ensure the food safety of students in school.",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873586973736386593_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 62,
    "replies": 14,
    "retweets": 12,
    "views": 26073,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873589880355483865",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 12:40:11",
    "content": "On December 29, CCTV exposed that fake cashmere sweaters were openly sold in the live broadcast room, and they were not afraid of reporting and banning their accounts.\nNot only are the ingredients proportions falsely marked, but wool or other animal fibers are even sold as cashmere. In the live broadcast room, a raccoon cashmere product was promoted as a 100% cashmere cashmere sweater\nThere are also sweaters that are obviously wool sweaters, but are labeled as \"pure cashmere\".\nIf you sell counterfeit goods in a live broadcast room, you are not afraid of being reported or banned. After the account is banned, you will immediately open a new account and sell live broadcasts day and night.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/12/30/1873589880355483865_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 74,
    "replies": 21,
    "retweets": 8,
    "views": 19291,
    "originVideos": "https://video.twimg.com/ext_tw_video/1873588875589013504/pu/vid/avc1/1280x720/e1utu7Klc2Y7lyoY.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873591220850872706",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 12:45:31",
    "content": "On December 29, Xinhua News Agency selected the top ten news of the year, including:\nHeadline of the year: The whole party carried out party discipline study and education in a solid manner, and promoted the in-depth development of comprehensive and strict party governance\n5. Head of state diplomacy wrote a magnificent new chapter\n6. The gradual delay of retirement reform plan was introduced to promote the full utilization of human resources\n7. Adhere to the development of the whole process of people's democracy and better play the superiority of the political system\n8. The Party Central Committee deployed a package of incremental policies, the economy rebounded and the comprehensive national strength was enhanced",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873591220850872706_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873591220850872706_1.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873591220850872706_2.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873591220850872706_3.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 43,
    "replies": 20,
    "retweets": 1,
    "views": 10001,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873592845468385771",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 12:51:58",
    "content": "On December 29, rows of isolation columns were erected outside a subway station in Tianhe District, Guangzhou to prevent \"electric chickens\" from illegally parking. The density was like \"plum blossom piles\". Some citizens felt that it affected the city appearance, while others said that although it was not good-looking, it did improve the situation where the subway entrance was blocked by motorcycles. Citizens said: The most important thing is to solve the problem of where to park, otherwise they will still park illegally somewhere else. Netizens said: It is inconvenient for wheelchairs and baby strollers to travel",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/12/30/1873592845468385771_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 51,
    "replies": 21,
    "retweets": 3,
    "views": 12197,
    "originVideos": "https://video.twimg.com/ext_tw_video/1873591819105337344/pu/vid/avc1/360x640/AmDDFOjQaa2_vdmi.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873595048476180858",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 13:00:43",
    "content": "Recently, Langfang, Hebei Province invented the \"climate loan\", which is suspected to be used to solve the problem of corporate reconstruction caused by the flood in Beijing in July 23, when the flood was released to Hebei to \"protect Beijing and Xiong'an\".\nNetizens in the comment area mocked: \"Is there a loan within a loan?\" \"Is there a loan for the next life?\" \"Is there a gift loan?\"",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873595048476180858_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873595048476180858_1.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873595048476180858_2.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873595048476180858_3.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 48,
    "replies": 12,
    "retweets": 2,
    "views": 4939,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873597111411036334",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 13:08:55",
    "content": "On December 29, former US President Jimmy Carter died at the age of 100. On January 1, 1979, while in office, he bypassed Congress and severed diplomatic relations with the Republic of China and established diplomatic relations with the People's Republic of China.",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873597111411036334_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 9,
    "replies": 6,
    "retweets": 0,
    "views": 1016,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873598949896118552",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 13:16:14",
    "content": "The first-instance verdict of the case of the murder of junior high school students in Handan, Hebei Province was announced: three people were sentenced to life imprisonment, twelve years, and no criminal punishment respectively.",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873598949896118552_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 351,
    "replies": 68,
    "retweets": 24,
    "views": 130612,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873599270059934114",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 13:17:30",
    "content": "On the night of December 30, a fire broke out in the 7th dormitory building of Beijing University of Science and Technology. The corridor was completely blackened, but the smoke alarms in the entire corridor did not sound. This was at least the third fire in the school this year. The school has carried out multiple fire safety hazard inspections, but fires still occur one after another. According to many students, the dormitory management did not issue warnings and evacuation in the first time of the fire.",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873599270059934114_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873599270059934114_1.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 258,
    "replies": 39,
    "retweets": 26,
    "views": 53034,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873602239853740437",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 13:29:18",
    "content": "Recently, a blogger questioned the illegality of the auxiliary police's law enforcement alone during a drunk driving inspection, and asked the traffic police to come before the drunk driving inspection. He was then threatened and warned by the auxiliary police, and even warned a second time, saying that if the blogger did not cooperate with their work, they would take coercive measures. The law stipulates that auxiliary police do not have the qualifications to enforce the law and need to carry out auxiliary work under the command, supervision or leadership of the police. The auxiliary police's behavior is suspected of being illegal. The blogger is defending his legal rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/12/30/1873602239853740437_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 533,
    "replies": 58,
    "retweets": 58,
    "views": 119569,
    "originVideos": "https://video.twimg.com/ext_tw_video/1873600177665454080/pu/vid/avc1/576x1280/VhclwqS4dE6PXQiR.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873629362161111266",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 15:17:04",
    "content": "December 29, Inner Mongolia. A teacher from a first-class university said in class: After giving birth to a child, God will bless you and let you live longer. If you don’t believe it, go and see those “particularly awesome women” whose life spans are very short, while there are many old ladies in the village who have given birth to eight or ten children and live to be 90-100 years old, and their chances of getting sick are also very low.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/12/30/1873629362161111266_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 255,
    "replies": 95,
    "retweets": 30,
    "views": 96373,
    "originVideos": "https://video.twimg.com/ext_tw_video/1873628402638622721/pu/vid/avc1/720x1280/13tCTP-zL2ZWRnA7.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873650096669401347",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 16:39:28",
    "content": "Hong Kong tourism industry insiders: Mainland tourists' retail spending power has fallen by 60% compared to before the epidemic.\nHong Kong Quality Tourism Services Association Chairman Huang Jielong said on Saturday that the spending power of mainland tourists has fallen a lot from the high level before the epidemic, especially the retail sales, which have fallen from an average of more than 5,000 Hong Kong dollars per person before the epidemic to more than 2,000 Hong Kong dollars now, a sharp drop of 60%.",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873650096669401347_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 98,
    "replies": 19,
    "retweets": 11,
    "views": 15447,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1873653416301646322",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-12-30 16:52:39",
    "content": "The Afghan Taliban ordered the sealing of windows in residential houses. Overlooking women's activities may lead to indecent behavior.\nA Taliban government spokesman issued a statement on Saturday saying that new homes in Afghanistan must not have windows that can see \"yards, kitchens, neighbors' wells and other areas commonly used by women.\"\nThe statement quoted the order of the top leader as saying: \"Seeing women working in the kitchen, yard or drawing water from the well may lead to indecent behavior.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/12/30/1873653416301646322_0.jpg,/tweet/image/whyyoutouzhele/2024/12/30/1873653416301646322_1.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 81,
    "replies": 28,
    "retweets": 11,
    "views": 13244,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]