[{"id":"1754549687955140774","name":"李老师不是你老师","createdDate":"2024-02-06 00:56:58","content":"February 5 Daily News\nCBS reported the grand event of Chinese people walking the line, and Musk forwarded it\nThousands of Myanmar A-shares hit the limit, and listed companies advised investors to let go of their obsessions and temporarily leave the stock market\n","images":"","videos":"","hasPublished":true},{"id":"1754550859936014815","name":"李老师不是你老师","createdDate":"2024-02-06 01:01:37","content":"Contributions from netizens\nThe English course at Shenyang Ligong University requires students to have the ability to express important concepts in \"Xi Jinping: The Governance of China\" in English. ","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754550859936014815_0.jpg","videos":"","hasPublished":true},{"id":"1754571914045997425","name":"李老师不是你老师","createdDate":"2024-02-06 02:25:17","content":"Netizens discovered that Zheng Xiuli, the controller of Shanghai Pudong \"Airport Travel\", established new companies in Guangzhou, Chongqing, Guizhou, Wuhan, and Hangzhou within 11 days.\nIn other words, if there had not been such strong opposition from Shanghai citizens before, it is very likely that the airport online car-hailing services in these five cities would also be monopolized by the \"Airport Travel\" APP.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754571914045997425_0.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754571914045997425_1.jpg","videos":"","hasPublished":true},{"id":"1754639382944903239","name":"李老师不是你老师","createdDate":"2024-02-06 06:53:23","content":"On February 5, some stockholders went to the comment section of the Japanese Embassy in China to make a quick comment.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754639382944903239_0.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754639382944903239_1.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754639382944903239_2.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754639382944903239_3.jpg","videos":"","hasPublished":true},{"id":"1754806318643175740","name":"李老师不是你老师","createdDate":"2024-02-06 17:56:43","content":"On February 5, the People's Daily published a statement: The United States should not treat \"national security\" as a panacea.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754806318643175740_0.jpg","videos":"","hasPublished":true},{"id":"1754806399295426682","name":"李老师不是你老师","createdDate":"2024-02-06 17:57:02","content":"Now, we have the positive energy version of \"Subject Three\"\nSweet.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/06/1754806399295426682_0.jpg","hasPublished":true},{"id":"1754807630952861923","name":"李老师不是你老师","createdDate":"2024-02-06 18:01:56","content":"The students won\nFollow-up to the issue of academic fraud by professor Huang Feiruo, who was collectively reported by 11 students of Huazhong Agricultural University\nOn February 6, Huazhong Agricultural University issued a report on the situation, revoking all Huang Feiruo's positions on campus, terminating his employment contract, and requesting the revocation of his teaching qualifications. His research papers and projects involving academic misconduct were withdrawn, his textbooks were suspended, his college was criticized, and the relevant persons in charge were criticized and educated.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754807630952861923_0.jpg","videos":"","hasPublished":true},{"id":"1754808018477162805","name":"李老师不是你老师","createdDate":"2024-02-06 18:03:29","content":"This year, I have seen too many cases of graduate students and doctoral students jumping off buildings due to exploitation by their supervisors. I hope this incident can make today's oppressed students understand that when facing oppression from their supervisors, jumping off a building is not the only option.","images":"","videos":"","hasPublished":true},{"id":"1754809838314344517","name":"李老师不是你老师","createdDate":"2024-02-06 18:10:42","content":"From February 3rd to 4th, a man brought his own pillow and quilt to sleep on the middle of the road at Shanghai Hongqiao Station. He lay flat on his back in the crowd for a whole day and was later persuaded to leave by security guards.\nThe incident went viral on Xiaohongshu, and netizens praised it as \"presenting a calm sense of madness.\"","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754809838314344517_0.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754809838314344517_1.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754809838314344517_2.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754809838314344517_3.jpg","videos":"","hasPublished":true},{"id":"1754812539123155341","name":"李老师不是你老师","createdDate":"2024-02-06 18:21:26","content":"On February 6, some netizens exposed that several hydrogen fuel buses worth millions of yuan were parked in the parking lot in Foshan, saying that \"due to high operating costs and lack of hydrogen at hydrogen refueling stations\", these hydrogen buses worth millions of yuan were forced to eat dirt in the parking lot.\nIn 2019, Nanhai District of Foshan City issued an announcement on the procurement of fuel cell buses, with a total of 4 batches of 386 vehicles, and the maximum price limit for each hydrogen fuel cell bus was 1.99 million yuan.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754812539123155341_0.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754812539123155341_1.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754812539123155341_2.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754812539123155341_3.jpg","videos":"","hasPublished":true},{"id":"1754816748677657061","name":"李老师不是你老师","createdDate":"2024-02-06 18:38:10","content":"Some netizens answered the question \"Why can't I see the video asking for salary this year?\"","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754816748677657061_0.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754816748677657061_1.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754816748677657061_2.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754816748677657061_3.jpg","videos":"","hasPublished":true},{"id":"1754819300416761955","name":"李老师不是你老师","createdDate":"2024-02-06 18:48:18","content":"On February 4, Caixin reported that the second and third commanders of the Rocket Force Zhou Yaning and Li Yuchao, three generals including the former commander of the Air Force Ding Laihang, as well as four lieutenant generals and two major generals were suspected of serious violations of discipline and law and were dismissed from their positions as deputies to the National People's Congress in the second half of 2024.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754819300416761955_0.jpg","videos":"","hasPublished":true},{"id":"1754821357995430356","name":"李老师不是你老师","createdDate":"2024-02-06 18:56:29","content":"On February 6, migrant workers held up banners demanding their wages in front of the entrance of New York University Shanghai.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754821357995430356_0.jpg","videos":"","hasPublished":true},{"id":"1754821650791510089","name":"李老师不是你老师","createdDate":"2024-02-06 18:57:39","content":"On February 6, a blogger said that Lin'an District of Hangzhou City distributed Spring Festival condolence money to local Taiwanese compatriots.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754821650791510089_0.jpg","videos":"","hasPublished":true},{"id":"1754823438592549319","name":"李老师不是你老师","createdDate":"2024-02-06 19:04:45","content":"On February 6, migrant workers demanded wages at the Maotai factory in Xishui County, Zunyi\nIt is reported that the first phase of the expansion of the factory of Kweichow Moutai in Tongmin Town, Xishui County, Zunyi was completed in June and July. China Railway was the contractor, and the wages have been in arrears until now. When the boss saw the police, he wanted to drive away, but the workers stopped him. The wages of these employees alone are in arrears of more than one million yuan.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754823438592549319_0.jpg","videos":"","hasPublished":true},{"id":"1754823548697272406","name":"李老师不是你老师","createdDate":"2024-02-06 19:05:11","content":"Netizen contribution\nAn MCN notified anchors not to talk about the topic of \"no holiday on New Year's Eve\" in the live broadcast room. If detected, they will be banned for 3 months.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754823548697272406_0.jpg","videos":"","hasPublished":true},{"id":"1754830531261264307","name":"李老师不是你老师","createdDate":"2024-02-06 19:32:56","content":"Netizen contribution\nAn elderly man in Tieli City, Heilongjiang, petitioned due to forced demolition, and then petitioned to maintain stability through violence","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/06/1754830531261264307_0.jpg","hasPublished":true},{"id":"1754832447517147189","name":"李老师不是你老师","createdDate":"2024-02-06 19:40:33","content":"One hour ago, Guangzhou Metro announced that in order to cooperate with the temporary control measures of the West Lake Flower Market, Guangzhou Metro Line 6 trains will not stop at \"Beijing Road\" from 19:00 on February 6 until further notice.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754832447517147189_0.jpg","videos":"","hasPublished":true},{"id":"1754844609660830029","name":"李老师不是你老师","createdDate":"2024-02-06 20:28:53","content":"Xue Peng responded","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754844609660830029_0.jpg","videos":"","hasPublished":true},{"id":"1754847609410191628","name":"李老师不是你老师","createdDate":"2024-02-06 20:40:48","content":"Annual photo of stockholders","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754847609410191628_0.jpg","videos":"","hasPublished":true},{"id":"1754854064561487874","name":"李老师不是你老师","createdDate":"2024-02-06 21:06:27","content":"On February 6, Beijing released an investigation report on the Changping Line train rear-end collision accident, and 18 people were held accountable.\nThe accident caused 130 fractures, but no one died. Three people were seriously injured and 70 people were slightly injured. The direct economic loss was about 9.508 million yuan.\nThe investigation determined that the accident occurred because the snow caused the train braking distance to be extended, the operating unit's snow response measures were not implemented in place, the train dispatcher handled it improperly, and the train driver operated improperly.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754854064561487874_0.jpg","videos":"","hasPublished":true},{"id":"1754859587683992005","name":"李老师不是你老师","createdDate":"2024-02-06 21:28:24","content":"Domestic reports on the program: Most of the Chinese \"Runren\" who took the online scam were paupers who had sold their assets and cashed out of their loans. The United States repatriated 36,000 people, but China did not accept a single one.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754859587683992005_0.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754859587683992005_1.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754859587683992005_2.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754859587683992005_3.jpg","videos":"","hasPublished":true},{"id":"1754861404824256589","name":"李老师不是你老师","createdDate":"2024-02-06 21:35:37","content":"On February 5, the EU delegation posted a Weibo post condemning the sentencing of Ms. Li Qiaochu to three years and eight months. Ms. Li Qiaochu has worked to protect the rights of migrant workers and women. In 2020, she was detained by the police after testifying about being tortured during her RSDL. In February 2022, she was prosecuted by the Linyi City Procuratorate on suspicion of \"inciting subversion of state power.\"","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754861404824256589_0.jpg","videos":"","hasPublished":true},{"id":"1754867398442623400","name":"李老师不是你老师","createdDate":"2024-02-06 21:59:26","content":"On February 5, Qingdao, Shandong. A woman posted a video saying that the Laoshan District government forcibly expropriated land without legal procedures.\nAfter she repeatedly appealed to the local government and Beijing to report the problem, she was followed by two unidentified people 24 hours a day.\nJudging from the video description, this has caused her severe mental stress over time.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/06/1754867398442623400_0.jpg","hasPublished":true},{"id":"1754867705532879059","name":"李老师不是你老师","createdDate":"2024-02-06 22:00:39","content":"\"A letter from home is worth a thousand gold coins.\"\nRecently, a netizen broke the news that the year-end bonus of all branches of Shanghai Pudong Development Bank has been transformed into a letter from home. It is reported that the bank has adopted a model of basic salary plus year-end bonus. The annual income of ordinary employees mainly depends on the year-end bonus, which means that the hard work of the whole year can only be exchanged for a letter from home. Some employees complained that they could not calm down for two days, and the 100-day campaign lasted for three months. A letter from home is worth a thousand gold coins.","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754867705532879059_0.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754867705532879059_1.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754867705532879059_2.jpg","videos":"","hasPublished":true},{"id":"1754872081328619724","name":"李老师不是你老师","createdDate":"2024-02-06 22:18:02","content":"On February 5, Jinan, Shandong. A boy posted a video showing off that he tied firecrackers to a puppy and set it on fire, then kicked and beat the puppy several times. Eventually, the puppy was tortured to death. The video shows that the puppy was screaming in pain and there was blood at the corner of its mouth.\nThe local police station responded to reporters that they were handling the case, but the boy involved was a minor.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/06/1754872081328619724_0.jpg","hasPublished":true},{"id":"1754874574859010333","name":"李老师不是你老师","createdDate":"2024-02-06 22:27:57","content":"New Champion\nMedia reports that a young man who previously worked in the financial industry sold cherries part-time through a WeChat group. As his business grew, he quit his job and opened a fruit shop in Hangzhou. Currently, the fruit shop has a daily turnover of 340,000 yuan during the peak season.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/06/1754874574859010333_0.jpg","hasPublished":true},{"id":"1754874825841971608","name":"李老师不是你老师","createdDate":"2024-02-06 22:28:57","content":"https://t.co/2roG97RRN8","images":"/tweet/image/whyyoutouzhele/2024/02/06/1754874825841971608_0.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754874825841971608_1.jpg,/tweet/image/whyyoutouzhele/2024/02/06/1754874825841971608_2.jpg","videos":"","hasPublished":true}]