[{"id":"1737219091574759852","name":"李老师不是你老师","createdDate":"2023-12-20 05:11:22","content":"User contribution\nThe situation of the Hengda Yuefu guaranteed delivery project in Xingtai, Hebei","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737219091574759852_0.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737219091574759852_1.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737219091574759852_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/As4iuWXYgq","accountId":"whyyoutouzhele"},{"id":"1737430502561169580","name":"李老师不是你老师","createdDate":"2023-12-20 19:11:26","content":"On December 20, in the government hall of Lianshui County, Huai'an, Jiangsu, a woman suddenly collapsed and rushed into the crowd due to mental disorder.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/20/1737430502561169580_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/PaBkrUx6rs","accountId":"whyyoutouzhele"},{"id":"1737431257577840855","name":"李老师不是你老师","createdDate":"2023-12-20 19:14:26","content":"Netizen contribution\nDecember 20, Qinghai. A netizen posted a video asking for help, saying, \"Our village is in urgent need of rescue. We have not had any supplies since the early morning of December 19, and we can only find a way ourselves. All the supplies have been transported to Chenjia Village, Hanshan Village, Dahe Village, and our Zhoujia Village has no supplies.\"\nOnly three hours after the video went viral, Zhoujia Village received food and other supplies.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737431257577840855_0.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737431257577840855_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/o6ZRG7yYGQ","accountId":"whyyoutouzhele"},{"id":"1737432844945793084","name":"李老师不是你老师","createdDate":"2023-12-20 19:20:44","content":"\"Nostalgia Server\"\nA Guangdong math teacher posted a post on Xiaohongshu asking for help. The school's open class requires the inclusion of \"curriculum ideological and political\" content in math classes.\nHere are some math textbooks from the Cultural Revolution period, I hope they will be helpful to this teacher.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737432844945793084_0.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737432844945793084_1.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737432844945793084_2.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737432844945793084_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/xS1n6qOO5U","accountId":"whyyoutouzhele"},{"id":"1737434386281435306","name":"李老师不是你老师","createdDate":"2023-12-20 19:26:52","content":"Some netizens have expressed doubts about whether the frequent earthquakes in some areas of China are caused by the United States.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737434386281435306_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/hbIDLeVveq","accountId":"whyyoutouzhele"},{"id":"1737434814054039588","name":"李老师不是你老师","createdDate":"2023-12-20 19:28:34","content":"Netizen contribution\nOn December 18, a Beijing netizen took a photo of a police notice posted on a wall that read \"It is strictly forbidden to print, copy, or print all kinds of petition materials, reporting materials, and all kinds of reactionary materials.\"\nThis triggered a collective comment in the comment area to ridicule.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737434814054039588_0.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737434814054039588_1.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737434814054039588_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/R66mZcu76p","accountId":"whyyoutouzhele"},{"id":"1737438579805028751","name":"李老师不是你老师","createdDate":"2023-12-20 19:43:32","content":"On December 20, some netizens posted a question about why Bona Film Group, which has been producing patriotic films for many years, has not donated money. Some netizens searched for keywords and found that the only donation information of Bona Film Group was 25 million yuan for the Japanese earthquake in 2011.\nThe news triggered heated discussions and condemnations from patriotic netizens. Bona Film Group later refuted the rumor, saying that the Weibo post was a reposted message and that Bona Film Group had never donated money to Japan.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737438579805028751_0.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737438579805028751_1.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737438579805028751_2.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737438579805028751_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/If9mDvvNcp","accountId":"whyyoutouzhele"},{"id":"1737441059746029981","name":"李老师不是你老师","createdDate":"2023-12-20 19:53:23","content":"On December 20, a shopping mall in Kunming issued a notice urging merchants not to celebrate Christmas and not to hang holiday decorations in the name of the holiday.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737441059746029981_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/0F0NAru5U0","accountId":"whyyoutouzhele"},{"id":"1737443128104124907","name":"李老师不是你老师","createdDate":"2023-12-20 20:01:36","content":"Netizens said that in the past, so many mainstream movies were made to morally blackmail us, and today we are also going to morally blackmail you.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737443128104124907_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/n60GE5wF1E","accountId":"whyyoutouzhele"},{"id":"1737447526347817407","name":"李老师不是你老师","createdDate":"2023-12-20 20:19:05","content":"On December 18, colleges and universities in Liaoning, Shandong and other places once again asked students to follow the \"Jiu Wanli\" public account.\nIn the notice of Bohai University, it was shown that the number of followers of the two public accounts \"Jiu Wanli\" and \"Ministry of State Security\" had been included in the assessment of the school by the Liaoning Provincial National Security People's Defense Line Leading Group.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737447526347817407_0.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737447526347817407_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/tP3TFrzZo3","accountId":"whyyoutouzhele"},{"id":"1737447735207309607","name":"李老师不是你老师","createdDate":"2023-12-20 20:19:54","content":"https://t.co/I01buzsJiH","images":"","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/I01buzsJiH","accountId":"whyyoutouzhele"},{"id":"1737464745022628193","name":"李老师不是你老师","createdDate":"2023-12-20 21:27:30","content":"On December 20, some netizens found that mentioning the \"2900-point defense battle\" on Xiaohongshu was suspected of violating regulations.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737464745022628193_0.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737464745022628193_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/Ay7dMOnUDx","accountId":"whyyoutouzhele"},{"id":"1737464830255141271","name":"李老师不是你老师","createdDate":"2023-12-20 21:27:50","content":"December 20, Zhoukou City, Henan Province. A woman posted a video saying that she and her grandfather were threatened by a certain unit leader because of their rights protection. She reported the head of Chaigang Township, Fugou County, the deputy secretary of the township party committee, and the director of the police station under her real name. On the morning of October 16, 22, the local government sent people to demolish the grandparents' house without any procedures. The court ruled in one case to revoke the rectification notice, and in the second case, it ruled that the forced demolition was administratively illegal. During the demolition, the local government enforced the law violently, and the grandmother died of excessive shock.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/20/1737464830255141271_0.jpg","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1737465357802115209","name":"李老师不是你老师","createdDate":"2023-12-20 21:29:56","content":"\"Diary of Wage Demand\"\nOn December 19, a worker in Suzhou, Anhui Province, posted his diary of wage demand online. In his diary, he said that he was an ordinary person who came to the countryside. He worked in a garment factory in Sixian County in June 2022. At the beginning, his salary was paid on time, but later he began to default on his salary.\nI left the factory at the end of November 2023, but the boss has not settled his salary yet. Although it is only 5,000 yuan, it is the hard-earned money earned by staying up late and working overtime. I have no education and do not understand the law. How can I get my hard-earned money back? Please give me some good advice.\nAt 8:30 am on December 12, 2023, I asked for leave and went to the local labor and social security inspection team with everyone to defend my rights. After explaining the situation to the team leader, he called Mr. Chen, who asked the workers to come back at 5 pm. Before 5 pm, the workers came to the Labor and Social Security Inspection Team again, but were told that Mr. Chen came at 3 pm and asked the workers to hand over the salary statistics to him, and then the team leader handed it to Mr. Chen. Then let the workers go back and wait for the call. But the workers didn't know whose call they were waiting for. Was it the call from Mr. Chen who never answered the phone or met with them? Because the team leader had already entered the house, it was not convenient for everyone to disturb him. They just took the landline number of the Supervision Team and went back to the factory. \nAt 10:31 a.m. on December 14, the Supervision Team called the workers and said that they were handling the matter. The boss would come to pay the wages in the afternoon. At 13:10 p.m., the team leader called to register the workers' information. At 18:20 p.m., 12345 called back and said that the boss was calculating the wages. \nAt 9:30 a.m. on December 15, the workers went to the Letters and Calls Bureau. The director called the Personnel Bureau and asked the Personnel Bureau to urge the Labor Supervision Team to deal with the wage arrears as soon as possible. At 11:58 a.m., they received a call from Captain Ding of the Labor Supervision Team, who said that he would go to the factory in the afternoon. \nAt 16:43 p.m., the workers called to inquire and were told that the boss would come to the Supervision Team to calculate the wages. The workers questioned why the wages were still not clear after so many days of calculation. \nOn December 17, at 13:51 in the afternoon, the workers went to the Labor and Social Security Supervision Team. Mr. Chen was also there. He asked the workers to show the piece-rate accounts, but the workers said that they were paid according to working hours. After that, Mr. Chen kept shirking the responsibility of going back to settle the accounts, so the workers did not get their wages again. On December 19, it was agreed that there would be a reply within seven working days, but after seven working days, there was no reply from the phone call of 12345. I went to the Sishui County Police Station, the Labor Supervision Brigade, and the Sishui County Letters and Calls Bureau, but the problem was still not solved. What is the reason that Mr. Chen has not settled the accounts until now? Although the vibrato video I posted some time ago was deleted by some people, after so many days, there is still no progress on my hard-earned money. I hope everyone can give me some good suggestions.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737465357802115209_0.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737465357802115209_1.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737465357802115209_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1737466173300572645","name":"李老师不是你老师","createdDate":"2023-12-20 21:33:10","content":"In Chongwu Town, Hui'an County, Quanzhou City, Fujian Province, the port on which fishermen depend for their survival was sold by the government to Quanyun Industrial Company. The fishermen have gone to the town government to make trouble several times, but to no avail, and some were even beaten.\nNow, the fishermen have no choice but to move their boats to the nearby Dazha Port, which is shallow and rocky, which eventually led to the sinking of the fishermen's boats and heavy losses.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/20/1737466173300572645_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/KwjEVXAgmX","accountId":"whyyoutouzhele"},{"id":"1737497730426056804","name":"李老师不是你老师","createdDate":"2023-12-20 23:38:34","content":"\"The director of Aier Eye Hospital punched a patient during surgery, causing the patient to lose sight in his left eye\"\nOn December 20, Weibo celebrity \"Emergency Sunflower Ai Fen\" released a video saying that when Feng Guiqiang, director of Aier Eye Hospital in Guigang, Guangxi, was performing surgery on an 82-year-old patient, the patient cried out in pain, so Director Feng punched him in the head.\nAfter the surgery, the patient lost sight in his left eye, but Feng told the patient's family that he had never hit the patient.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/20/1737497730426056804_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/EV5cDB6oau","accountId":"whyyoutouzhele"},{"id":"1737498968563617964","name":"李老师不是你老师","createdDate":"2023-12-20 23:43:29","content":"The reporter searched on the official website of Guigang Aier Eye Hospital and found that Feng Guiqiang is the director of Guigang Aier Eye Hospital, with the title of deputy chief physician, party member, and the \"Most Beautiful Grassroots Ophthalmologist\" in 2023. He is good at myopia laser surgery, ICL myopia surgery, fundus disease, retinal detachment and other surgeries.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737498968563617964_0.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737498968563617964_1.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737498968563617964_2.jpg,/tweet/image/whyyoutouzhele/2023/12/20/1737498968563617964_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/CIlo3ihWjK","accountId":"whyyoutouzhele"},{"id":"1737499246515929372","name":"李老师不是你老师","createdDate":"2023-12-20 23:44:36","content":"At present, the blogger said that Aier Eye Hospital will report the case to the police, find out the whistleblower, and put him in jail.","images":"/tweet/image/whyyoutouzhele/2023/12/20/1737499246515929372_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/e4CywqJ1lA","accountId":"whyyoutouzhele"}]