[{"id":"1671914857770242050","name":"李老师不是你老师","createdDate":"2023-06-23 00:15:39","content":"Netizen contribution\nOn June 21, the media reported.\nA woman gave birth to six daughters in a row. Unable to bear the pain of continuing to \"pursue a boy\", she fled back to her parents' home. On June 6 this year, she applied for a divorce from the court, but was rejected by the court.\nThe presiding judge even issued a \"family education order\" to her. He believed that she had lacked care, education and companionship for her six daughters since she left home in 2019, and should fully fulfill her guardianship responsibilities and let the children grow up healthily under the company and care of their mother.","images":"/tweet/image/whyyoutouzhele/2023/06/23/1671914857770242050_0.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1671914857770242050_1.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1671914857770242050_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/Oc8yNawPRD","accountId":"whyyoutouzhele"},{"id":"1671951058862592000","name":"李老师不是你老师","createdDate":"2023-06-23 02:39:30","content":"\"Winning Ma caused by a comment\"\nRecently, a news that \"the Second Flight Squadron of a certain Air Force Aviation Corps was awarded the title of Model of the Times for its low-altitude assault and driving away the US aircraft carrier \"Reagan\"\" attracted the attention of netizens inside the wall.\nOn the 20th, CCTV Military released a video with the tags \"H-6K flew over the sea to drive away foreign ships\" and \"The Central Propaganda Department awarded the title of Model of the Times to a certain Second Flight Squadron\". A shot in the video revealed a warship, which was interpreted by netizens as evidence of approaching the US aircraft carrier \"Reagan\", and continued to respond to netizens' speculation.\nThen there were a large number of self-media saying that the H-6K achieved low-altitude penetration in the South China Sea and forced the \"Reagan\" to turn 90 degrees to escape, and thus won the honor of \"Model of the Times\".\n\"Low-altitude penetration, 10 meters above the sea, flying close to the sea, avoiding radar detection, and locked by the fire control radar. The Reagan has been sunk in actual combat!\"\nImmediately afterwards, mobile phones across the country received the \"Model of the Times\" text message, which brought public opinion to a climax, and more netizens believed this statement. I also received a lot of submissions asking me to publish this news.\nHowever, the news has been refuted by many patriotic big Vs and military bloggers.\nIn fact, sending group text messages of \"Model of the Times\" is a routine, and someone gets it almost every month, which is not rare. The reason why a certain flight squadron won the title of Model of the Times is actually written in the announcement, because it has successfully completed the task many times.\nAt the same time, some bloggers pointed out that it is not uncommon to drive away foreign ships from time to time, and it is impossible to drive away an aircraft carrier today and win an award tomorrow.\nAfter tracing the source, netizens found that this statement first came from a reply on the famous domestic game forum NGA.","images":"/tweet/image/whyyoutouzhele/2023/06/23/1671951058862592000_0.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1671951058862592000_1.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1671951058862592000_2.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1671951058862592000_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1671951935908478978","name":"李老师不是你老师","createdDate":"2023-06-23 02:42:59","content":"Supplementary information\nText messages for the title of \"Model of the Times\" are not uncommon\nUSS Ronald Reagan turns 90 degrees\nVideo and text released by CCTV Military and comments below","images":"/tweet/image/whyyoutouzhele/2023/06/23/1671951935908478978_0.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1671951935908478978_1.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1671951935908478978_2.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1671951935908478978_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/8KtK611Gwp","accountId":"whyyoutouzhele"},{"id":"1672178266327724032","name":"李老师不是你老师","createdDate":"2023-06-23 17:42:20","content":"Netizen contribution\nOn June 23, the roof of the water plant in Zhumadian, Henan Province collapsed, damaging more than a dozen cars","images":"","videos":"/tweet/video/whyyoutouzhele/2023/06/23/1672178266327724032_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/lusB3nOA0S","accountId":"whyyoutouzhele"},{"id":"1672183906953469955","name":"李老师不是你老师","createdDate":"2023-06-23 18:04:45","content":"Netizen submission\nOn June 22, some netizens discovered that the \"Rat Head Duck Neck\" series of toys were removed from the entire network.","images":"/tweet/image/whyyoutouzhele/2023/06/23/1672183906953469955_0.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1672183906953469955_1.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1672183906953469955_2.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1672183906953469955_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/PCIbS8T4yV","accountId":"whyyoutouzhele"},{"id":"1672200623792553985","name":"李老师不是你老师","createdDate":"2023-06-23 19:11:11","content":"Netizen contribution \nOn the afternoon of June 23, Chongqing.\nAt the Chinese Football Association Cup, Chengdu Rongcheng vs. Chongqing Tonglianglong match, a large-scale conflict broke out between the fans of both sides before the game started.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/06/23/1672200623792553985_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/vF2INvuumR","accountId":"whyyoutouzhele"},{"id":"1672201579858935808","name":"李老师不是你老师","createdDate":"2023-06-23 19:14:59","content":"Netizen contribution\nOn June 23, a family massacre occurred in Zhuanghe City, Dalian City, Liaoning Province.\nThe murderer Wang Moubo killed his brother's family of six because of a family dispute.","images":"/tweet/image/whyyoutouzhele/2023/06/23/1672201579858935808_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/J9TbXOBvwy","accountId":"whyyoutouzhele"},{"id":"1672239070146117636","name":"李老师不是你老师","createdDate":"2023-06-23 21:43:57","content":"Netizen contribution\nOn June 23, LGBTQ+ graffiti and rainbow signs were vandalized on the campus of Dalian Polytechnic University. Later, a student came forward to say that he did it because \"this is a university, not a gay club.\"\nThe action received support from a series of netizens online.","images":"/tweet/image/whyyoutouzhele/2023/06/23/1672239070146117636_0.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1672239070146117636_1.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1672239070146117636_2.jpg,/tweet/image/whyyoutouzhele/2023/06/23/1672239070146117636_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/QOgTgJsPhk","accountId":"whyyoutouzhele"},{"id":"1672261301949669382","name":"李老师不是你老师","createdDate":"2023-06-23 23:12:18","content":"Summary of past tweets\nChapter 2: \"From mourning to shouting\"\nThis article summarizes what happened in the last four hours before the outbreak of \"Urumqi Middle Road\":\nThe mourning ceremony of Shanghai people was disturbed by the police,\nThe poem written by Peking University\nIn Xinjiang, people set off fireworks to celebrate the lifting of the blockade\nAt 1:30 in the morning, on Urumqi Middle Road, people began to hold up white paper in silent protest.\nThis is the last time Shanghai people are silent tonight...\n","images":"","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/pPqkiz4BmI","accountId":"whyyoutouzhele"}]