[{"id":"1862166846742663587","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 24:11:08","content":"November 26 was Yang Jia's death anniversary, and his mother Wang Jingmei came to her son's grave to pay tribute and lay flowers. Wang Jingmei's social account profile said: Yang Jia was sunny and healthy, kind and strong, with excellent character, excellent culture, and liked to help others.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862175798150799812","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 24:56:36","content":"November 28, Shenyang, Liaoning. The woman posted a video saying that her Agricultural Bank of China card was suddenly unable to pay, so she asked her husband to transfer 5,000 yuan to test whether the card could be used. The bank said that if the money in the card cannot be used, it must provide: household registration book, ID card, marriage certificate, real estate certificate, etc., otherwise the money in the card will not have the right to be used. Also explain why the husband wants to transfer the money.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862204739703710016","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 02:42:34","content":"According to netizens’ submissions, up to this day, some schools in Zhengzhou are still closed due to the Night Ride in Kaifeng incident.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862267540925554767","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 06:59:46","content":"Netizen contribution November 28th At Suvarnabhumi Airport in Thailand, a Chinese person left a pile of garbage after eating snacks. The garbage was finally cleaned up by the airport staff. I hope everyone should pay attention to their own quality whether they are traveling or in their own community, and work together to create a beautiful and comfortable environment, and don't cause trouble to others.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862271826019459528","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 07:14:59","content":"Recently, the number of juvenile crimes has increased significantly. Netizens contributed. Recently, an armed gang fight occurred in front of Tangshan No. 38 Middle School. Five people armed with long sticks surrounded and beat two people. The victim was hit on the head and kicked violently. At the end of the video, the victim squatted on the ground. Still grabbing the hair, he punched the victim on the head and asked the victim to kneel down while the campus security room was next to him.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862275193911349441","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 07:30:12","content":"Netizen contribution A similar bullying incident also occurred in a certain place. A group of people tied a young man's hands behind his back and hung him on the beam of the house. They beat him until his head was bleeding and the sticks were broken. The victim kept crying, \"Dad, Dad\", which is suspected to be from southern China.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862277199782715762","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 07:30:17","content":"November 27th, Hohhot, Inner Mongolia: A red Jeep rear-ended another car and stepped on the accelerator to the limit, with eyes rolling. Fortunately, there were two cars in front of it, so no more casualties were caused. The person who filmed the scene said: The Jeep driver fainted, and passers-by broke the window to save him.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862279796853809661","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 07:45:30","content":"Added full video of the physical conflict between Chengdu deliverymen and property management over locking the car. The property management brought a group of suited property staff to argue with the two deliverymen, and then more and more deliverymen joined the fierce dispute between the two sides, from quarreling, pushing, and finally evolving into a group physical conflict.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862283091026522510","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 08:00:43","content":"On November 27, a man in Hebei used his mobile phone to record the process of going to the bank to repay his mortgage early. The bank staff said: \"It is not possible to repay the loan early on the same day. You need to make an appointment two months in advance to repay it early.\" After the man threatened to complain to 12345 and the China Banking and Insurance Regulatory Bureau, the bank staff relented and said: \"We have helped you get a place to repay the loan early.\" The man said: \"When I borrowed the money, I didn't make an appointment to repay the whole appointment\"!","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862285031169040615","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 08:00:49","content":"Netizen contribution: November 28th: Due to the withholding of wages for migrant workers at Hubei Qianjiang Yuanlin Sake Industry, workers stood on the edge of the roof to demand their wages, and this is said to have lasted for eight days.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862360027430080970","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 13:03:24","content":"On November 28, Lu Ping, deputy mayor of Anqing, Anhui, was expelled from the party and removed from office for serious violations of discipline and law and his refusal to be saved by the organization, sparking ridicule from netizens. Netizens asked: \"How can he be saved by the organization after he has seriously violated discipline and law?\" \"If he cooperates with the organization to save him, will he be able to keep his position?\" \"If he confesses, can he be fined three glasses of wine?\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862387660695937376","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 14:49:21","content":"The police issued a notice saying that some deliverymen from a food delivery platform parked their electric bicycles on the sidewalk and non-motorized vehicle lane outside the gate of a residential community because they were attending a company morning meeting. The property staff of the residential community had an argument with the deliverymen over parking order, which led to a physical conflict, resulting in injuries to one property staff member and two deliverymen.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862416778066108759","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 16:50:26","content":"On November 27, the Russian ruble's exchange rate against the U.S. dollar fell by more than 8.5% at one point. \"The ruble collapsed\" became a hot search on Weibo, and as a result, some people's mentality also \"collapsed.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862420421741879673","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-29 17:05:39","content":"On November 28, the boss of the parent company of the global chain brand Uniqlo said in an interview with the BBC that the Japanese company did not use cotton from China's Xinjiang region in its products. This caused dissatisfaction and boycott among Chinese netizens. Many people said that they would no longer buy Uniqlo products. \"I support Xinjiang cotton and will never buy Uniqlo in my life.\"","hasFullContentTranslated":true,"hasPublished":true}]