[
  {
    "id": "1862166846742663587",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 24:11:08",
    "content": "November 26 was Yang Jia's death anniversary, and his mother Wang Jingmei came to her son's grave to pay tribute and lay flowers. Wang Jingmei's social account profile said: Yang Jia was sunny and healthy, kind and strong, with excellent character, excellent culture, and liked to help others.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862175798150799812",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 24:56:36",
    "content": "November 28, Shenyang, Liaoning. The woman posted a video saying that her Agricultural Bank of China card was suddenly unable to pay, so she asked her husband to transfer 5,000 yuan to test whether the card could be used. The bank said that if the money in the card cannot be used, it must provide: household registration book, ID card, marriage certificate, real estate certificate, etc., otherwise the money in the card will not have the right to be used. Also explain why the husband wants to transfer the money.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862204739703710016",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 02:42:34",
    "content": "According to netizens’ submissions, up to this day, some schools in Zhengzhou are still closed due to the Night Ride in Kaifeng incident.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862267540925554767",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 06:59:46",
    "content": "Netizen contribution November 28th At Suvarnabhumi Airport in Thailand, a Chinese person left a pile of garbage after eating snacks. The garbage was finally cleaned up by the airport staff. I hope everyone should pay attention to their own quality whether they are traveling or in their own community, and work together to create a beautiful and comfortable environment, and don't cause trouble to others.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862271826019459528",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 07:14:59",
    "content": "Recently, the number of juvenile crimes has increased significantly. Netizens contributed. Recently, an armed gang fight occurred in front of Tangshan No. 38 Middle School. Five people armed with long sticks surrounded and beat two people. The victim was hit on the head and kicked violently. At the end of the video, the victim squatted on the ground. Still grabbing the hair, he punched the victim on the head and asked the victim to kneel down while the campus security room was next to him.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862275193911349441",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 07:30:12",
    "content": "Netizen contribution A similar bullying incident also occurred in a certain place. A group of people tied a young man's hands behind his back and hung him on the beam of the house. They beat him until his head was bleeding and the sticks were broken. The victim kept crying, \"Dad, Dad\", which is suspected to be from southern China.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862277199782715762",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 07:30:17",
    "content": "November 27th, Hohhot, Inner Mongolia: A red Jeep rear-ended another car and stepped on the accelerator to the limit, with eyes rolling. Fortunately, there were two cars in front of it, so no more casualties were caused. The person who filmed the scene said: The Jeep driver fainted, and passers-by broke the window to save him.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862279796853809661",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 07:45:30",
    "content": "Added full video of the physical conflict between Chengdu deliverymen and property management over locking the car. The property management brought a group of suited property staff to argue with the two deliverymen, and then more and more deliverymen joined the fierce dispute between the two sides, from quarreling, pushing, and finally evolving into a group physical conflict.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862283091026522510",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 08:00:43",
    "content": "On November 27, a man in Hebei used his mobile phone to record the process of going to the bank to repay his mortgage early. The bank staff said: \"It is not possible to repay the loan early on the same day. You need to make an appointment two months in advance to repay it early.\" After the man threatened to complain to 12345 and the China Banking and Insurance Regulatory Bureau, the bank staff relented and said: \"We have helped you get a place to repay the loan early.\" The man said: \"When I borrowed the money, I didn't make an appointment to repay the whole appointment\"!",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862285031169040615",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 08:00:49",
    "content": "Netizen contribution: November 28th: Due to the withholding of wages for migrant workers at Hubei Qianjiang Yuanlin Sake Industry, workers stood on the edge of the roof to demand their wages, and this is said to have lasted for eight days.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862360027430080970",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 13:03:24",
    "content": "On November 28, Lu Ping, deputy mayor of Anqing, Anhui, was expelled from the party and removed from office for serious violations of discipline and law and his refusal to be saved by the organization, sparking ridicule from netizens. Netizens asked: \"How can he be saved by the organization after he has seriously violated discipline and law?\" \"If he cooperates with the organization to save him, will he be able to keep his position?\" \"If he confesses, can he be fined three glasses of wine?\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862387660695937376",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 14:49:21",
    "content": "The police issued a notice saying that some deliverymen from a food delivery platform parked their electric bicycles on the sidewalk and non-motorized vehicle lane outside the gate of a residential community because they were attending a company morning meeting. The property staff of the residential community had an argument with the deliverymen over parking order, which led to a physical conflict, resulting in injuries to one property staff member and two deliverymen.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862416778066108759",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 16:50:26",
    "content": "On November 27, the Russian ruble's exchange rate against the U.S. dollar fell by more than 8.5% at one point. \"The ruble collapsed\" became a hot search on Weibo, and as a result, some people's mentality also \"collapsed.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862420421741879673",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 17:05:39",
    "content": "On November 28, the boss of the parent company of the global chain brand Uniqlo said in an interview with the BBC that the Japanese company did not use cotton from China's Xinjiang region in its products. This caused dissatisfaction and boycott among Chinese netizens. Many people said that they would no longer buy Uniqlo products. \"I support Xinjiang cotton and will never buy Uniqlo in my life.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862425794179629165",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 17:20:52",
    "content": "November 26, Huanggang, Hubei. A senior high school teacher at Boda Middle School was found dead the next day after being exhausted. It is reported that the teacher surnamed Dong was 58 years old and taught senior high school students all year round. He was so tired that he was hospitalized during the summer vacation. Before his death, he applied to the school to teach freshmen to relieve stress but was rejected by the school. Teacher Dong died in the dormitory around 9 am on the 24th. He was retired in two years, and the school did not care about it afterwards.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1862427092623007785",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 17:36:05",
    "content": "November 26, Huanggang, Hubei. A senior high school teacher at Boda Middle School was found dead after being worked to death. It was reported that Teacher Dong was 58 years old and taught senior high school students all year round. He was so tired that he was hospitalized during the summer vacation. Before his death, he applied to the school to teach freshmen to relieve stress but was rejected by the school. Teacher Dong died in the dormitory around 9 am on the 24th. He was retired in two years, and the school did not care about it afterwards.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862430399647162394",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 17:51:18",
    "content": "On November 29, in Nanchang, Jiangxi, it was reported online that a BYD car owner and an electric car owner had a driving dispute near Xuefu Avenue. The two sides quarreled, and then the BYD car owner got out of the car and stabbed the electric car owner. The video showed that the stabbed man fell unconscious in a pool of blood.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862435709757599755",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 18:06:31",
    "content": "November 28, Mianyang, Sichuan. A man said he wanted to report himself because he smashed the government's suggestion box. The man said he went to the government to do something, but no one was at work, so he put his request on the office table and in the suggestion box. The next day, he went to the government again, but still no one was there, and the suggestion box was covered with dust, so he smashed the suggestion box in anger. \"I hope the government will punish me and reward the employees who didn't go to work\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862441017448046709",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 18:21:44",
    "content": "On November 29, a popular influencer with hundreds of thousands of followers posted: Others govern a big country like cooking a small fish, but you govern a big country like painting a big cake. I am talking about you, Modi. Netizens: \"Modi will soon become a sensitive word too.\" \"XTM\" \"How dare you! Are you really talking about Modi?\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862445992781783257",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 18:52:05",
    "content": "November 29, Shouguang, Shandong. A gold shop in Shangkou Town was robbed by two men and one woman, with a loss of tens of millions. The suspects entered and exited the gold shop in just over 50 seconds. November 27, Guang'an, Sichuan. The Industrial and Commercial Bank of China Linshui Branch was robbed by two people and was controlled on the spot by security guards. August 14, Rizhao, Shandong. A masked man robbed a gold shop with an axe and fled. July 12, Cixi, Zhejiang. A man robbed a gold shop with a simulated gun and fled.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862448838512189482",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 18:52:10",
    "content": "On November 23, Zhang Weiwei told the students in the audience during his speech at Fudan University: You should use your own power to speak out, and positive bloggers should unite and cooperate with each other. This year is the year of counterattack by public intellectuals, and they may have received \"dog food\" and 1.6 billion will be paid. As for those who attack me online, the more fiercely they curse, the faster my fans will increase.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862452825881813342",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 19:07:23",
    "content": "On November 27, the performance of Liu Guijuan, a famous Chinese Peking Opera actress, in Nanjing was cancelled for some reason. Later, Liu Guijuan's past remarks were dug up by netizens. She once wrote: Mao Zedong fought a war, but failed to defeat China's bureaucratic culture, power-seeking, profit-seeking, clique-forming and self-interested, etc. Only popular elections, democracy, and the use of human rights to control official power can eradicate it. Otherwise, the movement will continue, bad luck will repeat, and everything will be empty talk.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862456628181967096",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 19:22:36",
    "content": "China has ordered the vigorous development of supply and marketing cooperatives. On November 28, Xi Jinping issued instructions on the 70th anniversary of the establishment of China's supply and marketing cooperatives, emphasizing that party committees and governments at all levels should further strengthen their leadership and support for the work of supply and marketing cooperatives. They should serve as a bridge between the party and the government to closely connect with the farmers and strive to write a new chapter in the high-quality development of the supply and marketing cooperative cause.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862460257424871904",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 19:37:49",
    "content": "On November 29, some netizens discovered that Onlyfans was briefly accessible directly in China.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862460672090808678",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 19:37:55",
    "content": "On November 28, it was revealed online that some Chinese students at Moscow State University received a conscription notice. The International Development Department of Moscow State University responded: The above situation was caused by a malfunction of the registration system.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862463738919453087",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 19:53:08",
    "content": "\"There is a powerful motherland behind them\" On November 28, the Chinese Ministry of Foreign Affairs announced that three Chinese citizens who participated in the prisoner exchange between China and the United States have returned to China. According to reports, in addition to the two intelligence officers, there is another person named Jin Shanlin, 26 years old, who was accused of possessing and distributing a large amount of child pornography while studying in the United States. As for why he became the target of the prisoner exchange, Texas court documents show that his family \"has connections with influential people in the Communist Party of China.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862463920818332041",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 19:53:14",
    "content": "On November 28, He Qiang, a professor at the Central University of Finance and Economics, said at an economic forum: It is a good thing for stockholders to be stuck, which can encourage stockholders to pay attention to national affairs and stock market trends. This caused dissatisfaction among netizens. Netizens replied, \"I hope his whole family will be stuck.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862465882167157170",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 20:08:27",
    "content": "On November 29, Zhenxiong County, Yunnan. Zhenxiong County police issued a statement saying that a man named Wu was administratively detained for insulting a government employee named Hong on WeChat. It is reported that when Hong was promoting policies in a group chat, Wu sent him a series of voice insults.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862467740701008362",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 20:08:32",
    "content": "This afternoon, Jack Ma showed up at Alibaba's global headquarters in Hangzhou and took happy photos with a group of people.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862470591309390221",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 20:23:45",
    "content": "\"For your own good\" November 29, Bank of China, Dongguan, Guangdong. The uncle could not use the money in his card, and he complained anxiously: Whose money is this, mine or the president's money? \"Is this disease curable?\" Bank: We need to check the source of the money first.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862473676362588408",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 20:38:58",
    "content": "On November 28, the Chinese Academy of History said: \"The prosperous age of Kangxi and Qianlong\" is beyond doubt, the \"North Asian historical world\" is false, and the \"release\" of the Long March is full of lies.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862475030682292377",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 20:39:04",
    "content": "On November 26, Professor Lao Dongyan commented on the sanitary napkin collapse incident: We have long been conditioned by the environment to lower our expectations, but we are still shocked by the continuous decline in product and service quality, to the point where there is no bottom line at all.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862481189409636627",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 21:09:25",
    "content": "On November 29, Suqian, Jiangsu. Nanchengli Kindergarten held a grand wedding for two alpacas and asked parents to give gifts of no less than 30 yuan. Netizens: How long will it take to hold the full-month banquet? When the alpaca baby is born, there will be a full-month banquet, a hundred-day banquet, a first birthday banquet...",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862487225357017495",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 21:24:38",
    "content": "On November 26, a sticker on the body of a van read \"We stand with Ukraine\" and \"(Russia) give us back our land.\" The video has been deleted. Many netizens expressed their support in the comment section: \"A breath of fresh air in a chaotic world\" and \"Civilization will prevail.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862487889537306812",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 21:39:50",
    "content": "On the evening of November 28, in Kwun Chung, Tsim Sha Tsui, Hong Kong, a young man commemorated the second anniversary of the White Paper Movement.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862488783121162506",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 21:39:56",
    "content": "As early as 2018, an article from China People's Public Security University regarded the act of helping workers to legally defend their rights as \"political infiltration.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862490846022836430",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 21:40:02",
    "content": "November 28 (Released) Bo Guagua, son of former Chongqing Party Secretary Bo Xilai, married Xu Huiyu, granddaughter of the founder of Luodong Boai Hospital. Now the pictures of the wedding are gradually exposed. When Bo Guagua gave a speech, he mentioned his father Bo Xilai and his mother Bo Gu Kailai. Bo Guagua said that they endured humiliation and sacrificed for the people and the overall situation, and talked about taboo topics in the mainland.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862494451538550892",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 21:55:15",
    "content": "On November 29, UNIQLO founder Tadashi Yanai announced that he would not use cotton from China's Xinjiang region. Some netizens said: In this case, we must buy a few pieces to show our support.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862496244452794555",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 22:10:28",
    "content": "",
    "hasPublished": true
  },
  {
    "id": "1862499226242228468",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 22:10:34",
    "content": "Recently, a Taiwanese person posted on Xiaohongshu that \"I found that mainlanders seem to like Taiwanese people very much.\" As a result, some mainland netizens refuted: \"It's because mainlanders are well educated, not you.\" \"Where did you get this illusion? Taiwan is so poor!\" \"You think too much, we love that land, people are free to do whatever they want.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862503084033032454",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 22:25:47",
    "content": "November 29 (Published) Netizens talk about the recent frequent vicious incidents: Every boss who is dragged down, every worker who is owed wages, and every middle-aged person who is crushed by mortgage loans may be a time bomb. The problem is that they appear randomly, so there is no solution. The only way is to solve it from the source, which has nothing to do with us. At present, the post has been deleted and the blogger who posted the picture has been blocked.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862505157378154776",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 22:41:00",
    "content": "Russian Orthodox Patriarch Kirill said that nuclear weapons should not cause fear because \"Christians are not afraid of the end of the world.\" He also thanked Russian scientists for developing \"incredible weapons\" and pointed out that excessive worry about nuclear disasters is \"not good for mental health.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862507863891222803",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 22:56:13",
    "content": "On the 29th, Jiang Zhuojun, a Chinese student who assisted \"Iron Head\" in graffitiing the Yasukuni Shrine, appeared in court in Japan and admitted the charges. According to the charges: In May this year, Jiang, a Chinese national, conspired with his companions to write the word \"toilet\" on the stone pillar of the Yasukuni Shrine with red spray paint, and was therefore charged with the crime of disrespect and destruction of objects. It is reported that Jiang Zhuojun was once a hard-working and motivated international student. He worked in an educational institution to train more international students.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862510799560089694",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 22:56:18",
    "content": "A Russian soldier from the Russian 90600 Unit made a video to commemorate his fallen comrades. The video recorded the time they went to the front line and the time they died. Most of them only lasted a day or two, and some even died on the day they went to the battlefield.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862516654221271401",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 23:26:39",
    "content": "After the boss of Uniqlo's parent company said in an interview that its products did not use cotton from the Xinjiang region, a man in Jiangsu said he would throw away all the Uniqlo clothes at home. He said, \"Why do I feel like a traitor? I have been a traitor for so many years.\" A netizen in Chongqing cut open a Uniqlo down jacket with scissors.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1862522243810804190",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-29 23:41:52",
    "content": "On November 28, a blogger posted a picture with the words \"天下为公\" written on the left and \"Serve the People\" written on the right. As a result, the comment area was flooded with \"天下为公\". Currently, there are only 40 comments left on the post, and most of them have been deleted.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  }
]