[{"id":"1732855837402505371","name":"李老师不是你老师","createdDate":"2023-12-08 04:13:21","content":"Correction\nRegarding the remarks made by Gelonghui founder Gelong on China's artificial intelligence, it is an old news from 2020. He was not banned or had his Weibo account cleared because of this. He apologizes for the misleading information.","images":"/tweet/image/whyyoutouzhele/2023/12/08/1732855837402505371_0.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1732855837402505371_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/oZlaURamTl","accountId":"whyyoutouzhele"},{"id":"1732990889847619650","name":"李老师不是你老师","createdDate":"2023-12-08 13:10:00","content":"On December 6, in Shunping County, Baoding, Hebei, water was sprayed on the street in minus five degrees, causing the road to freeze and many citizens to fall.\n\nIn an interview, the Housing and Urban-Rural Development Bureau said: It was the Environmental Protection Bureau that sprayed it\n\nThe Environmental Protection Bureau said: It was the Housing and Urban-Rural Development Bureau that sprayed it","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/08/1732990889847619650_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/z9JUQpk7xd","accountId":"whyyoutouzhele"},{"id":"1733061097370907003","name":"李老师不是你老师","createdDate":"2023-12-08 17:48:58","content":"On December 7, Weibo celebrity Shuang Boshi said that the government can access WeChat records from five years ago; \nAt the same time, some netizens also said that Tencent also cooperated to open an office of several hundred square meters to receive case officers from all over the country to check data.","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733061097370907003_0.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733061097370907003_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/KzxRFuoslx","accountId":"whyyoutouzhele"},{"id":"1733064836580298927","name":"李老师不是你老师","createdDate":"2023-12-08 18:03:50","content":"Netizen contribution\nHeilongjiang state-owned enterprise Longtang Electric Power Company issued a red-headed document, making risk warnings and management requirements for Apple mobile phones and other devices, requiring employees to sign a letter of commitment not to use Apple devices.","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733064836580298927_0.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733064836580298927_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/Qi1sAlbM4f","accountId":"whyyoutouzhele"},{"id":"1733075210813706730","name":"李老师不是你老师","createdDate":"2023-12-08 18:45:03","content":"Netizen contribution\nIn Wuyi County, Jinhua, Zhejiang, a parent posted that the local government has notified that a points system will be implemented for primary school enrollment, and each public primary school will select the best students based on the points ranking.\nIn addition to the longer you live there, the higher the points you get. You can also get points by donating blood, donating hematopoietic stem cells, and donating to local charities.\nNetizen comments: Children are used as bargaining chips everywhere, no wonder the birth rate has been declining year after year.","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733075210813706730_0.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733075210813706730_1.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733075210813706730_2.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733075210813706730_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/koMgOzYAnA","accountId":"whyyoutouzhele"},{"id":"1733076898459074664","name":"李老师不是你老师","createdDate":"2023-12-08 18:51:46","content":"On December 6, Jerry Kowal, who had disappeared for a year, had his latest move.\nIt is reported that Jerry Kowal sent an open letter to the US State Department, accusing himself of being stigmatized by a report released by the Australian Strategic Policy Institute, a think tank funded by the US government.\nThe report stated that Jerry Kowal was a \"propaganda tool of China.\"\nIn his open letter, Jerry Kowal denied that he was a \"parrot-like foreign propaganda\" and asked the US State Department to stop funding the Australian Strategic Policy Institute.","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733076898459074664_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1733080462732525920","name":"李老师不是你老师","createdDate":"2023-12-08 19:05:56","content":"At the 2023 Global Wealth Management Forum, economist Yao Yudong said that one must work until the end of healthy lifespan and should not stop working until the day one collapses in bed.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/08/1733080462732525920_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/04CVpAGi3O","accountId":"whyyoutouzhele"},{"id":"1733083068473254218","name":"李老师不是你老师","createdDate":"2023-12-08 19:16:17","content":"On December 8, the media reported that a locksmith in Dandong, Liaoning, was killed in an explosion while assisting the police in opening a lock three years ago, and the police insisted that they were not responsible.\nIt is reported that three years ago, a gas explosion occurred in the Poly Phase III Community in Zhenxing District, Dandong City, Liaoning Province, resulting in the death and injury of two police officers from the Zhenxing Public Security Bureau who were on duty. Also lost in the explosion was 55-year-old locksmith Wang Lijun, who was called by the police to open the lock.\nOn July 2 of that year, the farewell ceremony for policeman Lv Heguang was held locally. On that day, Dandong citizens spontaneously came to bid farewell to the hero. When the funeral convoy passed through the city, private car drivers along the way honked their horns at the same time to pay tribute to the hero. However, the wife of locksmith Wang Lijun has been asking for an explanation for her husband for three years since then.","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733083068473254218_0.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733083068473254218_1.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733083068473254218_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1733085352431112425","name":"李老师不是你老师","createdDate":"2023-12-08 19:25:21","content":"On December 6, in Xinyang, Henan, a parent posted a video complaining that at the Xinli Town Central Primary School in Huaibin County, Xinyang City, Henan Province, teachers were in a hurry to get off work at noon and threw away the food before the students had eaten enough.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/08/1733085352431112425_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/slN1JWArkG","accountId":"whyyoutouzhele"},{"id":"1733086364256632905","name":"李老师不是你老师","createdDate":"2023-12-08 19:29:23","content":"December 7, Guangxi.\nA series of rear-end collisions occurred on the 1302 section of Quannan Expressway from Laibin to Liuzhou. According to preliminary statistics, the accident caused 27 vehicles to rear-end and 6 people were trapped. All the trapped people at the scene have been rescued, and it has been confirmed that 2 people died and 4 people were injured.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/08/1733086364256632905_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/DS6xA9wMnc","accountId":"whyyoutouzhele"},{"id":"1733086733187624996","name":"李老师不是你老师","createdDate":"2023-12-08 19:30:51","content":"On December 7, a technology company in Jiangsu recruited foreign trade assistants. The recruitment information clearly required \"from the countryside, introverted personality\", which triggered complaints from netizens. \nThe person in charge of the company responded, \"We are not satisfied with city people. Foreign trade work is very hard and city people are too delicate to bear the hardship. \nWe don't want to waste all our efforts just after recruiting them. We prefer children from rural areas.\" At the same time, he also said that because the job does not allow mistakes, extroverts are not needed. Basically, there are scientific researchers here. Scientific research requires carefulness and introversion.","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733086733187624996_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1733087295048184266","name":"李老师不是你老师","createdDate":"2023-12-08 19:33:05","content":"On December 5, Shantou Olive TV claimed that the Shantou Central Blood Station was in urgent need of O-type blood and called on citizens to actively donate blood. However, netizens in the comment section collectively mocked","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733087295048184266_0.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733087295048184266_1.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733087295048184266_2.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733087295048184266_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/bc1l3wbDJx","accountId":"whyyoutouzhele"},{"id":"1733088763625050356","name":"李老师不是你老师","createdDate":"2023-12-08 19:38:55","content":"Recently, some netizens found that the Douyin account of Liu Jipeng, dean of the Capital Finance Research Institute of China University of Political Science and Law, showed that \"the user was banned from following for violating community regulations.\"\nPreviously, Liu Jipeng called on the Chinese stock market to establish a fair and just stock market\n\"It is not a simple quantitative trading problem, but a problem in the system\"","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733088763625050356_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/bR4jQoY1xJ","accountId":"whyyoutouzhele"},{"id":"1733089045394149533","name":"李老师不是你老师","createdDate":"2023-12-08 19:40:02","content":"On December 6, the Lulanshan Village Committee in Zhaoqing, Guangdong issued a notice: villagers over the age of 16 will receive land acquisition pensions, about 0.5 yuan per person per month for 1,044 people.\n\"A total of 6.7 acres of land was acquired in Lulanshan, with a total pension of 66,277 yuan. 1,044 villagers over the age of 16 were publicly announced, about 63 yuan per person. The pension will be directly transferred to personal accounts by the Human Resources and Social Security Bureau in 139 months, about 0.5 yuan per person per month.\"","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733089045394149533_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/nT08jx7imJ","accountId":"whyyoutouzhele"},{"id":"1733089153485504979","name":"李老师不是你老师","createdDate":"2023-12-08 19:40:28","content":"On the evening of December 6, Xi'an Metropolitan Express held a live broadcast with the theme of \"Banned Fireworks and Firecrackers, Safety in Mind\", during which two police chiefs came to the live broadcast room to educate netizens about the pros and cons of setting off firecrackers.\nThe result caused a lot of complaints from netizens in the comment area.\nSubsequently, amid the complaints and abuses of many netizens, the live broadcast room closed the comment function.","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733089153485504979_0.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733089153485504979_1.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733089153485504979_2.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733089153485504979_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/WTUmFQ5w2y","accountId":"whyyoutouzhele"},{"id":"1733094053972005217","name":"李老师不是你老师","createdDate":"2023-12-08 19:59:56","content":"On the evening of December 7, a netizen posted a message and @Shaanxi Public Security and Shaanxi Internet Police, saying that a netizen named \"Don't be moved 999\" threatened her in a private message that he would check her personal ID and open records, and later told her that he had already found it.\nThe netizen who posted the message said that the netizen \"Don't be moved 999\" was suspected to be a police staff member, and posted a photo that he had posted before, showing items such as police numbers, chest badges, and shoulder badges, with the words \"Shaanxi police\" printed on the chest badge.\nAccording to the description of some netizens, the netizen \"Don't be moved 999\" is a fan of a celebrity named Yu, and he had an argument with the netizen who posted the message online because of defending his idol.\nAt 23:36 on December 7, the Xi'an Yanliang Branch responded that the inspection department of the bureau had launched an investigation.","images":"/tweet/image/whyyoutouzhele/2023/12/08/1733094053972005217_0.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733094053972005217_1.jpg,/tweet/image/whyyoutouzhele/2023/12/08/1733094053972005217_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1733096025596776760","name":"李老师不是你老师","createdDate":"2023-12-08 20:07:46","content":"On December 7, Kuang Guiying took her daughter to the Dongfeng Road Orthopedic Hospital for orthopedic treatment. When passing the gate of the provincial government, several policemen suddenly appeared and pulled Kuang Guiying to the boundary of the provincial government for safety. Then people from Yuexiu Hongqiao Police Station came and forcibly pulled Kuang Guiying into the police car.\nDuring the struggle, her mobile phone was also snatched away by the police. She was taken to Yuexiu Public Security Bureau and detained for more than three hours.\nUnexpectedly, Kuang Guiying's mobile phone recorded a conversation suspected to be with the police from Yuexiu Public Security Bureau.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/08/1733096025596776760_0.jpg","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1733097210240209044","name":"李老师不是你老师","createdDate":"2023-12-08 20:12:28","content":"https://t.co/5H2KBXUzNn","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/08/1733097210240209044_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/5H2KBXUzNn","accountId":"whyyoutouzhele"},{"id":"1733104902325358794","name":"李老师不是你老师","createdDate":"2023-12-08 20:43:02","content":"On December 8, a woman in Wuhan reported her ex-husband Tang Moumou, chief physician of pancreatic surgery at Wuhan University People's Hospital and professor at Wuhan University, for soliciting prostitution and keeping mistresses all year round, gambling all night long, ignoring the surgery of patients the next day, causing multiple medical accidents, accepting medical kickbacks from drug dealers, and being sexually perverted, which aroused concern.\nOn the afternoon of December 8, a staff member of the Publicity Department of Wuhan University responded: \"The school has been informed of the report, and the school's Discipline Inspection Commission will intervene in the investigation.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/08/1733104902325358794_0.jpg","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"}]