[{"id":"1846956523639263595","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-18 00:48:44","content":"Reported on October 17, Shenyang. Anchor Li Moumou said that he bought a batch of Chinese cultural relics lost overseas in Southeast Asia, but he offended a mysterious Japanese family and was hunted down. He was unable to bring the antiques back to China. Li Moumou used the slogan of \"protecting China\" to ask for help. Patriotic fans buy the antiques and recycle them at a high price when they return home. After investigation, the police found that the antiques he sold were actually cheap handicrafts. Li Moumou and his accomplices made illegal profits of more than 700,000 yuan, and are currently under criminal detention.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/18/1846956523639263595_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846976631661121602","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-18 02:08:38","content":"On October 16, Japanese media reported that 28-year-old Chinese man Wu Bingquan was arrested by the police. On December 1 last year, he went to a private school in Arakawa District, Tokyo, and took out a pair of female students' leather shoes from the shoe cabinet, sprinkled his body fluids on the shoes, and then threw the shoes nearby and left. The police found him through the camera, and during the interrogation, he confessed, \"I like women's shoes.\"","images":"/tweet/image/whyyoutouzhele/2024/10/18/1846976631661121602_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/18/1846976631661121602_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846994408501399822","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-18 03:19:17","content":"On October 17, it was reported that my country's population has experienced negative growth, and a new round of sampling survey on population and family development has been launched: a comprehensive analysis of the reasons why people do not want to have children or dare not have children will be conducted. Netizens responded, \"Because they are poor, they cannot afford to have children,\" \"Debts, no house, no savings, no stable income\"","images":"/tweet/image/whyyoutouzhele/2024/10/18/1846994408501399822_0.jpg,/tweet/image/whyyoutouzhele/2024/10/18/1846994408501399822_1.jpg,/tweet/image/whyyoutouzhele/2024/10/18/1846994408501399822_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/18/1846994408501399822_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]