[{"id":"1815783429650448502","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 00:17:59","content":"On the evening of July 23, the Changning District police issued a notice saying that the video did not reflect the full picture of the facts.\nThe police said that during the dispute, the delivery man threatened the auxiliary police with a long knife. The auxiliary police prevented the delivery man from escaping, so they took the delivery man's mobile phone and pulled out the car keys. Then, as seen in the video, he was beaten by the delivery man.\nThe delivery man was administratively detained for 15 days in accordance with the law for beating others and illegally carrying a controlled knife.","images":"/tweet/image/whyyoutouzhele/2024/07/24/1815783429650448502_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1815871934728470900","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 06:09:41","content":"Ma Jun, a professor at the National Defense University of the People's Liberation Army, denounced PLA Major General Zhu Chenghu's remarks that \"sacrificing the land east of Xi'an to fight a nuclear war with the United States\" and Li Yi's remarks that \"140 million yuan is not too much to liberate Taiwan.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/07/24/1815871934728470900_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816011802964332581","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 15:25:28","content":"Recently, in Wanda Plaza, Jiuquan, Gansu, a man insulted a cosplayer because he was not used to the strange costumes. The staff who stepped forward to stop him were beaten. The man in black had blood on his head and the woman was slapped to the ground. After the police arrived, the man still shouted arrogantly, \"As long as we don't die, culture can't invade.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/07/24/1816011802964332581_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816012407971381745","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 15:27:52","content":"On July 23, Jinzhou Village in Nansha District, Guangzhou, announced the implementation of a \"points system\" for residents.\nThe announcement showed that members of the Communist Party of China, those who joined the army, donated blood, and participated in various patriotic activities could receive extra points. Those who incited and organized collective petitions, petitioned higher authorities, and held extravagant weddings and funerals would be deducted points.\nThe points will be used as a reference for joining the party and applying for financial subsidies, and villagers with negative points will be disqualified from being evaluated for excellence.","images":"/tweet/image/whyyoutouzhele/2024/07/24/1816012407971381745_0.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816012407971381745_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816015062055915574","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 15:38:25","content":"July 22, Anhui. A delivery guy cried on the ground after delivering the wrong food. The man sent the food back and spit on him. Photographer: The delivery guy just graduated from high school.\nJuly 24 (Released) Wuhan, Hubei. Because the order was overdue, the delivery guy wanted to enter the community first, and then come out to register, but was \"locked\" by the security guard. His colleagues who couldn't bear it said, \"Is this a dog? It should be locked like this. This is a person.\"","images":"/tweet/image/whyyoutouzhele/2024/07/24/1816015062055915574_0.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816015062055915574_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/07/24/1816015062055915574_0.jpg,/tweet/video/whyyoutouzhele/2024/07/24/1816015062055915574_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816016703626551517","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 15:44:56","content":"On July 23, the TV series \"Zero Day Attack\" released a 17-minute pilot. The plot is set against the backdrop of the Taiwan Strait War. It tells the story of the Chinese People's Liberation Army blockading Taiwan on the grounds of lost contact with military aircraft and launching an attack. In the seven days before, Taiwan faced a series of problems including financial chaos, international evacuation of overseas Chinese, shutdown of public facilities, cognitive warfare, and political intrigue.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/07/24/1816016703626551517_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816017168653590979","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 15:46:47","content":"July 23, Handan, Hebei. Netizens said that a man riding a bicycle without a helmet ran a red light and almost collided with another car. The other party then pulled the owner off the bike and strangled him.\nAs of now, the video posted by the original author has been deleted.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/07/24/1816017168653590979_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816019519875289088","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 15:56:08","content":"Today marks the first anniversary of the CPC Central Committee Political Bureau's proposal to boost investor confidence.\nOne year later, the A-share sell-off hit a six-month high, falling below 2,900 points again, creating a new low since February 22, 2024.","images":"/tweet/image/whyyoutouzhele/2024/07/24/1816019519875289088_0.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816019519875289088_1.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816019519875289088_2.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816019519875289088_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816027080921948173","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 16:26:10","content":"Around 13:30 on July 24, a graduate student at the Xinhua Campus of Inner Mongolia Medical University jumped off a building.\nThe Graduate School then quickly instructed the class monitor to inform students not to spread pictures or videos at will.","images":"/tweet/image/whyyoutouzhele/2024/07/24/1816027080921948173_0.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816027080921948173_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816028824456597862","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 16:33:06","content":"July 22, Lu'an, Anhui. Teacher Wang Yonghui of Hekou Middle School in Huoqiu County sent a message to a student on WeChat, saying \"You are my life, I love you, and you will always be in my heart.\" On July 23, Huoqiu County Education Bureau: Ordered to remove him from office, and handed over the clues to the Commission for Discipline Inspection.","images":"/tweet/image/whyyoutouzhele/2024/07/24/1816028824456597862_0.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816028824456597862_1.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816028824456597862_2.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816028824456597862_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816029332474593550","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 16:35:07","content":"July 24 (Released) Yanbian Korean Autonomous Prefecture, Jilin. A woman was stopped from filming the city management law enforcement. The woman said that this is the freedom of every Chinese citizen.\nThen the city management said: \"What is your freedom for?\" and accused \"You don't have the power to pursue me, who are you?\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/07/24/1816029332474593550_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1816034787146309752","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-24 16:56:48","content":"Bloomberg reported on July 22 that more and more pension target funds in China are frequently liquidated due to their inability to attract enough investment funds.","images":"/tweet/image/whyyoutouzhele/2024/07/24/1816034787146309752_0.jpg,/tweet/image/whyyoutouzhele/2024/07/24/1816034787146309752_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]