[{"id":"1846598335991632088","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 01:05:26","content":"Video supplement:\nThe video shows that the man threw down one of the traffic policemen and attacked the traffic policeman's neck with a weapon.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846598335991632088_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846629167825367337","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 03:07:56","content":"October 16, Hangzhou, Zhejiang. Zhongrong Trust collapsed, and investors knelt down to defend their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846629167825367337_0.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846629167825367337_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846642890967265392","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 04:02:28","content":"China Cyberspace Security Association: Intel products should be systematically investigated for cybersecurity risks.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846642890967265392_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846642890967265392_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846642890967265392_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846648359085387880","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 04:24:12","content":"On October 16, a Henan village bank depositor went to Kaifeng New Oriental Village Bank and found that the deposit balance in his online banking account was clearly visible, but was inexplicably set to \"only in, no out\". The bank staff remained silent, refused to process deposit withdrawals, refused to explain why the deposits were \"only in, no out\", and could not produce any deposit freezing procedures from any department.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846648359085387880_0.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846648359085387880_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846650913563541647","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 04:34:21","content":"October 16 (Release), Nanchang Economic Development Zone, Jiangxi Province, since last year, the local AUX factory has continued to emit toxic and harmful gases, causing the surrounding air to be unbearable. Many residents have experienced nosebleeds, sore throats, retching, dizziness and other symptoms. Although local residents have reported the situation through various legal channels, the problem has not been resolved so far. It is reported that there are many residential areas and universities, middle schools and primary schools next to the factory, which is a densely populated area.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846650913563541647_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846650913563541647_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846650913563541647_2.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846650913563541647_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846650983751036983","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 04:34:38","content":"On October 16, a murder occurred in Shenqiu County, Zhoukou City, Henan Province, leaving a message stating that three people were killed.\nRegarding the murderer's motive, there are currently rumors that it was a murder of love, but the true situation remains to be verified. An investigation letter circulated online showed that a criminal case occurred in Huaidian Town, Shenqiu County on October 16, 2024, and the suspect drove away. ","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846650983751036983_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846650983751036983_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846650983751036983_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846650983751036983_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846652337659531460","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 04:40:01","content":"The buyer is a fraudster and the seller is also a fugitive, and they are still being “recovered”?","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846652337659531460_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846652337659531460_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846652337659531460_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846656665317212354","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 04:57:12","content":"On October 16, Huang Chunfa, a businessman from Fujian, published a \"thank you letter\" on his WeChat public account, \"thanking\" himself for being detained in Shangrao Detention Center in Jiangxi for 5 years.\nIn the article, the businessman said that his case was clearly investigated by the procuratorate and returned because of insufficient evidence, but in the end he was still prosecuted under some unknown pressure. After being prosecuted, the court still acquitted him, but the detention center refused to grant bail.\nThe businessman said, \"The detention center is good. I don't need to worry about business operations, let alone weight loss. My physical fitness has greatly improved. Such a regular life is really something that billions of assets can't buy. I especially want to invite leaders of the Shangrao Municipal Political and Legal System to come in and eat and live with me for a few years. I guarantee that you will all be in good health and eat delicious food. Leaders of Shangrao, if you don't come now, it will be too late and you won't be able to grab a seat.\"","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846656665317212354_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846656665317212354_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846656665317212354_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846657423286681680","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 05:00:13","content":"October 16 (released), in August this year, the Organization Department and the Ministry of Human Resources and Social Security of Guangdong Province issued a notice announcing that college graduates who have completed the \"Three Supports and One Assistance\" (supporting medical care, education, agriculture and rural revitalization) will no longer enjoy extra points for the examination. Some local recruitments have even issued recruitment instructions, confirming that the \"Three Supports and One Assistance\" extra points are valid, but before the exam, it was stopped by the provincial department and notified that candidates could not get extra points.\nMany students who chose to participate in the \"Three Supports and One Assistance\" project two years ago have now ended up with nothing, wasting two years of youth, and it is no longer attractive to find a job in private enterprises, facing the dilemma of unemployment.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846657423286681680_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846657423286681680_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846657423286681680_2.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846657423286681680_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846657904473977028","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 05:02:08","content":"https://t.co/QlmnSEHctz","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846657904473977028_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846657904473977028_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846657904473977028_2.jpg,","videos":"","hasPublished":true},{"id":"1846668750101070025","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 05:45:14","content":"On October 16, a netizen posted that all employees of Zhuhai Pengqi Technology Co., Ltd. worked without rest for 37 days and \"did not receive overtime pay or compensatory leave.\" The netizen said that even cattle and horses could not bear such use. According to Red Star News, staff of the Human Resources and Social Security Bureau of Xiangzhou District, Zhuhai City, said that they had notified the labor inspection department to investigate and verify whether the company had violated the law.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846668750101070025_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846668750101070025_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846668750101070025_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846672550362747219","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 06:00:20","content":"The farm owner used Gatling fireworks to drive away villagers who stole corn. On the evening of October 15, after a large machine harvested corn in Qishan County, Baoji City, Shaanxi Province, some people went to the field to grab corn. The farm owner drove a pickup truck into the field and set up Gatling fireworks on the truck. The fireworks sprayed at the crowd picking up corn, and the crowd evacuated to the edge of the field. From the video, some of the people were elderly people. The video poster said it was a \"helpless move.\" The video shows that villagers followed the harvester to pick up corn at around 6 o'clock in the morning. Many farmers complained that they worked hard to grow crops, but all the corn that fell on the ground was picked up, and the harvest was affected. \"","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846672550362747219_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846672550362747219_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846673592655761845","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 06:04:28","content":"On October 16 (released), Beijing Urban Construction Group's Chengtai Fund and Zhongshi Fund collapsed. On October 11, hundreds of employees gathered at the headquarters to demand repayment, which lasted until the afternoon when more than 100 police and security guards came to the scene. According to netizens, the two funds stopped paying all matured products from June 25, involving more than 500 internal employees and an amount of more than 700 million yuan. Netizens mentioned that the collapse was not caused by market risk factors, but by human illegal and irregular factors.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846673592655761845_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846673592655761845_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846673592655761845_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846673592655761845_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846673597143646306","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 06:04:29","content":"https://t.co/lfOZg6DJlU","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846673597143646306_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846673597143646306_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846673597143646306_0.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846673597143646306_1.jpg,","hasPublished":true},{"id":"1846673943752769971","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 06:05:52","content":"Did the Intel incident originate from the information collected during the development of intelligent driving? On October 16, the Ministry of State Security announced that a domestic company cooperated with a foreign company to carry out research on intelligent driving of automobiles. The test vehicle was integrated with high-tech surveying and mapping equipment, and the data collected was in a private format that the competent industry department could not read with common software. Under the guidance of the foreign party A, the surveying and mapping data was transferred out of the country, which violated the responsibility of confidentiality management of surveying and mapping data. The national security agency investigated the case and punished the company involved and the relevant responsible personnel. It is said that this matter was the cooperation between NavInfo and Mobileye, a subsidiary of Intel, in 2018.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846673943752769971_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846673943752769971_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846673943752769971_2.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846673943752769971_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846674690481225776","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 06:08:50","content":"On the evening of October 16, NavInfo issued an announcement denying any connection with what was stated in the Ministry of State Security's notice.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846674690481225776_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846674690481225776_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846679578104025204","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 06:28:15","content":"The boy was bullied, and the adults around him turned a blind eye. On October 13, Yulin, Guangxi. A boy was playing outside when two other boys pulled his hair, pushed him to the ground, punched and kicked him. After he stood up, he was thrown hard, causing the boy to faint. During this period, two adults were present but did not stop them. The boy fainted and fell to the ground for ten minutes, but no one stepped forward. According to the parents, the child currently has brain concussion and multiple injuries.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846679578104025204_0.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846679578104025204_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846681705970577871","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 06:36:43","content":"On October 16, the Wall Street Journal revealed that Xi Jinping suddenly turned to stimulating the economy because he could no longer tolerate the bad news that came one after another. However, Xi Jinping's policy shift this time is still tactical rather than strategic.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846681705970577871_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846681705970577871_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846681705970577871_2.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846681705970577871_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846689587424289190","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 07:08:02","content":"Follow-up of the girl beaten in Shanxi: The girl’s father “Open-minded Life” has deleted the above video and re-released a video statement: “The incident was handled that night. Seven classmates, accompanied by their parents, apologized to my daughter. I do not plan to pursue any responsibility from the school and relevant departments.” The father of the beaten girl also responded in the comment section about whether he received compensation: “I didn’t ask for a penny, and they didn’t ask for compensation.”","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846689587424289190_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846689587424289190_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846690151289725230","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 07:10:16","content":"On October 17 (posted), netizens submitted that Harbin Mingwan Trading Company brainwashed the elderly in the name of health and sold health products. The company's main product, graphene physiotherapy photon bed, is extremely expensive, but has no therapeutic effect. According to netizens, the company also cooperated with many beauty salons to practice medicine illegally and gave some injections to beauty salon customers. It is reported that on June 24, the company continued to operate without passing the inspection of the Market Supervision Administration, and on October 10, it supplemented the operating qualification of a Class II device.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846690151289725230_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846690151289725230_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846690151289725230_0.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846690151289725230_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846690430437540318","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 07:11:23","content":"https://t.co/5UmmKB2LIi","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846690430437540318_0.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846690430437540318_1.jpg,","hasPublished":true},{"id":"1846702672822391282","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 08:00:01","content":"October 15, Beijing. Well-known fashion designer Rick Owens and his team members were kicked out of the Forbidden City because of their weird costumes. The team members expressed their disappointment about this matter on Instagram. Some people in the comment area of Xiaohongshu believe that museums should not interfere with tourists' freedom of dress, but others believe that the team's move is a blasphemy against culture.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846702672822391282_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846702672822391282_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846702672822391282_2.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846702672822391282_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846709712294695160","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 08:28:00","content":"The second landlord absconded with the money? Recently, in Xitang Huayuan, Hangzhou, Zhejiang, a real estate agency absconded with about 4 million yuan from the landlord and tenant. A staff member of the Xitang Yayuan Community Residents Committee said that the agency signed the contract with the landlord in his personal name and then sublet it to other people. Previously, some landlords in the community contacted the agency because they did not receive the rent when it was due, and found that the phone was not connected. Later, other similar situations occurred. As of now, a total of fifty or sixty tenants have registered in the community. Some tenants have been affected and asked to move out by the landlord. At present, the police station is following up on this matter.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846709712294695160_0.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846709712294695160_1.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846709712294695160_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846716507142676727","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 08:55:00","content":"October 16, Chengdu, Sichuan. A programmer born in the 1990s recently invested 1 million yuan in the stock market and lost 320,000 yuan in 4 days of stock trading, which attracted attention. On the 16th, the programmer announced that he had lost 480,000 yuan so far and was planning to stop updating because he was too tired.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846716507142676727_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846716507142676727_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846717770005725255","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 09:00:01","content":"On October 12, a girl from Anhui Huaibei No. 12 Middle School fainted while running during a physical education class. It is suspected that the school thought the girl did not want to run, so they left her alone for ten minutes after she fell to the ground and did not provide timely medical treatment, resulting in her death. After the accident, the school has been trying to suppress public opinion and prevent the spread of the news, requiring teachers and students to delete the video text on social media. On October 14, the local education bureau issued an announcement stating that the teacher on the scene provided timely medical treatment, which attracted a lot of doubts from netizens. It is reported that Huaibei City deployed 34 AEDs in September, and the local Red Cross also conducted training. No. 12 Middle School is one of them.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846717770005725255_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846717770005725255_1.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846717770005725255_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846718938597445697","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 09:04:39","content":"On October 15, Douyin blogger \"Auntie Lori\" posted a video saying that she encountered a Russian soldier while traveling in Russia. The Russian soldier told her that he was going to Ukraine to fight. The blogger felt very sympathetic and sad, but she did not expect that she would be sexually harassed by the Russian soldier. She was touched on the buttocks, and the girl traveling with her was hugged by the waist. According to the blogger, she did not see any shame or fear in the soldier's eyes.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846718938597445697_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846724560508563943","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 09:27:00","content":"Many kindergartens in Xuzhou have run away with the money. On October 14, Quanshan Meishu Kindergarten in Xuzhou, Jiangsu Province suddenly closed down and refused to refund the fees. Some parents lay on the ground to defend their rights. Searching Weibo and Twitter, it was found that many kindergartens in Xuzhou have \"run away\" in succession in recent days.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846724560508563943_0.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846724560508563943_1.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846724560508563943_2.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846724560508563943_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846732866786677027","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 10:00:00","content":"On October 16, someone at the entrance of Guangzhou Zhujiang Investment used a loudspeaker to shout, \"Zhujiang Investment, give me back my hard-earned money.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/17/1846732866786677027_0.jpg,/tweet/video/whyyoutouzhele/2024/10/17/1846732866786677027_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1846740666451165494","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-17 10:31:00","content":"Nezha Auto owes wages? On October 16, a netizen who was certified as an employee of Nezha Auto said on social media that Nezha’s salary was not paid normally last month and the company owed a lot of money to suppliers. He advised everyone to be cautious when buying Nezha Auto. Nezha Auto responded that the salaries of front-line employees have been paid, and the middle and senior management are doing equity optimization and salary structure adjustment. The rights must be confirmed before the IPO, so some salaries are paid a little slower.\nIn early September this year, some media reported that Chen Rui, CFO (Chief Financial Officer) of Nezha Auto, was exposed to have resigned recently. Former Goldman Sachs (Asia) Managing Director Pan Deng replaced Chen Rui and was responsible for Nezha’s financial work.","images":"/tweet/image/whyyoutouzhele/2024/10/17/1846740666451165494_0.jpg,/tweet/image/whyyoutouzhele/2024/10/17/1846740666451165494_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]