[
  {
    "id": "1765770001967890637",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 00:02:29",
    "content": "Wanlian Network reported on March 1 that recently, Baotou Yulun Steel Trading Co., Ltd. received advance payments from many traders on the grounds of collecting winter storage resource orders, but did not pay the steel mills for orders, and is now unable to deliver goods normally. According to market news, the funds involved in the case are currently more than 100 million.\nIn addition, Sichuan Steel Trade also faces the risk of thunderstorms. Baoen Jiachuang, Shuigang's agent in Chengdu, has suffered a large loss this year. It is reported that the company has pre-collected 20,000 tons of payment from customers for this winter storage. The batch of winter storage resources is scheduled to be delivered at the end of March, but the company's actual inventory is only about 10,000 tons. Now there is a shortfall of 10,000 tons of goods from customers, and the direct loss is about 40 million.\nIn the words of a famous entrepreneur in the industry, the steel industry has entered an ice age. In recent years, the impact of factors such as the downturn in the real estate industry, the epidemic disturbance, and the strengthening of the US dollar have caused the center of gravity of steel prices to gradually shift downward. Therefore, since last year, the steel trade market has faced risks such as falling steel frames, declining sales, and difficulties in capital turnover...",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/08/1765770001967890637_0.jpg",
    "hasFullContentTranslated": false,
    "fullContent": "万联网在3月1日报道，近日，包头市玉仑钢铁贸易有限责任公司以收取冬储资源订货为由，收受多家贸易商预付款，但未交款至钢厂订货，现无法正常交货。据市场消息传闻，目前涉案资金达一个多亿。\n 此外，四川钢贸也出现暴雷风险，水钢在成都的代理商宝恩嘉创今年出现大额亏损。据悉，本次冬储该公司累计预收了客户2万吨的货款，该批冬储资源约定3月底交货，但该公司实际库存只有1万吨左右。现差客户1万的货，直接损失约4000万左右。\n 用行业著名企业家的话说，钢铁行业进入了冰河期。近年来房地产行业下行、疫情扰动、美元走强等因素冲击，导致钢价运行重心逐渐下移，因此去年至今，钢贸市场面临钢架下跌、销量下行、资金周转困难等危机，市场陆续集中爆出了一批进入破产清算的钢贸企业。给大家的资金安全再度敲响警钟。",
    "hasPublished": true
  },
  {
    "id": "1765770961163329591",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 00:06:18",
    "content": "Industry blogger tells about the explosion of steel trade circle",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/08/1765770961163329591_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765773196001767808",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 00:15:11",
    "content": "Submissions from students of the High School Affiliated to Hubei University\nSince November last year, food safety problems have frequently occurred in the canteen of the Middle School Affiliated to Hubei University. Students have eaten plastic wrap, gloves, broken wooden sticks, etc. from the school meals, and some even ate a nail from the school meals.\nSome students raised concerns about food safety in the cafeteria to the campus wall, but were threatened and pressured by school leaders. The campus wall also deleted some of the posts due to pressure. A student previously posted a message on the campus wall encouraging other students to actively report canteen issues on the mayor’s hotline. However, the post was deleted when I checked it this morning.\nStudents said that the school's attitude has made us students intolerable, and the school's food safety issues have risen to the point of threatening students' health.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/08/1765773196001767808_0.jpg,/tweet/image/whyyoutouzhele/2024/03/08/1765773196001767808_1.jpg,/tweet/image/whyyoutouzhele/2024/03/08/1765773196001767808_2.jpg,/tweet/image/whyyoutouzhele/2024/03/08/1765773196001767808_3.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765862122523591114",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 06:08:32",
    "content": "To this day, people still ask me for questioning because of me every day.",
    "images": "",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766055125628367016",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 18:55:28",
    "content": "On March 8, the Guangxi Women's Federation issued the \"Decision of the Autonomous Region Women's Federation on Commendation of Guangxi March 8 Red Flag Bearers in 2023\", but the entire document was about Xi Jinping.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/08/1766055125628367016_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766062955186061606",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 19:26:35",
    "content": "On March 8, at Changsha Jingwu Longines Hill, a woman drove a white car and accelerated into a student crossing a zebra crossing.\nWhen questioned by the police afterwards, the woman claimed that she was being controlled by the brain.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/08/1766062955186061606_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766069823656661000",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 19:53:52",
    "content": "At present, a parent said that she only received this video and received a call from the police asking her not to save the video. Do not spread it before the official release to avoid being used by criminals. So far, the official has not reported this matter.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/08/1766069823656661000_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766069971145138602",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 19:54:27",
    "content": "https://t.co/5A4jDKiln5",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/08/1766069971145138602_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1766073581056799095",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 20:08:48",
    "content": "https://t.co/v00TLoEPCJ",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/08/1766073581056799095_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1766074200974860707",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 20:11:16",
    "content": "On March 7, a passenger bus and a semi-trailer collided on National Highway 321 in Gulin, Luzhou, Sichuan. Many people were injured. The video showed that the front of the semi-trailer was seriously damaged, and the front windshield of the passenger bus was cracked and deformed and stopped on the side of the road. The reporter learned from the local traffic police department that the drivers of both vehicles have escaped danger. The injured are receiving medical treatment and no one has died.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/08/1766074200974860707_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766075251073401030",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 20:15:26",
    "content": "On the evening of March 7, Lao Dongyan, a professor at the Law School of Tsinghua University, wrote an article lamenting recent events: an anti-intellectual culture is spreading rampantly, reminiscent of the Khmer Rouge.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/08/1766075251073401030_0.jpg,/tweet/image/whyyoutouzhele/2024/03/08/1766075251073401030_1.jpg,/tweet/image/whyyoutouzhele/2024/03/08/1766075251073401030_2.jpg,/tweet/image/whyyoutouzhele/2024/03/08/1766075251073401030_3.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766076605154136280",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 20:20:49",
    "content": "Friends who want to learn about the Khmer Rouge can read \n",
    "images": "",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766084223998284221",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 20:51:05",
    "content": "\"Unstoppable\"\nOn March 7, Hu Xijin wrote about the recent \"Nongfu Spring\" incident. He said that using \"patriotism\" in this way is too vulgar and ridiculous, and it is an insult to patriotism. \"Old Hu firmly opposes firing such political poison arrows at any company\"\nAfter the article was published, Hu Xijin was attacked by a large number of netizens, and some netizens even called Hu Xijin a traitor. As of the time of posting, the article has been deleted.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/08/1766084223998284221_0.jpg,/tweet/image/whyyoutouzhele/2024/03/08/1766084223998284221_1.jpg,/tweet/image/whyyoutouzhele/2024/03/08/1766084223998284221_2.jpg,/tweet/image/whyyoutouzhele/2024/03/08/1766084223998284221_3.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766095645113274610",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 21:36:28",
    "content": "March 8 (Release), Dongxing, Guangxi. Some citizens knelt down and begged to see the mayor because of property issues.\nA man who participated in the rights protection shouted loudly, \"Is this the people's country? Will it let the people live? Is the mayor of Dongxing so awesome? Is it so difficult to meet him?\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/08/1766095645113274610_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766104231948275927",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 22:10:36",
    "content": "March 7, Jining, Shandong. The government forcibly expropriated farmland in Shanglan Village to build a road. The local villagers disagreed with the government's compensation of 16,000 yuan per mu of land, so the construction team brought people to force the construction. During the period, the villagers and the construction party had a dispute and shoving. Afterwards, the villagers took turns to stand guard over the grain fields.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/08/1766104231948275927_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766124192959766635",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 23:29:55",
    "content": "Recently, Shanghai Yangpu District Ocean Fisheries Co., Ltd. defaulted on social security payments to its employees, and the employees went to the building of the company's shareholder, Shanghai Fisheries Group Co., Ltd., to defend their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/08/1766124192959766635_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1766128941469950390",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-08 23:48:47",
    "content": "March 8, Hohhot No. 2 Middle School",
    "images": "/tweet/image/whyyoutouzhele/2024/03/08/1766128941469950390_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]