[
  {
    "id": "1888987137283887479",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-11 00:23:23",
    "content": "On February 10, the Financial Times reported that Changxin Memory, China's leading memory chip producer, is teaming up with DeepSeek to rapidly erode the market share of Samsung and SK Hynix. The company is also leading China into the market for high-bandwidth memory (HBM), a key component for running artificial intelligence. Its \"snowball-like\" growth threatens the dominance of Korean chips.\n\nAnalysts pointed out that since 2023, Changxin Memory has exploited a loophole in US export controls that has enabled it to use advanced US chip manufacturing equipment to help produce its most cutting-edge chips. The company was also removed from the latest blacklist by the US Department of Commerce last year, which prohibits any US company from doing business with it. Jimmy Goodrich, senior consultant for technology analysis at Rand Corporation Research, said: \"Even now, it is not entirely clear whether CXMT is subject to any restrictions.\"",
    "images": "/tweet/image/whyyoutouzhele/2025/02/11/1888987137283887479_0.jpg,/tweet/image/whyyoutouzhele/2025/02/11/1888987137283887479_1.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 76,
    "replies": 20,
    "retweets": 12,
    "views": 24400,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1888992325977686225",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-11 00:44:00",
    "content": "On February 10, Lianhe Zaobao reported that due to the power outage in Thailand, the Burmese ethnic local armed group that controls the Karen State in Myanmar ordered the Chinese who run casinos and catering businesses in the area to leave by the end of this month at the latest, and announced a ban on Chinese from entering towns. … https://pbs.twimg.com/media/GjcLe-qWYAAXTjx.jpg",
    "images": "/tweet/image/whyyoutouzhele/2025/02/11/1888992325977686225_0.jpg,/tweet/image/whyyoutouzhele/2025/02/11/1888992325977686225_1.jpg,/tweet/image/whyyoutouzhele/2025/02/11/1888992325977686225_2.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 71,
    "replies": 12,
    "retweets": 5,
    "views": 16633,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1888997165646680270",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-11 01:03:14",
    "content": "DeepSeek, a Chinese AI big model, recently announced a substantial price increase.\nAccording to DeepSeek's official website, the preferential price of its V3 model API service has ended. Starting from February 9, the price of each million input tokens will increase from 0.1 yuan (cache hit)/1 yuan (cache miss) to 0.5 yuan (cache hit)/2 yuan (cache miss). The output token will increase from 2 yuan per million to 8 yuan. https://pbs.twimg.com/media/GjcPIy6WIAA2RNW.jpg",
    "images": "/tweet/image/whyyoutouzhele/2025/02/11/1888997165646680270_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 22,
    "replies": 19,
    "retweets": 3,
    "views": 5414,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]