[
  {
    "id": "1894059265284829363",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-25 00:18:13",
    "content": "February 24 (Released) Beijing. A woman from Chongqing took her child out to set up a stall to shine shoes. The woman said that she had come to Beijing for eight years to treat her child who had a brain tumor. Her husband was working outside and didn't care about the child. The child's medical treatment costs more than 10,000 yuan per month, and the surgery costs hundreds of thousands of yuan. When she said this, the woman burst into tears.\nThe woman's mother is still running takeout outside at an old age, working more than ten hours a day and earning 3,000 to 4,000 yuan a month. https://pbs.twimg.com/ext_tw_video_thumb/1894056493743472641/pu/img/7QY8OlPCMEgV_wnz.jpg",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2025/02/25/1894059265284829363_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 196,
    "replies": 53,
    "retweets": 28,
    "views": 28916,
    "originVideos": "https://video.twimg.com/ext_tw_video/1894056493743472641/pu/vid/avc1/1024x576/BIEC3ceushHS7X7l.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1894064982205370536",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-25 00:40:56",
    "content": "The Trump administration plans to impose high fees on Chinese shipping companies and all Chinese-made ships when they enter US ports.\nThe Office of the United States Trade Representative (USTR) recently issued a comprehensive sanctions proposal against China's shipping industry, imposing millions of dollars in fees on Chinese shipping companies and Chinese-made ships every time they call at US ports, and promoting the \"national goods and national fortune\" of the United States.\nAccording to data from the Ministry of Industry and Information Technology, in 2024, China's shipbuilding completion volume accounted for 55.7% of the world market share, new orders accounted for 74.1%, and backlog orders accounted for 63.1%. All three indicators ranked first in the world for 15 consecutive years.\nThis policy will directly hit Chinese shipping and logistics giants such as China Ocean Shipping Group (Cosco). Cosco is the world's largest shipping company in terms of capacity. According to US government statistics, as of January 2024, China operated about 19% of the world's... through large state-owned enterprises including Cosco...",
    "images": "/tweet/image/whyyoutouzhele/2025/02/25/1894064982205370536_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 48,
    "replies": 18,
    "retweets": 7,
    "views": 11441,
    "originVideos": "",
    "hasFullContentTranslated": false,
    "fullContent": "特朗普政府计划对中国航运公司以及所有中国制造的船只进入美国港口时征收高额费用。\n 美国贸易代表办公室（USTR）近日发布一项针对中国航运业的全面制裁提案，对中国航运公司和中国制的造船舶每次挂靠美国港口征收数百万美元的费用，并促进美国「国货国运」。\n 据工信部数据，2024年中国造船完工量占世界市场份额的55.7%、新接订单量占74.1%、手持订单量占63.1%，三大指标均连续15年全球第一。\n 这一政策将直接打击中国远洋海运集团（Cosco）等中国航运及物流巨头。Cosco是全球运力最大的航运公司。据美国政府统计，截至2024年1月，中国通过包括Cosco在内的大型国有企业运营了全球约19%的商船队。\n 此外，该提案还将影响非中国企业，如马士（Maersk）和地中海航运（MSC）等大型航运公司，它们近年从中国船厂采购了大量船只。许多大型货轮会频繁挂靠多个港口，因此这一政策将对全球航运业产生广泛影响。\n USTR的提议获得工会支持，但零售商可能持反对意见，担忧额外成本将转嫁至消费者。该提案现已开放公众评论，并预计于3月举行公开听证会。",
    "hasPublished": true
  },
  {
    "id": "1894072419167473938",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-25 01:10:29",
    "content": "On February 25, a college student recalled his high school experience: there was no 10-minute break between classes, the teacher arrived early and stayed in class, and because the teacher occupied all the time, he could only squeeze out the lunch break to do homework. The teacher could not sit during class, and he would be fined if he was caught. Students who made mistakes would be beaten by the head teacher. Because of living in a high-pressure environment for a long time, he was overwhelmed and even wanted to hang himself with shoelaces one night... https://pbs.twimg.com/ext_tw_video_thumb/1894070775381946368/pu/img/IyrI4aPAQpfbuSFU.jpg",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2025/02/25/1894072419167473938_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 11,
    "replies": 10,
    "retweets": 2,
    "views": 2786,
    "originVideos": "https://video.twimg.com/ext_tw_video/1894070775381946368/pu/vid/avc1/328x720/4m-acTmUgCxc_njh.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]