[{"id":"1829557182595252569","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 00:29:58","content":"Recently, a group of anchors who speak in Northeastern accents and talk about the situation in Russia and Ukraine in front of the camera have attracted the favor and love of many middle-aged and elderly people. Some netizens call it \"Northeastern people's own news broadcast - Northeast News Broadcast\" and some netizens said \"How can I convince my family that this is not the news broadcast\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/31/1829557182595252569_0.jpg,/tweet/video/whyyoutouzhele/2024/08/31/1829557182595252569_1.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1829641447294841239","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 06:04:48","content":"On August 28, it was revealed that someone in Yan'an, Shaanxi, was publicly selling degree quotas online, with the highest price for a degree quota reaching 135,000.\nIt is reported that this is not the first time that Yan'an has exposed a similar incident. In 2022, the primary school affiliated to Yan'an Vocational and Technical College (Yanzhi Affiliated Primary School) was publicly sold online, with a degree quota price as high as 90,000","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/31/1829641447294841239_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829642592423698653","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 06:09:21","content":"Minor students in six schools in a county in Guangxi Province were involved in paid KTV companionship. On August 26, a \"reminder letter\" with the official seal of the Tiandong County Public Security Bureau of Guangxi Zhuang Autonomous Region showed that the Tiandong County Public Security Bureau found in its work that some minor students in school were involved in paid companionship in a KTV entertainment venue in the county, and suggested that the Tiandong County Education Bureau organize all primary and secondary schools in the county to strengthen student management in accordance with their duties and guide students to establish a correct outlook on life, morality and values.\nThe letter mentioned that the schools involved were: Tiandong No. 1 Middle School, No. 2 Middle School, No. 3 Middle School, No. 4 Middle School, Youcheng Middle School and Binjiang Middle School.\nSubsequently, the reports on Phoenix and NetEase were deleted.","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829642592423698653_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829642592423698653_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829642592423698653_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/08/31/1829642592423698653_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829803731472490666","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 16:49:40","content":"On the morning of August 29, Hong Kong Chief Executive John Lee met with Professor Zhang Weiwei, who was visiting Hong Kong. The two sides exchanged views and opinions on the full implementation of \"one country, two systems\" and other issues. After the meeting, Zhang Weiwei presented John Lee with his book This is China: China Must Win.","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829803731472490666_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829803731472490666_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829803731472490666_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829811461356454001","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 17:20:23","content":"A question from a Zhihu user: During the Great Depression in the United States, when people were starving, why did more than half of the people go to the movies once a week?","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829811461356454001_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829811461356454001_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829811461356454001_2.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829811461356454001_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829812868889657349","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 17:25:58","content":"On August 30, \"Gronghui Telegraph\" reported: The size of Beijing's permanent population has been declining for six consecutive years, the city's population distribution has been gradually optimized, and the quality of the population has been significantly improved.","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829812868889657349_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829814616681300261","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 17:32:55","content":"August 30 (Released) Sichuan Leshan. Liu Hongju, a senior prosecutor at the People's Procuratorate of Shizhong District, reported in her real name that the vice president of Emeishan People's Court, a judge of Leshan Intermediate People's Court, a judge of Sichuan Higher People's Court and others had made unjust decisions, violated laws and disciplines, and so on.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/31/1829814616681300261_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829817741047685233","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 17:45:20","content":"On August 31, the U.S. Embassy in China issued a statement: The level of arbitrary and discriminatory detention of Uyghurs and members of predominantly Muslim groups may constitute international crimes, especially crimes against humanity.\" It also attached a link to the United Nations' assessment report on human rights concerns in the Xinjiang Uyghur Autonomous Region, but the link could not be accessed after clicking on it.","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829817741047685233_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829817741047685233_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829821852379922461","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 18:01:40","content":"August 30, Hanyin County, Shaanxi. The manager of a local Ruixing Coffee shop was accused of being married and luring a 17-year-old girl to commit suicide. The girl's parents knelt outside the coffee shop to accuse her. The family found in Xiaoyan's mobile phone that she had dated the store manager Hu Xin, and Xiaoyan mentioned to Hu Xin that she was pregnant twice and said \"I can't make it\". Hu Xin mentioned \"I forced you\" and threatened to \"kill you\" in the chat. Afterwards, the family reported the case to the police. Hu Xin admitted that he was responsible but had no money to compensate.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/31/1829821852379922461_0.jpg,/tweet/video/whyyoutouzhele/2024/08/31/1829821852379922461_1.jpg,/tweet/video/whyyoutouzhele/2024/08/31/1829821852379922461_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829824767542907031","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 18:13:15","content":"Lanzhou, Gansu Province implemented new regulations on September 1. The regulations clearly state that pedestrians who deliberately slow down or linger when crossing a zebra crossing will be fined 20 yuan.","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829824767542907031_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829830288593289404","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 18:35:12","content":"August 30 (Released) Jiaozhou, Shandong. A delivery boy found a skinny child lying on the bed in the house when delivering food. On the 31st, the delivery boy posted a video response: the child has been sent to the hospital for treatment, and the owners of the community spontaneously donated money \"hopefully the child can survive\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/31/1829830288593289404_0.jpg,/tweet/video/whyyoutouzhele/2024/08/31/1829830288593289404_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829831633547247824","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 18:40:32","content":"An insider revealed: The child has been sent to the hospital and is not in danger of life.","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829831633547247824_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829831633547247824_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829831633547247824_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829835082976145882","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 18:54:15","content":"On August 31, multiple sources reported that Gao Qi, one of the famous contemporary Chinese artists, was arrested after returning to China. He is currently detained in Sanhe City Detention Center.\nIt is reported that on August 27, his family had received a detention notice from the Sanhe City Public Security Bureau. The charge is suspected of infringing the reputation of heroes and martyrs, which is suspected to be related to a series of sculptures with Mao Zedong as the theme created around 2009.\nAccording to his younger brother Gao Qiang: Brother Gao Qi originally planned to fly back to New York on September 3, but he did not expect that the Chinese government would take such a severe crackdown on contemporary Chinese artists. On August 30, the public security police entered the Gao brothers' studio again to take photos and collect evidence. According to lawyer Qu Zhenhong who went to the detention center: Gao Qi's situation is not optimistic.\nThe Gao brothers are famous contemporary Chinese artists. Many of their works touch on China's political and social issues. They have created a series of sculptures such as \"Shooting Christ\", \"Mao Kneeling and Repenting\", and \"Catching the Lady\". The two brothers have used sculptures...","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829835082976145882_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829835082976145882_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829835082976145882_2.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829835082976145882_3.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"8月31日，多方消息称中国著名当代艺术家高氏兄弟之一的高兟在回国后被捕。目前被拘押在三河市看守所。\n据悉，8月27日，家人已经收到三河市公安局的拘留通知书。罪名是涉嫌侵害英雄烈士名誉罪，疑似与其2009年前后创作的一系列以毛泽东为题材的雕塑作品有关。\n据其弟弟高强透露：哥哥高兟本来计划九月三日飞回纽约，没想到中国政府竟对中国当代艺术家采取这么严历镇压。八月三十日，公安警察又进入高氏兄弟的画室拍照取证，据屈振红律师去看守所后表示：高兟的情况不容乐观。\n高氏兄弟是中国著名的当代艺术家，不少作品触及中国政治和社会问题，创作了一系列诸如《枪决基督》、《下跪忏悔的毛》、《抓小姐》等雕塑，兄弟二人通过雕塑表达他们对中国政治和社会的态度。","hasPublished":true},{"id":"1829836759091277884","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 19:00:54","content":"On August 27, a notice from the Health and Family Planning Bureau of Hanjiang District, Putian City showed that the salary payment of Putian Hanjiang Traditional Chinese Medicine Hospital had been suspended for half a year and the provident fund payment had been suspended for two years.","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829836759091277884_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829838391975755903","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 19:07:24","content":"\"Smart Money\"\nAccording to the \"E Fund Nasdaq 100 (LOF) 2024 Mid-term Report\" released on August 30, Changzhou State-owned Assets continued to be long on Nasdaq in the first half of the year and has become the largest on-site holder of the E Fund Nasdaq 100 (161130) fund.","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829838391975755903_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829838391975755903_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829839223517823221","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 19:10:42","content":"On August 28, the Publicity Department of the Huangpu District Committee of Shanghai issued a statement: Due to the renovation of the old district and other reasons, there is only one first-grade class of 17 students in Huaihai Middle Road Primary School this year. The official later changed the article, changing \"there is only one first-grade class of 17 students\" to \"there are not many first-grade students this year.\"","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829839223517823221_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829839223517823221_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829839223517823221_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829841653953421552","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 19:20:21","content":"On August 26, the Chinese Embassy in France forwarded an article by a self-media blogger, which stated: Today, the United States has lost its hegemony in many fields, and only one field can still be called a hegemon, that is, statistics. From now on, the United States is the supreme hegemon in statistics. Netizens replied, \"Are you sure you are talking about the United States?\"","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829841653953421552_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829841653953421552_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829841653953421552_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829844801182892151","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 19:32:52","content":"August 29, Wenzhou, Zhejiang. It was revealed online that Wenzhou Transportation Group adjusted the salary of muck truck drivers from 8,000 yuan to a base salary of 2,500 yuan without any compensation. The drivers came to the Labor Inspection Brigade to defend their rights.","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829844801182892151_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/08/31/1829844801182892151_0.jpg,/tweet/video/whyyoutouzhele/2024/08/31/1829844801182892151_1.jpg,/tweet/video/whyyoutouzhele/2024/08/31/1829844801182892151_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829851638255009901","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 20:00:02","content":"On August 27, blogger \"Guyan Muchan\" quoted a report from Hong Kong media Sing Tao Daily: \"Korean scholars claim that Journey to the West originated from Korea\" and added the text \"Impossible, Korea can't afford watermelon\". It was subsequently debunked by many bloggers. It is reported that the original blog quoted a rumor-refuting article published by Sing Tao Daily in 2014. The main purpose of the article is to deny the statement that \"Korean scholars claim that Journey to the West originated from Korea\".","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829851638255009901_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829851638255009901_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829851638255009901_2.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829851638255009901_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829856229365256684","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 20:18:16","content":"August 27, Guangdong. A netizen posted that he was recently unemployed in Shenzhen and was kicked out by the landlord because he had no money to pay the rent. He sought help from friends, but his friends also avoided him. He had spent all his savings due to illness, and owed several thousand yuan on his loan, which was also overdue. He had no choice but to sleep on the street. \"I have only eaten two steamed buns from yesterday to now.\"","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829856229365256684_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829859415459234198","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 20:30:56","content":"August 30 (Release) It is said on the Internet that a Japanese media wants to interview an owner of an unfinished building in Yunnan. But the owner said that he cannot betray the country and cannot let the family's dirty laundry be exposed. \"I believe that the motherland will give a satisfactory answer in the end.\"","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829859415459234198_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829859415459234198_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829859415459234198_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829863126403297760","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 20:45:41","content":"On August 30, Weibo released this week's safety tips. Among them, the recently banned car blogger \"Racing Frappuccino\" was banned for violating laws and regulations by publishing inappropriate remarks about housing pensions; Weibo CEO also confirmed on the same day that \"it has nothing to do with cars, and it published harmful information about current affairs\"\n","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829863126403297760_0.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829863126403297760_1.jpg,/tweet/image/whyyoutouzhele/2024/08/31/1829863126403297760_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829867438344978799","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 21:02:49","content":"According to Reuters on August 30, Chinese banks tightened compliance procedures and transactions worth billions of yuan came to a standstill after the U.S. Treasury warned in June that it might impose sanctions on financial institutions doing business with Russia. In order to bypass payment barriers, Russian companies have had to adopt alternative strategies, such as using third-country intermediaries, or using gold transactions, selling them in Hong Kong, and depositing the proceeds in local banks. But doing so makes the transaction cost as high as 6% of the payment amount. \"Currently, China's payment business to Russia is mainly processed by several local banks such as Hunchun Bank, Jilin Bank, Changchun Rural Commercial Bank, Changchun Development Bank, and Yanbian Rural Commercial Bank.\"","images":"/tweet/image/whyyoutouzhele/2024/08/31/1829867438344978799_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829867496473849950","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 21:03:03","content":"On August 31, workers at the Fenghuang Road West Second Plot Project in Huadu District, Guangzhou, China Construction Fourth Engineering Bureau, demanded their wages.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/31/1829867496473849950_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1829867632981655676","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-31 21:03:35","content":"https://t.co/MKfzS9ZfDd","images":"","videos":"","hasPublished":true}]