[{"id":"1702720820970168413","name":"李老师不是你老师","createdDate":"2023-09-16 00:27:33","content":"Netizen contribution: Beijing hospitals began to use floods as an excuse to ask doctors and employees to return their salaries","images":"/tweet/image/whyyoutouzhele/2023/09/16/1702720820970168413_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/iYv2WBavPf","accountId":"whyyoutouzhele"},{"id":"1702735505752785268","name":"李老师不是你老师","createdDate":"2023-09-16 01:25:54","content":"Netizen contribution\nRecord of the epidemic in the People's Education Press high school history textbook\nSeven short lines represent our three years.","images":"/tweet/image/whyyoutouzhele/2023/09/16/1702735505752785268_0.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702735505752785268_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/qYkFXpMiAL","accountId":"whyyoutouzhele"},{"id":"1702769553212612769","name":"李老师不是你老师","createdDate":"2023-09-16 03:41:12","content":"Around 10pm on September 15, a stabbing occurred at a rice noodle shop near Shangrao Railway Station in Jiangxi Province. The specific cause is unknown. \nOne person died on the spot and one was seriously injured. The suspect fled after stabbing the people.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/16/1702769553212612769_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/oSVZPfV33z","accountId":"whyyoutouzhele"},{"id":"1702821335628411108","name":"李老师不是你老师","createdDate":"2023-09-16 07:06:57","content":"\"We finally got used to student suicide\"\n\n“Today’s students are really powerful. If we criticize power or darkness, they will regard us as enemies, and they will criticize us verbally and writtenly. They are really fierce.\n\nBut when they themselves encountered oppression, they did not dare to resist. They did not dare to resist power. They were afraid of the school authorities. Even when their classmates chose to commit suicide, they did not dare to stand up and say a word.\n\nThey shouted patriotism, and I wanted to believe that their words were true. But the classmate closest to them committed suicide, and none of them dared to speak out. \"","images":"/tweet/image/whyyoutouzhele/2023/09/16/1702821335628411108_0.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702821335628411108_1.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702821335628411108_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1702823431790551394","name":"李老师不是你老师","createdDate":"2023-09-16 07:15:17","content":"September 16, Shantou, Guangdong\nSome netizens discovered that the national flag in front of Shantou Station was turned upside down.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/16/1702823431790551394_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/dRD5Ji5ZLq","accountId":"whyyoutouzhele"},{"id":"1702823494038224992","name":"李老师不是你老师","createdDate":"2023-09-16 07:15:32","content":"https://t.co/FquYkBS0SI","images":"/tweet/image/whyyoutouzhele/2023/09/16/1702823494038224992_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/FquYkBS0SI","accountId":"whyyoutouzhele"},{"id":"1702982175463743833","name":"李老师不是你老师","createdDate":"2023-09-16 17:46:05","content":"Netizen contribution\nRecently, a student revealed that Harbin Institute of Technology has stopped paying tuition fees for government-sponsored students at the Moscow Aviation Institute.\nThe same situation has also occurred at Northwestern Polytechnical University.\nThe school leaders said that the school is also looking into the specific situation.","images":"/tweet/image/whyyoutouzhele/2023/09/16/1702982175463743833_0.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702982175463743833_1.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702982175463743833_2.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702982175463743833_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/gvkWj2oPiP","accountId":"whyyoutouzhele"},{"id":"1702983498489819432","name":"李老师不是你老师","createdDate":"2023-09-16 17:51:20","content":"On September 16, a university in Jiangxi Province issued a notice that it would carry out a special investigation and rectification activity on the problem of \"climbing the wall\" on the Internet. Each class will fill out a \"self-inspection form\" on the weekend. Starting next week, the Smart Campus Management Center will use network traffic + on-site testing to carry out rectification activities.","images":"/tweet/image/whyyoutouzhele/2023/09/16/1702983498489819432_0.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702983498489819432_1.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702983498489819432_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/iKKDCzEzBd","accountId":"whyyoutouzhele"},{"id":"1702984915799699804","name":"李老师不是你老师","createdDate":"2023-09-16 17:56:58","content":"Netizen contribution\nThe current situation of public transportation in the county town under Chengdu: Because the government subsidy for the senior citizen card has not been issued, my grandparents were kicked off the bus.\nIt is said that the local buses are contracted and operated by individual companies, and the driver's income is related to the fare.","images":"/tweet/image/whyyoutouzhele/2023/09/16/1702984915799699804_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/0HG5cQjhhN","accountId":"whyyoutouzhele"},{"id":"1702985352812593402","name":"李老师不是你老师","createdDate":"2023-09-16 17:58:42","content":"@Birds_b_r_32309 Thank you for your hard work, hang in there, keep it up!","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1702986803286827252","name":"李老师不是你老师","createdDate":"2023-09-16 18:04:28","content":"On September 16, a fire broke out in the second canteen of the Nanhu Campus of Northeastern University.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/16/1702986803286827252_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/Qa1b0nPiCX","accountId":"whyyoutouzhele"},{"id":"1702988455632920798","name":"李老师不是你老师","createdDate":"2023-09-16 18:11:02","content":"On September 15, a man in Nanchang, Jiangxi Province, was arrested for using a VPN to bypass the firewall and engage in Internet shady business. He was given an administrative warning and a fine of 15,000 yuan.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/16/1702988455632920798_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/ReSzGT6v3a","accountId":"whyyoutouzhele"},{"id":"1702992057596276760","name":"李老师不是你老师","createdDate":"2023-09-16 18:25:21","content":"On September 16, citizens of Wuhai City, Inner Mongolia received a mass text message from the Public Security Bureau stating, \"Your mobile phone is suspected to have VPN or other 'wall-breaking' software installed. Please uninstall it in time.\"","images":"/tweet/image/whyyoutouzhele/2023/09/16/1702992057596276760_0.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702992057596276760_1.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1702992057596276760_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/Z4ZphqRnfE","accountId":"whyyoutouzhele"},{"id":"1702992872448884979","name":"李老师不是你老师","createdDate":"2023-09-16 18:28:35","content":"Netizen contribution\nIn the past, if you couldn't get into college, you had to join the army\nNow, if you can't find a job after graduating from college, you have to join the army","images":"/tweet/image/whyyoutouzhele/2023/09/16/1702992872448884979_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/yshYsB4PUy","accountId":"whyyoutouzhele"},{"id":"1702996551214248143","name":"李老师不是你老师","createdDate":"2023-09-16 18:43:12","content":"On September 15, the water situation in Shengfang Town, Bazhou, Hebei\nOn the platforms inside the wall, you can see that the floods in some disaster areas of Bazhou and Zhuozhou have not yet receded","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/16/1702996551214248143_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/jJaBjG9m9j","accountId":"whyyoutouzhele"},{"id":"1703000719559680491","name":"李老师不是你老师","createdDate":"2023-09-16 18:59:46","content":"On September 16, an emergency occurred at the Xujiahui subway station in Shanghai, and some citizens said they saw smoke.","images":"/tweet/image/whyyoutouzhele/2023/09/16/1703000719559680491_0.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1703000719559680491_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/wfBOe1onlO","accountId":"whyyoutouzhele"},{"id":"1703002961431904659","name":"李老师不是你老师","createdDate":"2023-09-16 19:08:40","content":"Since September, there has been a wave of opposition to \"pre-prepared meals\" entering campuses in China.\nIn order to prevent children from eating pre-prepared meals in school cafeterias, many parents currently choose to deliver meals to students at noon every day.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/16/1703002961431904659_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/nzB8QZjcWN","accountId":"whyyoutouzhele"},{"id":"1703006767511142850","name":"李老师不是你老师","createdDate":"2023-09-16 19:23:48","content":"  \"Forced demolition, loan withdrawal, the catastrophe of nearly 200 4S stores in Shijiazhuang\" Written by Lu Xun On September 14, the largest automobile park in Shijiazhuang, the Hebei International Automobile Trade Park, was being demolished. The GAC Trumpchi, BYD and Nissan Venucia showrooms, which were still visible a week ago, have been razed to the ground. The \"T\" logo of the Tesla direct store in the park was scraped off by the demolition excavator and thrown on the ground. The \"China FAW\" and \"Hongqi\" logos of the Hongqi 4S store were also torn down and scattered on the ground, falling like chopped-off limbs. The Changan Automobile 4S store next to Hongqi also lost its logo, leaving it bare, making it impossible to tell that it was a Changan 4S store. The store clerks told Auto Business Review that the people who drove the demolition excavator were sent by the street office, and they called many times every day to ask if they would demolish the store. If they didn't demolish it, they would do it. The shop assistants said: \"The people from the street office clearly notified us that the deadline for relocation was the end of September, so why did they suddenly remove the door sign?\" The people from the street office did not discuss the reason with them, but demanded that the store must be demolished, and the Internet might be disconnected in a few days. According to statistics from the Shijiazhuang Municipal Bureau of Commerce, this administrative relocation, which was carried out in the name of rectifying the temporary and illegal low-end market, involved 177 large-scale 4S stores, almost all 4S stores in Shijiazhuang, not counting other exhibition halls of various forms. But as of the time of publication of the Auto Business Review, the investors of Shijiazhuang 4S stores had not seen the government red-headed documents on the demolition. This relocation was as fast as a storm. The 4S stores were required by their respective street offices to complete the relocation within more than a month. The new park was still under construction, and the original store had to be demolished, with no buffer time and no transitional resettlement. This put the auto dealers who had not yet recovered from the epidemic into bankruptcy - many shareholders mortgaged their properties to borrow money from banks to maintain their current operations, and no one could start over. The rent of the four newly built parks is 2-5 times higher than now. A new store of a certain scale costs tens of millions of yuan and takes 2-3 months to renovate. In the words of a local car dealer, \"We can't afford to go there.\" According to a visit by Auto Business Review, some 4S stores with complete certificates and licenses, and even the government's key investment projects before, were also ordered to relocate in a \"one-size-fits-all\" manner. This relocation involves nearly 20,000 direct jobs, nearly 50,000 indirect jobs, and maintenance services for more than one million customers. If forced to relocate, an anonymous person familiar with the situation said that the direct losses will exceed 2 billion yuan. In the Hebei International Automobile Trade Park in Chang'an District alone, there are 10,000 jobs, annual revenue of more than 10 billion yuan, and assets of about 2 billion yuan. Many dealers told Auto Business Review that they could not survive. A dealer said: \"As a private enterprise that has made contributions to the country and society, we are seeking a solution mechanism for equal dialogue. Being an enterprise is respected and recognized.\" But the final relocation deadline of September 20 is getting closer. Some dealers reported to Auto Business Review that their 4S stores had been cut off from water and electricity, fenced off, and unable to operate normally. They were forced by the street office to demolish their stores themselves. If they didn't demolish them themselves, they would just drive excavators over. Who led this rare and abnormal relocation? Did the relevant departments of Shijiazhuang know about it? The dealers in Shijiazhuang have nowhere to complain and are desperate. They hope that the relevant departments can solve the problem according to law before the demolition excavator touches their stores. Life and death Auto Business Review visited the heads of many Shijiazhuang auto 4S stores, and they had four questions: First, the four new parks planned by the government are still under construction. Even if they work 24 hours a day and 7 days a week, it is impossible to build them before the end of the month. Why are the existing dealers forced to close their stores and demolish them when the new parks are not built? Second, why are the dealers directly asked to sign the settlement agreement when the rent and some future hidden costs are not publicized, and the policies and subsidies are unclear. When these important agreement terms are not publicized? This makes people feel uneasy and anxious. Third, the construction standards of the new parks. Each brand manufacturer has its own store building standards and requirements, but how can the uniform four-story storefronts in the new park meet the requirements for store building? Question 4: On July 14, the State Council issued the \"31 Articles\" to support the development of the private economy. When the country repeatedly issued policies to support the development of the private economy, why did Shijiazhuang see a trend in the opposite direction and a practice of undermining investor confidence? What are the managers of this city thinking and doing? Auto Business Review saw that the Dongfeng Honda 4S store in Kangcheng Automobile Park on the West Third Ring Road was only registered on May 19 and just started normal business in mid-August, with a total investment of nearly 20 million yuan. This new store of more than 6,000 square meters has been renovated for 3 months, and the business structure is still being built. There are currently more than 40 employees. It is understood that the employees have not yet been recruited. If they are all in place, the entire store should have more than 60 people. Dongfeng Honda 4S store received a relocation notice from the street office on September 2, and the deadline for the notice is September 10. \"This is a disaster for us. Because in the current situation, as soon as the bank heard that we wanted to close the store, it immediately withdrew the loan. Now I can no longer pay my foreign debts and employee wages.\" A person in charge of the store, with gray hair on his temples, told Auto Business Review, \"The current automotive industry market is in a very serious downturn, as everyone knows. I spent 20 million yuan on loans to invest in this store, and before I sold a few cars, (the street office) asked to demolish the store. If it is demolished now, we can't afford to build a new store because we have no funds. I have no choice but to go bankrupt.\" He said that the people from the street office only notified us of the demolition of the store, and did not notify us of any government compensation, preferential treatment or transitional resettlement measures. The store is still playing cheerful music, and two shop assistants are still welcoming guests, but customers can't pick up their cars. All new orders have to be returned due to the time bomb of demolition. The bright white brand new hall with new cars on display may become a ruin soon. Not far from Dongfeng Honda, Chery 4S store, investor Zhang Kang has been liquidated by the bank after the bank withdrew the loan and he was admitted to the hospital. Zhang Kang has been running this store for 10 years and has achieved good results. Since the end of the epidemic, Chery 4S store has sold 60 to 70 cars every month, and recently launched the new Jetour Traveler. Zhang Kang and his employees were preparing to rush for performance, but they encountered forced relocation. Zhang Kang's blood pressure soared to 180 and his fever was nearly 39 degrees. While receiving an IV drip in the hospital, he repeatedly told Auto Business Review on the phone: \"I don't understand, why is this?\" Zhang Kang's voice was hoarse: \"We survived the epidemic, and dozens of employees struggled together to survive. But now I have lost all my money and my life's hard work has been put into it. I think this one-size-fits-all action by the relevant departments really hurts the hearts of our private enterprises. I don't know who to ask for my debt of more than 20 million yuan. I don't know how to face my employees, my family, and my friends.\" He said that this 4S store contributes 5 to 6 million yuan in taxes to the local area every year. During the epidemic, it insisted on not laying off employees to ensure employment. Several shareholders borrowed money to maintain operations and pay taxes. As a result, they now have no place to complain and are desperate. Many people advised him to put health first, but he asked, \"Who can bear the tens of millions of foreign debts on your shoulders?\" Dealers in another park, the International Automobile Trade Park, also told Auto Business Review that each store has invested tens of millions of yuan, and some large stores have even invested hundreds of millions of yuan. Each store is burdened with a large amount of bank loans. The bank loan scale of the entire park is about 3 billion to 4 billion yuan. The bank requires both spouses of private enterprise investors to bear unlimited joint and several liability. The property of individuals, parents, and even relatives and friends is mortgaged to the bank. The life and property of investors are invested in the park. Once demolished, each store can only go bankrupt on the spot. Not only will the initial investment be zeroed, the bank loan cannot be repaid, the property will be executed, and the relevant industrial chain funds cannot be paid. The investors' years of hard work will be destroyed, and they will be burdened with huge debts and the status of dishonest people. In addition, after years of operation, each store in the International Automobile Trade Park has about 2,000 customers with deposits. Once the existing stores go bankrupt, the rights and interests of nearly 100,000 customers involved cannot be redeemed, which will inevitably cause a lot of disputes. Ma Hongyang, the person in charge of the aforementioned Hongqi 4S store, works in the International Automobile Trade Park. Seeing the two big characters of Hongqi being scraped off, he was anxious and heartbroken. Ma Hongyang has a deep affection for the Hongqi brand and believes that Hongqi is the representative and pride of China's automobile industry. The Hongqi brand has three 4S stores in Shijiazhuang, and the dealer is the Zhongji Automobile Trade Group headquartered in Baoding. Three years ago, through the investment promotion of the Shijiazhuang government, Zhongji Group invested in three Hongqi 4S stores in Shijiazhuang, but encountered the epidemic. After the epidemic was finally over, these three stores had to be relocated due to the rectification of the low-end market. Next to Zhang Kang's Chery 4S store is the Great Wall Haval New Energy 4S store, which was just renovated in June. The BMW and Mercedes-Benz stores located at the entrance of Kangcheng Automobile Park are not related to \"low-end\" in any way. The distorted \"build first and then destroy\" This demolition began with the \"Implementation Plan for Comprehensive Rectification and Improvement of Temporary Construction (Illegal Construction) and Low-end Markets in Urban Areas\" issued by the Shijiazhuang Municipal Government at the beginning of this year. The plan is about relocating and rectifying temporary or illegal 4S stores along the Second Ring Road. Car dealers are not unwilling to cooperate with municipal planning and relocation. They have long known about Shijiazhuang's plans in recent years. Since 2000, the Shijiazhuang Municipal Government has begun the policy of \"withdrawing from the second and entering the third\", moving old industrial enterprises representing the secondary industry, such as Shigang, Huayao, coking plant, and 6 state-owned cotton mills, which were established in the 1950s and were once the city's business card, away from the second ring to develop the tertiary industry. In 2021, Shijiazhuang is preparing to build a \"modern metropolitan area\" in the first year of the \"14th Five-Year Plan\". It will not only withdraw from the second and enter the third, but also optimize the tertiary industry. When people hear the word \"optimization\", they know that a batch of enterprises will be eliminated. Shijiazhuang City proposed to do subtraction within the second ring and multiplication within the third ring. From the map, the 4S stores in Shijiazhuang are concentrated in four parks, one of which is Kangcheng Park, located on the West Third Ring Road; two are located on the North Second Ring Road, one of which is located at No. 127 North Second Ring Road West Road, Xinhua District, and the other is located at No. 86 North Second Ring Road East Road, Yuanqu West Street, Chang'an District; and there is a spontaneously formed park located on Yuxiang Street, Yuhua District, South Second Ring Road. That is, one is located on the West Third Ring Road, two are on the North Second Ring Road, and one is on the South Second Ring Road. Cui Yan has been engaged in the automotive industry in Shijiazhuang for more than 30 years. He told Auto Business Review that there were only two real automotive parks in Shijiazhuang, namely the International Automobile Trade Park in Chang'an District on the North Second Ring Road and the Kangcheng Automobile Park in Xinhua District on the West Third Ring Road. There are some 4S stores around the Second Ring Road, all of which are spontaneously formed markets. There are about 55 4S stores located in the South and North Second Ring Roads (located on the auxiliary road of Yuxiang Street in Yuhua District and Yuanqu West Street in Chang'an District respectively), 10 in the West Second Ring Road, and 3 in the East Second Ring Road. Since private cars were allowed to be freely bought and sold in the mid-1990s, the forms of car trading have evolved from the initial trading under overpasses and shopping malls to car trading markets like in fairs, such as Beijing's Asia Market. At the beginning of this century, from around 2002 to 2004, the terminal model of 4S stores of various brands developed rapidly. At that time, the development of the city was limited to the vicinity of the Second Ring Road. The 4S store business district of the Second Ring Road in Shijiazhuang was also formed during this period. After preliminary research, each dealer built a store in the Second Ring Road based on the municipal planning, basic environment of the business district, customer needs, and competitive conditions at that time. With the development of the city, the population is increasing, and the urban construction planning is changing. There was only the Second Ring Road in the past, and then there was the Third Ring Road. The former suburbs and fields gradually built high-rise buildings and business districts. Dealers located in the Second Ring Road know that according to Shijiazhuang's urban construction policy of \"retreating the Second Ring Road and entering the Third Ring Road\", the Second Ring Road is most likely to change. Due to the early appearance, some procedures that were allowed under the environmental conditions at that time do not meet the current requirements and are considered temporary and illegal construction. On June 1, Zhang Chaochao, member of the Standing Committee of the Hebei Provincial Party Committee and Secretary of the Shijiazhuang Municipal Party Committee, presided over a special meeting of the Municipal Party Committee. The content of the meeting was published in the Shijiazhuang Daily on June 2, with the title \"Adhere to the planning guidance of building first and then demolishing and building at the same time to vigorously promote the construction of the city's automobile industrial park to be completed as scheduled and achieve results\", which mentioned \"vigorously promote the construction of the city's automobile industrial park to achieve new breakthroughs, ensure that it is completed and put into use before the end of September this year, and provide support for the relocation and rectification of overdue temporary buildings and illegal automobile 4S stores in October, so as to make the city more beautiful and livable, and make people's lives more comfortable and happier\". Dealers who communicated with Auto Business Review all said that it was not that they would not move, they supported the creation of a livable and beautiful city and the improvement of the urban environment. But the implementation of \"building first and then demolishing\" began to change. According to a dealer in the International Automobile Trade Park, in mid-June, they received a notice from the Changfeng Sub-district Office, informing them that all 4S stores in Chang'an District must be relocated and renovated before the end of August. On July 4, they received a notice jointly issued by the Chang'an District Planning Bureau, Housing and Construction Bureau, Urban Management Comprehensive Law Enforcement Bureau, Public Security Bureau, Market Supervision Bureau and Fire Rescue Brigade, asking them to demolish the stores themselves within 30 days of receiving the notice. If they fail to do so after the deadline, \"the relevant departments will demolish the stores in accordance with the law.\" According to legal procedures, the rectification of temporary and illegal buildings and the demolition of low-end markets require preliminary research and demonstration, a draft for comments, and a red-headed document issued by the government. However, until September 14, dealers said that they had not seen a red-headed government document with administrative effect, and only recently saw a draft for comments with only attachments. \"It has already been demolished, and a draft for comments is being added. The procedure is illegal.\" A dealer said that this draft attachment, which has no legal and administrative binding force, appeared as an afterthought in order to get dealers to quickly agree to sign contracts and move into the new park. On September 4, Auto Business Review visited the newly built automobile parks in Chang'an District and Yuhua District, which were still in the early stages of construction of rough houses. At this rate, it will be difficult for the parks to be completed before the end of September. Judging from the experience of the 4S store in the Hebei International Automobile Trade Park mentioned above, the Changfeng Street Office has already sent people to demolish it. \"It has not been built yet, but it has been destroyed.\" Cui Yan said. The new park is still a steel structure under construction, and the old store is about to be demolished. After the demolition, how will these dealers make a living and where will they go to transition? According to the decoration requirements of various manufacturers, the decoration of 4S stores takes at least 2-3 months, and the requirements of BBA are longer, and the flagship store needs more than 5 months. If all 4S stores are relocated, how can the maintenance services of many car owners and customers be guaranteed during the months before the new store opens? There is currently no answer to these urgent issues. The owners of 4S stores sought communication everywhere, but no one paid attention. Some owners have been forced to report the situation to the Municipal Bureau of Letters and Calls. They lamented to Auto Business Review: \"How did the business environment in the provincial capital suddenly become like this?\" A dealer with a 4S store in Baoding City talked about different business experiences. He said that in Baoding's market construction and demolition projects, at least governments at all levels have made sufficient preliminary preparations in the specific implementation. \"For business premises that are not within the urban planning, we insist on making up for incomplete procedures if possible, and find ways to optimize the business environment. For those that can be demolished or not, we insist on operating for one more day, so as to facilitate people's shopping and consumption and minimize corporate losses.\" He gave an example that in the construction and reconstruction of the market, the Baoding Municipal Government fully considered market demand and the development of new formats. For example, the car-themed Love Square project has a total area of 330,000 square meters. A tangible market was built on the original site of the demolition, including some business premises. The Municipal Development and Reform Commission, the Bureau of Commerce, and the Youth League Committee and other party and mass organizations gave great support in project planning, land approval, and project construction. He believes that the components of the city's history should be preserved without affecting the city's appearance, rather than being demolished across the board. Even if the procedures are legal, they must be demolished. The consequence of being defined as \"illegal construction\" is that the car dealers will not receive a penny of compensation after being demolished. \"We are definitely not illegal construction.\" Several dealers of the International Automobile Trade Park told Auto Business Review. As the largest automobile park in Shijiazhuang, the International Automobile Trade Park was established in June 2003 by Hebei Automobile (Group) Co., Ltd. (hereinafter referred to as Hebei Automobile Group), a subsidiary of the State-owned Assets Supervision and Administration Commission of Hebei Province, and the Beizhaiying Village Committee of Chang'an District, and covers an area of 560 acres. Then, Hebei Automobile Group recruited merchants and introduced automobile dealers. After 20 years of development, it has formed a large automobile trade park with 57 automobile brand 4S stores and hundreds of automobile sales companies, with an annual revenue of more than 10 billion yuan, employment of nearly 10,000 people, and investment assets of about 2 billion yuan. Whether from the appearance, construction scale, park output value, or technical content, the industrial park cannot be defined as a low-end industry. This park has become the city card of Shijiazhuang. Many city and district leaders have visited and inspected it, and have affirmed the development of the park. Now they are ordering it to relocate on the grounds that the temporary construction has exceeded the deadline. \"We cannot accept it.\" The dealers said. If they do not accept it, they will be fenced off and unable to operate. Auto Business Review saw that 4S stores such as Volvo and Beijing Hyundai have been tightly surrounded by green fences. Two car owners looked for the entrance everywhere and walked around the fence, but could not enter. It is worth noting that Auto Business Review found that some 4S stores in the park have no fences outside and are operating normally. When asked, they learned that \"this is Guohe's own store. We must allow our own stores to operate, and fence off other people's stores.\" This involves the equity change of Hebei Automobile Group, the original lessee of the park. Guohe is the abbreviation of Hebei Guohe Investment Group Co., Ltd. It was formally established in April 2010. It was funded by the Hebei Provincial State-owned Assets Supervision and Administration Commission and integrated some of the original Hebei Automobile Group's automobile dealership companies to form a wholly state-owned company headquartered in Shijiazhuang. It is a state-owned enterprise in Hebei Province. It was later merged into Kailuan (Group) Co., Ltd. in 2014 and became its subsidiary. According to the 2021 (fifth) China Enterprise Reform and Development Outstanding Achievements Exhibition, at that time, Guohe owned 23 controlled or equity-owned automobile 4S stores, managed 10 4S stores, and operated more than 20 automobile brands. It means that the current \"landlord\" of the International Automobile Trade Park is Guohe. Guohe's own stores are operating normally. Xinjiang Guanghui, Zhongsheng Group, Tianhe Group, Zhongji Group, and Dongfeng Southern operate 4S stores in the park. Its 4S stores are all enclosed by fences and cannot operate normally. Guohe is the owner and contractor of two of the four new parks in the Shijiazhuang 4S store relocation. Guohe's two new parks - the Yuhua District Automobile Park is located on Yuxiang Street Auxiliary Road in Yuhua District between the South Second and Third Ring Road, and the aforementioned Guohe Kailuan Automobile Park is located on the North Third Ring Road of Chang'an District (in the picture green circle). People from the Changfeng Subdistrict Office are already demolishing 4S stores of other companies besides Guohe. Auto Business Review contacted the person in charge of the Chang'an District Sub-district Office, surnamed Li, who said, \"Don't come to me. I don't care about this. You go to the district.\" If everything located on the Second Ring Road has to be demolished, the 15 dealers in the Kangcheng Automobile Park on the West Third Ring Road cannot understand how they have become \"illegal construction\". It is precisely in line with the policy of \"retreating from the second ring road to the third ring road\" that Shijiazhuang has been implementing to build a metropolitan city. In 2012, after the introduction and inspection by the leaders of Xinhua District and Daguo Town and the multi-party inspection and demonstration by the Shijiazhuang Circulation Industry Association, Xinhua District Approved the construction of the Kangcheng Automobile Park project in the southwest of Kangzhuang Village, and listed it as a key construction project in the district from 2014 to 2017. The first phase of Kangcheng Automobile Park is planned to cover an area of 150 acres, and the second phase opposite is 700 acres. It is separated from the first phase by a road and 600 meters away. After nearly 10 years of cultivation, there are currently 15 car brands in the first phase, with an annual transaction volume of 2 billion yuan, profits and taxes of nearly 60 million yuan, car purchase tax of 300 million yuan, direct employment of 2,000 people, and indirect employment of more than 5,000 people, forming a mature Automobile ecosystem. The aforementioned Hongqi, Chery, and Dongfeng 4S stores invested in and built stores here because they took a fancy to the procedures of the Kangcheng Automobile Park (with the National Development and Reform Commission registration certificate, land use certificate, Shijiazhuang Urban and Rural Planning Bureau notification, Xinhua Land and Resources Bureau land use nature certificate, Xinhua The district's important project plan list) was fully compliant and in line with the policy of \"retiring from the second and advancing to the third\" policy. It was also a key construction project of the district government, so it chose to invest with debt. Unexpectedly, it was also defined as \"illegal construction.\" The 20-year lease agreement signed between the Kangcheng Auto Park and the local village committee at the end of 2014 will expire in 11 years. As a result, the unexpired second-phase land was purchased by Shijiazhuang Urban Investment Group through government land acquisition, bidding, auction and listing. The urban investment group transformed the original Kangcheng Automobile Park Phase II project into a new project Guosheng Automobile Park, which has become the current 4 One of the new parks. Now, the Subdistrict Office of Kangcheng Park requires that the 15 4S stores in the first phase be demolished before the end of September and moved to the new urban investment park in the second phase across the road. \"It's just nonsense, demolishing the store just to move it across the road?\" Many dealers in the first phase were furious, \"It's illegal to do this.\" The dealers said that if they don't demolish it and sign a new agreement, The water and electricity will be cut off in two days. They feel very sad: \"The orders are changed day by day, and I have no idea what to do. People are slaves, and I am a fish.\" Are the new parks suitable for 4S stores? Among the four new parks, in addition to two from Guohe, one from Chengtou Group, and one belonging to Shijiazhuang Communications Investment Group , located at Huaian West Road, Qiaoxi District, called Qiaoxi District Automobile Park. The dealers all went to see it. They said, first, they can't afford to go. Second, this is completely inconsistent with the OEM’s store building requirements. A dealer made a calculation for Auto Business Review. Among the four major parks, the rent in Yuhua District is the most expensive. The unit rent is 2.6 yuan-3 yuan/square meter/day, and the property fee is 2 yuan/square meter/month. For a store with a scale of 3,400 square meters, the annual rent is about 3 million yuan. The rent will increase by 5% in three years, and the park is scheduled to open on September 25. The unit rental price of Chang'an Park is 2.4 yuan/square meter/day. Calculated based on a 4-story exhibition hall with a roof + 2,518 square meters of mechanical and electrical work stations, the annual rent exceeds 2.2 million yuan; the property fee is 2 yuan/square meter/month, which is 120,000 yuan a year. ; A three-month security deposit of RMB 540,000 is also required, and the total annual fee is RMB 3.42 million. Spray painting will be handled by the park, and the price has not yet been determined. The shopping mall has underground parking spaces. If there is not enough space, you can rent it. The parking space fee is 300 yuan/person/month. The rent is paid on a quarterly basis. There is no central air-conditioning and you need to install it yourself. There is no floor heating and the floor heating cannot be connected. An air heat source pump can be installed for heat circulation. Commercial fees for water and electricity will be charged. The park is expected to open on September 28. The unit rental price in Qiaoxi District is 2.3 yuan/square meter/day, and the annual rental cost is 2.46 million yuan. Calculated based on the 4-story exhibition hall + electromechanical workstations of 2973.19 square meters, the annual rent is 2.46 million yuan; the property fee is 2 yuan/square meter/month, one year 130,000 yuan; a 500-square-meter assembly line in the sheet spray center costs 3 yuan/square meter/day, and the annual rent is 547,500 yuan. Plus a 300,000-yuan deposit, the annual cost totals 3.5 million yuan. The rental fee increases by 5% every three years, and the rent-free period for decoration is 2 months + the rent-free period is 3 months. However, there is no parking space in front of the exhibition hall, and customers park on the negative floor. Xinhua District has the lowest price. Based on a 4-story exhibition hall + 4,300 square meters of mechanical and electrical work stations, the price is 2 yuan/square meter/day, which can be reduced by 5%-10%. The annual rent is 2.7594 million yuan; the property fee is 2 yuan/square meter/month, annually. Pay 172,800 yuan, 1 assembly line sheet spray center 500 square meters, 3 yuan/square meter/day, annual rent 547,500 yuan, sheet spray center management fee 6 yuan/square meter/month, a total of 36,000 yuan a year, deposit 600,000 yuan, with annual expenses totaling 3.515 million yuan. Among them, the rental fee is guaranteed not to increase within 5 years, but it must be paid three months per month. The rent-free period for decoration is 3 months, plus the rent-free period for 3 months, for a total of no less than 6 months of rent-free period. This price is 2-5 times higher than now. The higher rent means that a 4S store needs to increase its bicycle profit by at least 5,000 yuan to cover it, which means that the price of each vehicle needs to increase by 3,000 yuan to 5,000 yuan or the sales volume needs to double to achieve it. \"Customers will not accept the price increase. It is too difficult to double sales in the current situation.\" Investors have said that they \"cannot afford it.\" Automobile Business Review saw that the Guohe Kailuan Automobile Park in Chang'an District is a four-story corner store with a unified appearance, much like a small supermarket. Yuhua Auto Park is also a 4-story store like a small supermarket. \"It's impossible for every 4S store to look the same.\" Dealers said that each OEM has its own style and requirements, so how can it be as uniform as a commercial store. According to the \"Implementation Measures for Automobile Brand Sales Management\" issued by the Ministry of Commerce, the National Development and Reform Commission, and the State Administration for Industry and Commerce in 2005, and the \"Measures for the Administration of Automobile Sales\" issued by the Ministry of Commerce in February 2017, 4S stores have already formed a highly internationalized automobile brand authorized operation Standards such as model, service radius and outlet planning, store design and construction are not determined unilaterally by the dealer, but need to be carried out in accordance with the standards of the OEM. According to the planning and design requirements of the 4S store, it generally needs to have a showroom, maintenance workshop, sheet metal paint workshop, new garage, and spare parts warehouse. It roughly forms a two-story model. The showroom, maintenance workshop, and sheet metal paint workshop are generally all in one place. layer. However, the area of the four new parks in Shijiazhuang City is too small, and the exhibition hall area requirements do not meet the standards of the OEM. Furthermore, maintenance is placed above the second floor and transported up by lifters. Firstly, it is very inconvenient for customers to repair and maintain. Secondly, If high-rise buildings require lifting machines for transportation, load-bearing factors need to be considered during design and construction. However, as various parks are currently rushing to complete work, no one knows whether the design and construction have considered lifting factors. Some dealers said that the new park looks like a copycat of another commercial design for 4S stores. There is another detail. Guohe Kailuan Automobile Park requires that \"spray painting be handled uniformly by the park.\" This means that the park will intervene in the operation of the sheet spray center. More than 80% of the after-sales profits of 4S stores come from the spray painting center. If this business is taken away, the 4S store will be unprofitable. Automotive Business Review found the person responsible for investment promotion in Guohe New Park. The person said that he was only responsible for promoting project construction. The current investment situation of the park and the willingness of enterprises to settle in were good. He did not know other situations. \"We are only responsible for construction, not demolition.\" When Automotive Business Review asked whether it could be guaranteed that the new park would be completed and put into use by the end of September. The source said that it could only guarantee accelerated construction. The China Automobile Dealers Association issued a document on August 31 regarding the experiences of Shijiazhuang automobile 4S stores, calling for the full implementation of fair competition, improvement of the government's integrity performance mechanism, establishment of a response mechanism for complaints and handling of market access barriers, and practical help for private enterprises to solve their problems. From one-size-fits-all and sports-style relocation to indistinguishable stores and the most generous part of after-sales service being taken away, Shijiazhuang 4S stores have suffered greatly from the monopoly of local state-owned enterprises. This layer of window paper is well understood by all parties. (At the request of the interviewee, Ma Hongyang, Zhang Kang and Cui Yan are pseudonyms in this article)","images":"/tweet/image/whyyoutouzhele/2023/09/16/1703006767511142850_0.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1703006767511142850_1.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1703006767511142850_2.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1703006767511142850_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1703013018253033563","name":"李老师不是你老师","createdDate":"2023-09-16 19:48:38","content":"On September 12, a foreign animal protection activist rushed into a restaurant in Harbin and rescued four dogs. The owner of the restaurant initially argued that the dogs were his own, but after being exposed, he said, \"It's useless for you to do this.\"\nFinally, law enforcement agencies intervened and told the animal protection activist that his business license would be revoked if he continued to sell dog meat.\nThe owner also promised not to sell dog meat anymore and agreed that the brave lady could come to check at any time.\nFinally, the two sides shook hands and the dogs were successfully rescued.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/16/1703013018253033563_0.jpg","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1703013441240252920","name":"李老师不是你老师","createdDate":"2023-09-16 19:50:19","content":"Video source:\ninstagram\nslaughterhouse_survivors","images":"/tweet/image/whyyoutouzhele/2023/09/16/1703013441240252920_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/BKUeqr7LfO","accountId":"whyyoutouzhele"},{"id":"1703014799754326049","name":"李老师不是你老师","createdDate":"2023-09-16 19:55:43","content":"It is reported that an unknown explosion occurred at the scene, sparks and smoke appeared in the carriage, and there are no reports of casualties so far.","images":"/tweet/image/whyyoutouzhele/2023/09/16/1703014799754326049_0.jpg,/tweet/image/whyyoutouzhele/2023/09/16/1703014799754326049_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/eOUZFZRzTd","accountId":"whyyoutouzhele"},{"id":"1703016380499378629","name":"李老师不是你老师","createdDate":"2023-09-16 20:02:00","content":"@liaozhengshier The dog needs to be rescued because it has no choice about its fate.\nI can’t say anything about human affairs.","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1703037127070535880","name":"李老师不是你老师","createdDate":"2023-09-16 21:24:26","content":"Shanghai Metro said that it was the instantaneous smoke generated on the roof of the train","images":"/tweet/image/whyyoutouzhele/2023/09/16/1703037127070535880_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/VomtrDUg2k","accountId":"whyyoutouzhele"},{"id":"1703041847658963235","name":"李老师不是你老师","createdDate":"2023-09-16 21:43:12","content":"September 16: \"Dalian nuclear radiation levels exceeded expectations\" was reported online. Police announced that a man had fabricated the rumor to gain attention and had been detained","images":"/tweet/image/whyyoutouzhele/2023/09/16/1703041847658963235_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/EIA53fUAii","accountId":"whyyoutouzhele"}]