[
  {
    "id": "1765047784867279346",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 00:12:39",
    "content": "Before the leader threatened to \"bury you\", he had a scuffle with a citizen who was protesting his rights.\nEarlier, a middle-aged man in military uniform also quarreled with a citizen who was protesting his rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/06/1765047784867279346_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765050683462471795",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 00:24:10",
    "content": "Citizens at the scene complained to the police about the threats from the man wearing the party emblem, but the police kept silent and waved their hands to signal the citizens not to continue.\nLater, another leader advised the citizens not to make trouble and to be civilized.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/06/1765050683462471795_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765054856656470048",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 00:40:45",
    "content": "A woman gave a speech at the scene: We will not give up even an inch of this road! This road is our road, no one can move it!",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/06/1765054856656470048_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765056500492329012",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 00:47:17",
    "content": "So far, the relevant videos have been blocked online, and the local police have called the owners who uploaded the videos and asked them to delete the videos.\nOwners working within the system were told by their leaders not to participate in complaints through 12345 or other channels.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/06/1765056500492329012_0.jpg,/tweet/image/whyyoutouzhele/2024/03/06/1765056500492329012_1.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765057856821186675",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 00:52:40",
    "content": "It is reported that this road is also the main fire passage for nearly 10,000 residents of more than 2,000 households in the community. It is a fire lane registered by the fire department.\nIn 2018, Beihai Hotel enclosed land and turned it into a parking lot, turning Haimen Road into a dead end. At the beginning of the year, they tried to forcibly occupy the fire lanes of surrounding residents. Citizens complained to Qingdao 12345 but it has been dragging its feet. They also wrote to the provincial petition and other channels but there was no response.\nToday, the road was directly closed and construction began. The residents had no choice but to go downstairs to argue with them.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/06/1765057856821186675_0.jpg,/tweet/image/whyyoutouzhele/2024/03/06/1765057856821186675_1.jpg,/tweet/image/whyyoutouzhele/2024/03/06/1765057856821186675_2.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765303985278267541",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 17:10:42",
    "content": "According to the People's Daily on March 6, the government work report: comprehensively strengthen military training and preparation for war, and coordinate the advancement of military combat readiness.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/06/1765303985278267541_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765305881837649937",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 17:18:14",
    "content": "Currently, a Cultural Revolution against Nongfu Spring has been launched inside the Great Firewall, with patriotic netizens questioning whether many of Nongfu Spring's products contain Japanese elements and elements that insult China.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/06/1765305881837649937_1.jpg,/tweet/image/whyyoutouzhele/2024/03/06/1765305881837649937_2.jpg,/tweet/image/whyyoutouzhele/2024/03/06/1765305881837649937_3.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765324103198634138",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 18:30:38",
    "content": "The doubts and criticisms from patriotic netizens have caused real damage to Nongfu Spring. As of March 5, Nongfu Spring's stock price has fallen for three consecutive days.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/06/1765324103198634138_0.jpg,/tweet/image/whyyoutouzhele/2024/03/06/1765324103198634138_1.jpg,/tweet/image/whyyoutouzhele/2024/03/06/1765324103198634138_2.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765329094235865545",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 18:50:28",
    "content": "On March 6, three subcommittees of the Hong Kong Legislative Council held a joint meeting, and the Security Bureau reported the results of the public consultation on Article 23 of the Basic Law. Legislative Council member Regina Ip was concerned that in the documents submitted by the government to the Legislative Council, there were social opinions that \"Facebook, Instagram and other social software should be banned in Hong Kong\". In response, the Secretary for Justice, Lam Ting-kwok, said: \"It can be said categorically that there is absolutely no intention to ban any social media.\" Lam Ting-kwok said that social media is a tool, and the government will not prevent the existence of a tool, but will target those who abuse or misuse these tools to spread remarks that endanger national security. He emphasized that the Basic Law and the Hong Kong National Security Law clearly state that Hong Kong is a society with freedom of information and freedom of speech. Hong Kong is an international financial and trade center that relies on the free flow of information, which is also Hong Kong's unique advantage. Under the premise of maintaining national security, it is still necessary to consolidate and maintain...",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/06/1765329094235865545_0.jpg",
    "hasFullContentTranslated": false,
    "fullContent": "3月6日香港立法会三个小组委员会举行联席会议，由保安局交代基本法23条立法公众咨询结果。立法会议员叶刘淑仪关注政府向立法会提交文件中，有社会意见指「应禁止Facebook、Instagram等社交软件在香港使用」，对此律政司司长林定国回应表示：「可以很斩钉截铁地说，绝对没有任何的意图去禁制任何的社交媒体。」\n林定国指，社交媒体是工具，政府不会去阻止一个工具的存在，而是要针对有人滥用或者误用这些工具散播危害国家安全的言论。他强调，基本法及香港国安法都清楚讲明香港是资讯自由、言论自由的社会，香港是国际金融贸易中心，依赖资讯的自由流通，这亦是香港独特的优势。在维护国家安全的大前提之下，依然要巩固和维护资讯自由，因此绝对不存在会禁制任何社交媒体。\n林定国直指，极有理由怀疑是一些「唯恐天下不乱」的人，散播这些危言耸听的言论，意图阻碍23条立法。他又说，有关言论「听落都唔合理」，希望社会理性分析，不要被影响。\n保安局局长邓炳强补充，不会「一刀切」禁制任何社交媒体。他说，留意到只要政府发布资讯，都会有人特意在里面找一两句出来误导市民，相信香港市民眼睛是雪亮的，会看得出哪些是假新闻假消息，是有意误导恐吓市民的。",
    "hasPublished": true
  },
  {
    "id": "1765329389351264569",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 18:51:39",
    "content": ": Social opinions part of the public consultation on the legislation of Article 23 of the Basic Law",
    "images": "/tweet/image/whyyoutouzhele/2024/03/06/1765329389351264569_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765331887612965371",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 19:01:34",
    "content": "At this moment, Baidu Map shows that Qiqihar No. 115 night shuttle bus has been temporarily suspended due to the inability to pay employee wages, and the resumption time will be notified separately.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/06/1765331887612965371_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765344237720076793",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 19:50:39",
    "content": "At present, some state-owned enterprises are investigating the petition and stability maintenance situation within the enterprise to ensure \"zero report\" during the two sessions.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/06/1765344237720076793_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765367487418208671",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 21:23:02",
    "content": "During the two sessions, people's representatives met in the Great Hall of the People.\nAnd a few kilometers away, people were petitioning the National Bureau of Letters and Calls.\nWhy didn't people go to their representatives? Because there were a lot of plainclothes officers around the Great Hall of the People to intercept petitions.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/06/1765367487418208671_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765367675964813802",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 21:23:47",
    "content": "https://t.co/SLrrpJE3c9",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1765367724882977235",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 21:23:59",
    "content": "https://t.co/bO4MHD9ORJ",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1765374124984037863",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 21:49:25",
    "content": "This prompt has been modified",
    "images": "/tweet/image/whyyoutouzhele/2024/03/06/1765374124984037863_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1765378809824420335",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-06 22:08:02",
    "content": "On March 6, on the streets of Beijing, a petitioner was caught in a car by the interceptors. Several elderly petitioners blocked the car to rescue him, shouting, \"Put him down! You are all kidnappers.\" Although the petitioners shouted to call 110, there was actually a police car following the black car that kidnapped the petitioners.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/06/1765378809824420335_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]