[{"id":"1830020994721071334","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-01 07:12:59","content":"The Standing Committee of the Hangzhou Municipal People's Congress released a video announcing the unanimous approval of a resolution, which triggered collective ridicule from netizens.\nOne netizen commented: \"Without opposition voices, it will only become more and more degenerate\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/01/1830020994721071334_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1830027627408867375","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-01 07:39:21","content":"On August 31, a teacher surnamed Huang from the Institute of Acoustics of the Chinese Academy of Sciences reported in the work group that Yan Yonghong, a nominated academician of the Institute of Acoustics, had been committing adultery with his wife Wang for a long time, and had sex with her many times at Huang's home and in Yan's office, and sent a video of confrontation with Yan. He also said that he was threatened in the office.\nLater, the teacher surnamed Huang was kicked out of the group chat, and the institute staff claimed that the above were all rumors.\nAccording to public information, Yan Yonghong, born in March 1967, is a researcher and doctoral supervisor, director of the Key Laboratory of Language Acoustics and Content Understanding of the Chinese Academy of Sciences, and deputy director of the Xinjiang Institute of Physics and Chemistry of the Chinese Academy of Sciences (on a temporary basis). He is a national candidate for the National Important Talent Project. He holds more than 40 invention patents and has published more than 200 academic papers. He is a standing director of the Chinese Acoustical Society, deputy editor-in-chief of \"Applied Acoustics\", and editorial board member of \"Journal of Acoustics\" and \"Journal of Computer Science & Technology\".","images":"/tweet/image/whyyoutouzhele/2024/09/01/1830027627408867375_0.jpg,/tweet/image/whyyoutouzhele/2024/09/01/1830027627408867375_1.jpg,/tweet/image/whyyoutouzhele/2024/09/01/1830027627408867375_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/01/1830027627408867375_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1830165567611027579","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-01 16:47:28","content":"August 30, Beijing. Tong Runzhong joined three companies two years ago. He was fired for refusing to work overtime on weekends. It took him more than a year to fight five lawsuits against the companies and he won all of them. The companies also changed from being arrogant at the beginning to actively seeking reconciliation. Tong Runzhong said that although the lawsuit took a long time, he was quite satisfied with the result. \"I told the judge at the time that this was not a joke. This was a class struggle, a struggle between the proletariat and the bourgeoisie. And I didn't fight for money, I fought for the truth.\" Many netizens supported Tong Runzhong. However, on August 31, all the rights protection videos released by Tong Runzhong were removed from the shelves. He said: If one of me falls, there will be thousands of me standing up!","images":"/tweet/image/whyyoutouzhele/2024/09/01/1830165567611027579_0.jpg,/tweet/image/whyyoutouzhele/2024/09/01/1830165567611027579_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/01/1830165567611027579_0.jpg,/tweet/video/whyyoutouzhele/2024/09/01/1830165567611027579_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1830169404442833163","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-01 17:02:43","content":"On the evening of August 31, in Fangchenggang, Guangxi, a 53-year-old man killed five people and then fled. According to reports, villagers said that the dead were all neighbors, including two elderly people around 70 years old and three children. The suspect's parents had passed away and he was single at an advanced age.","images":"/tweet/image/whyyoutouzhele/2024/09/01/1830169404442833163_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/01/1830169404442833163_0.jpg,/tweet/video/whyyoutouzhele/2024/09/01/1830169404442833163_1.jpg,/tweet/video/whyyoutouzhele/2024/09/01/1830169404442833163_2.jpg,","hasFullContentTranslated":true,"hasPublished":true}]