[{"id":"1864339083167772701","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 00:00:49","content":"December 4, Huainan, Anhui. In Shunfa Zerunyuan Community, even though the owners have already replaced the new property management, the old property management still refuses to leave, continues to collect property fees, parking fees and other fees, and does not allow owners who do not pay to enter the community. The owner defended his rights at the community gate, and the security guard beat him. It is reported that Zhenhua Property’s boss Su Jinjun is a member of the CPPCC. The owner has called the local administrative and judicial departments to complain many times, but the other party did not deal with it.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864339083167772701_0.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864339083167772701_1.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864339083167772701_2.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864339083167772701_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864339085197819965","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 00:00:50","content":"https://t.co/qec5TuuLT7","images":"/tweet/image/whyyoutouzhele/2024/12/05/1864339085197819965_0.jpg,/tweet/image/whyyoutouzhele/2024/12/05/1864339085197819965_1.jpg,/tweet/image/whyyoutouzhele/2024/12/05/1864339085197819965_2.jpg,/tweet/image/whyyoutouzhele/2024/12/05/1864339085197819965_3.jpg,","videos":"","hasPublished":true},{"id":"1864339924855738877","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 00:04:10","content":"December 4, Nanjing, Jiangsu. An old man woke up a girl on the subway and asked her to give up her seat. After the girl gave up her seat, the old man still refused to give in: \"This seat must be given up. You went to school in vain without family education.\" Other passengers who spoke up for the girl were also threatened by the old man: Let the public security bureau investigate you. Do you know what I do? Tell you and scare you to death!","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864339924855738877_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864347746926293296","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 00:35:15","content":"December 4, Guangdong. The Golden Crown Hotel owed workers wages, and workers jumped off the building to demand their wages.\nDecember 13, Weinan, Shaanxi. Huatong Road Bridge Company owed construction fees, and workers knelt down to the staff at the government service center.\nDecember 1, Zhuzhou, Hunan. A village on Longquan Road was demolished, and the government’s compensation for demolition was too low, triggering protests from villagers.\nDecember 4 (Released) In Huanggang, Hubei, migrant workers in Shangbahe Town demanded their wages at the gate of the town government.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864347746926293296_0.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864347746926293296_1.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864347746926293296_2.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864347746926293296_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864350457021517957","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 00:46:01","content":"December 4, Jilin. Petitioners shouted for the Chief Prosecutor outside the procuratorate, hoping that the Chief Prosecutor would come out to redress the grievances of the people.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864350457021517957_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864410719862599953","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 04:45:29","content":"Follow-up: On December 4, the entire wall was demolished.","images":"/tweet/image/whyyoutouzhele/2024/12/05/1864410719862599953_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864415961962402270","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 05:06:19","content":"On the morning of December 4, Ryan Thompson, CEO of UnitedHealth Group, was assassinated in Manhattan.\nIn the video, a masked gunman fired several shots at Thompson at close range with a pistol equipped with a silencer.\nIt is reported that the gunman fled the scene on a shared electric bike afterwards.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864415961962402270_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864416193257382171","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 05:07:14","content":"Brian Thompson has served as CEO of UnitedHealthcare since 2021 and has been with the company for 20 years. He is known for his leadership in expanding Medicare Advantage plans.\nThe shooting occurred around 6:45 a.m. as Thompson, 50, was preparing to speak at a conference.","images":"/tweet/image/whyyoutouzhele/2024/12/05/1864416193257382171_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864449065636737352","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 07:17:51","content":"On the evening of December 5, Chuzhou, Anhui.\nA man shouted from the window: \"(unclear) Xi Jinping, overthrow the reactionary police, fight your way out! Fight your way out!\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864449065636737352_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864449519082983851","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 07:19:39","content":"https://t.co/RtBpd63wD1","images":"/tweet/image/whyyoutouzhele/2024/12/05/1864449519082983851_0.jpg,/tweet/image/whyyoutouzhele/2024/12/05/1864449519082983851_1.jpg,/tweet/image/whyyoutouzhele/2024/12/05/1864449519082983851_2.jpg,/tweet/image/whyyoutouzhele/2024/12/05/1864449519082983851_3.jpg,","videos":"","hasPublished":true},{"id":"1864451314295418972","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 07:26:47","content":"In the early morning of December 5, a landslide occurred near Fuyuan Industrial City in Bao'an, Shenzhen, leaving 13 people missing.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864451314295418972_0.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864451314295418972_1.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864451314295418972_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864505746442080359","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 11:03:05","content":"On December 4, Voice of America reported that the six major opposition parties in South Korea jointly submitted an impeachment case against President Yoon Seok-yeol. On December 5, Cailian News Agency reported that the ruling party in South Korea decided to oppose the impeachment case against President Yoon proposed by the opposition party, but would let Yoon Seok-yeol quit the party.","images":"/tweet/image/whyyoutouzhele/2024/12/05/1864505746442080359_0.jpg,/tweet/image/whyyoutouzhele/2024/12/05/1864505746442080359_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1864522944728453346","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 12:11:25","content":"Recently, many media reported that a company uses thousands of tons of nickel slag to produce machine-made sand every day. Since Shandong does not allow the use of nickel sand, a large amount of nickel sand flows into the Lianyungang concrete market and is used to replace yellow sand as a building material. Experts say: Nickel sand used as a building material has problems such as radioactivity and heavy metal precipitation causing pollution, which may pose a threat to human health.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864522944728453346_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1864523320844275880","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 12:12:55","content":"Netizen contribution On December 3, a domestic new energy electric vehicle had an accident in Jiangbei District, Ningbo City, Zhejiang Province. After the accident, the customer service staff rushed to the scene to cover the car logo, which was photographed by passers-by.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864523320844275880_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1864525344591761544","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 12:20:58","content":"Netizen submission: CRRC Xi'an Rolling Stock Factory exploits employees and does not provide enough labor protection supplies, causing a large number of employees to be injured. At the same time, the working environment is poor and the production quality is also poor.\nThe workers who submitted the article reported:\nDue to wearing inferior gloves for welding operations, workers were burned in large numbers and they all used welding wire to mend their gloves.\nThe workers were given inferior labor protection, only one pair of gloves and three disposable masks a month, and only one set of clothes a year. The clothes were all bought at high prices and of low quality. They could not be worn in a week and fell apart.\nThe labor protection warehouse staff also often complained that the factory leaders withheld workers' labor protection.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864525344591761544_0.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864525344591761544_1.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864525344591761544_2.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864525344591761544_3.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1864526053949231136","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 12:23:47","content":"The workers who submitted the article also reported that the site was filled with smoke, but the air purification equipment was never turned on, and the dust removal equipment was only used to deal with inspections. The masks that the workers bought themselves were covered with dust after only three hours of wearing. The disposable masks issued by the factory could not provide protection in such an environment. In this month, only three disposable masks were issued.","images":"/tweet/image/whyyoutouzhele/2024/12/05/1864526053949231136_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864526053949231136_0.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864526053949231136_1.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1864529033784099096","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 12:35:37","content":"The employee also said: As a state-owned enterprise, CRRC Xi'an Factory was unwilling to renew the contracts of formal workers and required all outsourcing. Later, the employees were asked to write a voluntary resignation letter and sign a blank contract. The company has a clear hierarchy system, divided into six levels of workers. Some workers do not receive overtime pay, and they will be deducted if they do not work overtime. During the Spring Festival, there were not enough employees, and employees were often required to work 22 hours in a row without rest, from 8 am to 6 am the next day.\n\nOriginal text of the employee's self-statement:\nWe are an old central enterprise called CRRC Xi'an Vehicle Factory. The factory originally had a subordinate unit called Xi'an Vehicle Factory Industry and Trade General Company Rubber and Plastic Products Company. We entered Xi'an Vehicle Factory through this subordinate unit at the beginning. The first contract was two years, the second was five years, and the third was ten years. However, after the third ten-year contract was signed, in 2018, it was suddenly notified that all contracts would be taken back. We did not understand the law at the time, so we handed them all back in a confused manner.\n\nThen the Industry and Trade General Company established a labor service company called...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864529033784099096_0.jpg,/tweet/video/whyyoutouzhele/2024/12/05/1864529033784099096_1.jpg,","hasFullContentTranslated":false,"fullContent":"员工还自述：中车西安工厂作为国企不愿给正式工人续签合同，要求全部外包。后又要求员工写自愿离职书，并签订空白合同。在公司内等级制度分明，分为六等工人，部分工人没有加班工资，并且不加班就扣钱。在春节员工不足，经常要求员工连续班22小时不休息，从早8上到第二天早6点多。\n\n员工自述原文：\n我们是老央企，叫中车西安车辆厂，厂里原来有个下属单位叫西安车辆厂工贸总公司橡塑制品公司，我们刚开始就是通过下属这个单位进的西安车辆厂，第一次合同两年，第二次五年，第三次十年，但是第三次十年合同签订后，到一八年忽然通知把合同全部收回，我们当时也不懂法，就稀里糊涂的全部交回去了。\n\n然后工贸总公司又成立了一个劳务公司叫新运劳务公司，工贸总公司改制成信良劳务公司。\n\n让我们跟新运签订新合同，也是第一次签订二年，第二次签订五年，本来第二次五年合同到明年也就是2025年9月30日到期，但是忽然今年（2024年）四月初，又通知我们写跟新运劳务的自愿离职书（没有任何赔偿，上一次也没有任何赔偿），然后跟信良签订空白合同。\n\n我们小组正班长是正式工，小组内部有劳司职工，也就是原来橡塑公司的职工，还有我们这种技术操作工，也有临时工（临时工又分为劳司的临时工又五险没一金，外面劳务的临时工，没有五险一金）安排的活干完才能下班，没有具体时间加班从没有加班工资，而且不加班就扣款。\n\n公司还将我们分别分为六等工人：\n第一等公司正式职工；\n第二等劳司员工；\n第三等原公司背地里成立的劳务公司的派遣工（该员工自述为被划分的第三等员工）；\n第四等 原公司背地里成立的劳务公司的临时工；\n第五等外包队的劳务外包公；\n第六等其他劳务公司的劳务派遣工。\n\n根据员工自述，其中2022年1月因为疫情封控未上班，但是二月份发的工资把一月份封控时候发的基本工资扣除了。而且由于二月份上班23天，请假5天，在本人不知情的情况下扣除500，原因竟是因为没有加班。（但二月份是春节，实际法定上班天数是17天，所以在比法定实际天数还多一天的情况下还因为未全程加班扣500。当然即使加班也没有额外的加班工资。）\n\n2022年4.28到账三月份的工资，其中无故扣款400元。\n\n2022年6月到账五月份的工资，管理人员说我上了21天班，满勤是30天，请假9天，总共扣款1000元。\n备注：基本每个月都会或多或少的扣钱，这里太多了就不细说了。\n\n工厂随意克扣工人工资，强制加班，不免费加班就扣款，疫情期间不发基本工资。","hasPublished":false},{"id":"1864530209548194198","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 12:40:17","content":"According to comments from netizens, the incident actually happened in Wuhan.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1864532880480981099","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 12:50:54","content":"December 3 news: Shanghai pilots \"employee stock ownership loan\" to allow employees to take out loans to inject capital into the company and solve the company's funding problems\nOne netizen commented: Has the era of taking out loans to work arrived?","images":"/tweet/image/whyyoutouzhele/2024/12/05/1864532880480981099_0.jpg,/tweet/image/whyyoutouzhele/2024/12/05/1864532880480981099_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1864533971092295790","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-05 12:55:14","content":"Recently, a woman protested her rights in a hospital in Nanshan, Shenzhen, and was covered tightly by security guards using new equipment.","images":"/tweet/image/whyyoutouzhele/2024/12/05/1864533971092295790_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/12/05/1864533971092295790_0.jpg,","hasFullContentTranslated":true,"hasPublished":false}]