[{"id":"1777370227375772067","name":"李老师不是你老师","createdDate":"2024-04-09 00:17:38","content":"On April 8, the Chongzuo government in Guangxi violently cleared eucalyptus trees, and some villagers were arrested.\nIt is reported that since Xi Jinping visited Guangxi last year, various places in Guangxi have launched a \"eucalyptus clearing operation\" on the grounds of protecting arable land. In some places, villagers were directly asked to switch to planting sugarcane.\nVillagers said, \"Planting trees can make you rich, but planting sugarcane is tiring and you are squeezed by sugar factories and you can't make much money all year round. But since Xi Jinping came to Guangxi and touched sugarcane, the eucalyptus clearing operation has become more and more crazy.\" (Video 2 is from February this year)","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777370227375772067_0.jpg,/tweet/video/whyyoutouzhele/2024/04/09/1777370227375772067_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1777376779939823698","name":"李老师不是你老师","createdDate":"2024-04-09 00:43:41","content":"According to the search, the dispute over the removal of eucalyptus in Guangxi has a long history. Although the superficial reason is related to environmental protection, it is essentially a dispute over interests between the local government's sugar mills and farmers. In 2014, People's Daily's magazine People's Digest pointed out in an article titled \"Guangxi's Eradication of Eucalyptus: A Misunderstanding\" that due to the outflow of young and middle-aged people in the area, local people prefer to plant eucalyptus rather than sugarcane. However, the county government clearly stated that \"we control eucalyptus mainly because sugarcane is our county's independent industry. There are two sugar mills in the county, which contribute 50% to 60% of fiscal revenue each year. If the masses plant eucalyptus in large numbers, eucalyptus will compete with sugarcane for water and nutrients in the soil.\"\n\nA report in Chao News in 2023 still pointed out that the essence of Guangxi's removal of eucalyptus is still the local government's protection of the \"sugar jar\". And although it is claimed that there are subsidies for this kind of sugarcane, many farmers do not receive subsidies after planting sugarcane.\n\nIn short, this problem has existed for many years, but it is not essentially...","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777376779939823698_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777376779939823698_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777376779939823698_2.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777376779939823698_3.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"根据搜索，广西清桉纷争由来已久，虽然表面原因与环境保护有关，但本质上是当地政府的糖厂和农民之间的利益纠纷。2014年人民日报旗下杂志人民文摘就以《广西清剿桉树：一场误会》一文指出，由于当地青壮年流出，当地人更喜欢种桉树而非甘蔗，然而县政府明确表示“我们控制桉树，主要是因为甘蔗是我们县的自主产业，县里有两家糖厂，每年贡献财政收入达50%~60%。如果群众大量种植桉树，桉树会与甘蔗竞争水分和土壤里的养分。”\n2023年潮新闻的一篇报道依然指出，广西清桉的本质依然是当地政府保“糖罐子”。且虽然声称该种甘蔗有补贴，但是很多农民种植甘蔗之后却并没有补贴。\n简而言之，这个问题存在了很多年，但是本质上并没有改变。","hasPublished":true},{"id":"1777383679007903832","name":"李老师不是你老师","createdDate":"2024-04-09 01:11:05","content":"Netizen contribution\nThe Department of Computer Science at Tsinghua University recently built a new department building and purchased more than 3,000 sets of tables and 800 yuan per chair\nA student searched for the same model on Taobao and found that the purchase price was significantly higher","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777383679007903832_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777383679007903832_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777383679007903832_2.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777383679007903832_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1777653877937967234","name":"李老师不是你老师","createdDate":"2024-04-09 19:04:46","content":"On April 9, Tianrui Cement, a company with a market value of 10 billion yuan in Hong Kong stocks, suddenly crashed 99% within 15 minutes before the closing.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777653877937967234_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1777654375407571317","name":"李老师不是你老师","createdDate":"2024-04-09 19:06:44","content":"On April 8, Phoenix.com reported that a radioactive source was found in Khabarovsk, a city in Russia's Far East. The city is across the river from Fuyuan City in Heilongjiang, and the waterway distance is only 65 kilometers. According to the Moscow Times, the radiation level is 1,600 times higher than the normal level, and Khabarovsk has entered a state of emergency. However, as of now, the incident has not been widely discussed in China, with only 13 media reports.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777654375407571317_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777654375407571317_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777654375407571317_2.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777654375407571317_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777656057289932905","name":"李老师不是你老师","createdDate":"2024-04-09 19:13:25","content":"On February 25, a netizen broke the news on a social platform that Xu Xiang, a 2019 civil engineering student at Southeast University in Nanjing, abused cats. The netizen revealed that Xu Xiang was a core member of the TG cat abuse group. The article also contained two pictures of cruel abuse of cats. The staff of the Graduate Office of the School of Civil Engineering of Southeast University said that they had received relevant feedback and were verifying it.\nOn March 3, the reporter called the police station where the person was registered, and the staff on duty said that they had criticized and educated Xu Xiang and asked his parents to strengthen their discipline.\nOn April 2, Xu Xiang, who applied for the postgraduate entrance examination of the School of Physics of Nanjing University, was rejected with the first place in professional courses. It is suspected that he failed the ideological and moral assessment. The school staff responded that \"these behaviors may be affected.\"\nRecently, just after the student was rejected by Nanjing University, it was reported on social platforms that the student had entered the re-examination and adjustment list of Lanzhou University. In addition, at Lanzhou University...","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777656057289932905_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777656057289932905_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777656057289932905_2.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777656057289932905_3.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"2月25日，有网友在社交平台爆料，南京东南大学19级土木专业学生徐某祥虐猫，该网友透露徐*祥是TG虐猫群组里的一位核心成员，爆料的文章里还有两张猫咪被残忍虐待的图片。东南大学土木工程学院其研究生办公室工作人员称，已收到相关情况反馈，正在了解核实中。\n 3月3日，记者致电当事人户籍派出所，值班人员称他们已经对徐*祥进行批评教育，并让家长对其加强管教。\n 4月2日，报考南京大学物理学院研究生的徐某祥，以专业课排名第一的成绩被刷，疑似思想品德考核不过关，学校工作人员回应“这些行为都有可能会受到影响。”\n 近日，就在该生被南京大学刷下之后，在社交平台陆续传出该生已进入兰州大学复试调剂名单。另外在兰州大学官微留言中，从3日开始就已被网友刷屏“不能录用思想品德有问题的学生”\n 4月7日，胡锡进就此事发文，应该给虐猫男生改正机会，舆论场应尊重兰大裁量权。当晚20时30分左右，记者碰到来等候笔试成绩公布的徐某祥。他委婉的拒绝了记者的采访，并表示说太多可能网上又会掀起轩然大波，对于舆论不是很懂。当被问及何时愿意接受采访时，他表示“如果兰州大学对我思政考核有一个很好的结果，我会愿意接受采访”\n 4月8日，兰州大学核科学与技术学院网站发布了2024年硕士研究生调剂考生成绩及拟录取名单公示，其中，考生徐某祥未进入拟录名单，学院介绍徐某祥面试不合格、未进入思政考核。","hasPublished":true},{"id":"1777656287104303392","name":"李老师不是你老师","createdDate":"2024-04-09 19:14:20","content":"https://t.co/uv16vL0dhg","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777656287104303392_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777656287104303392_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777656287104303392_2.jpg,","videos":"","hasPublished":true},{"id":"1777657046294233495","name":"李老师不是你老师","createdDate":"2024-04-09 19:17:21","content":"Comments about the boy collected by netizens\n","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1777660483169874252","name":"李老师不是你老师","createdDate":"2024-04-09 19:31:01","content":"On April 9, a document from the Fujian Provincial Department of Culture and Tourism regarding the \"Midi Music Festival\" circulated online showed that the \"Da Wuyi Midi Music Festival\" during the May Day holiday this year will focus on various safety measures, including strictly prohibiting the appearance of banners and flags on site, strictly prohibiting the sale of alcohol and beverages, and strictly prohibiting camping.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777660483169874252_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777660483169874252_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777660483169874252_2.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777660483169874252_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1777661861351047439","name":"李老师不是你老师","createdDate":"2024-04-09 19:36:29","content":"April 8, Changsha, Hunan. A parent said that his child was verbally abused and beaten by a teacher at Changsha Tianhua Middle School. In the end, the child ran all the way to the 5th floor and jumped down. On the same day, the family members held banners outside the school to defend their rights.\nA staff member of the Changsha County Education Bureau replied to the reporter that the school rescued the child as soon as possible and the subsequent handling results will be made public.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777661861351047439_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777661861351047439_0.jpg,/tweet/video/whyyoutouzhele/2024/04/09/1777661861351047439_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1777663618844078436","name":"李老师不是你老师","createdDate":"2024-04-09 19:43:28","content":"On April 9, a fire broke out at Heze University","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777663618844078436_0.jpg,/tweet/video/whyyoutouzhele/2024/04/09/1777663618844078436_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1777664860710449505","name":"李老师不是你老师","createdDate":"2024-04-09 19:48:24","content":"During the IEM Chengdu competition over the past two days, Brazilian CSGO player Chelo caused dissatisfaction among domestic players because he used a MEME of Mao Zedong as his avatar.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777664860710449505_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777664860710449505_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777664860710449505_2.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777664860710449505_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1777667397903679951","name":"李老师不是你老师","createdDate":"2024-04-09 19:58:29","content":"On April 8, in Dong'an County, Yongzhou, Hunan, a former teacher stabbed three former colleagues with a knife. The police reported: the vital signs of the three injured were stable.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777667397903679951_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1777669650127446401","name":"李老师不是你老师","createdDate":"2024-04-09 20:07:26","content":"?\nOn April 9, Professor Kong Qingmao of the School of Humanities at Nanjing University of the Arts posted a post on his official account about the cat abuse incident, saying that the result was very sad, \"Our society lacks tolerance... Such a small thing was criticized by the whole society... The leaders of Nanjing University and Lanzhou University should reflect on it.\"\nHe also said that \"cat abuse is just a small matter\", \"This society lacks sympathy, and the entire social psychology is dark\", when can we be more tolerant and caring towards young people.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777669650127446401_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777672043586081092","name":"李老师不是你老师","createdDate":"2024-04-09 20:16:57","content":"On April 9, Ping An Trust collapsed, and people protested their rights at its Shenzhen headquarters","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777672043586081092_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777672043586081092_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777677894036201906","name":"李老师不是你老师","createdDate":"2024-04-09 20:40:12","content":"Recently, it was revealed on the Internet that 37 Ping An Trust trusts defaulted, involving a total amount of 10.3 billion yuan. Some netizens posted that the product of \"Xiangyuan No. 230 Collective Fund Trust Plan\" cannot be paid on time because the underlying assets involve real estate companies that are in danger. It is reported that on March 1 this year, Ping An Trust's \"Xiangyuan No. 230 Collective Fund Trust Plan\" has not been approved. A temporary announcement was made regarding the fulfillment of the promise. The announcement stated that due to the operating problems of the parent company of the transferee financier, Chongqing Rongqian Real Estate Development Company, Rongsheng Development. As a result, there is a risk that trust funds cannot be distributed on time, and Ping An Trust has issued an early warning announcement on August 31, 2022. As of today, the trust product has been overdue for 14 months, and neither Ping An Trustee nor Rongsheng Development has announced a public solution.\n\n As early as December last year, a client sent an information letter to the Shenzhen Municipal Government regarding the inability to redeem Ping An trust products. According to the letter, Ping An Bank has a total of 41 branches...","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777677894036201906_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777677894036201906_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777677894036201906_2.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"近期网曝平安信托37支信托违约，涉及金额高达103亿元。有网友发帖称，翔远230号集合资金信托计划”产品，因底层资产涉及出险房企导致本息无法按期兑付。据悉，今年3月1日，平安信托就翔远230号集合资金信托计划”未能如约兑付一事发布了临时公告。公告称，由于受让融资人重庆荣乾房地产开发公司母体荣盛发展的经营问题。导致信托资金有无法按时分配的风险，平安信托已于2022年8月31日发出预警公告。截至今天，该信托产品已逾期兑付14个月，无论是平安信托方，还是荣盛发展方，暂无公开的解决方案。\n\n 早在去年12月，就有委托人就平安信托产品无法兑付一事，向深圳市政府发送信息函。据函中披露，平安银行旗下共41支暴雷产品，经处理后仍存在37支信托产品并无法兑付，涉及到3891名投资人，涉及金额高达102.83亿元。\n\n 从信息函中可以看到，上文提及得到“翔远230号”赫然在列，截至2023年12月10日，项目涉及人数约300人，兑付金额为8.36亿。\n\n 除了“翔远230号”关联荣盛发展外，仍有不少平安信托产品的底层资产与房地产息息相关。在房地产的丰年里，信托平台和投资者的确可以舒坦地赚钱。但如今泥沙俱下，曾经的“摇钱树”也变成了“拖油瓶”。","hasPublished":false},{"id":"1777690428864688507","name":"李老师不是你老师","createdDate":"2024-04-09 21:30:00","content":"https://t.co/iRl19yi5Fj","images":"","videos":"","hasPublished":false},{"id":"1777690943291855301","name":"李老师不是你老师","createdDate":"2024-04-09 21:32:03","content":"On April 9, 15 graduate students from Beijing University of Posts and Telecommunications publicly reported that their tutor Zheng Feng had long exploited students, causing many students to suffer from mental illnesses such as depression. They mentioned that in addition to mental exploitation, personal insults and withholding of wages, students also needed to provide services for their lives, including long-term express delivery and online shopping returns, taking care of their daughter's study and life, helping her daughter with homework and completing competitions, etc. They even needed to collectively buy buns from the cafeteria for her.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777691211286872541","name":"李老师不是你老师","createdDate":"2024-04-09 21:33:07","content":"https://t.co/c23CeywXrY","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777691211286872541_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777691211286872541_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777691211286872541_2.jpg,","videos":"","hasPublished":false},{"id":"1777694028890325171","name":"李老师不是你老师","createdDate":"2024-04-09 21:44:19","content":"At present, staff have informed reporters to go to the China World Hotel tomorrow (April 10) morning for nucleic acid testing in preparation for the \"Xi-Ma meeting\" at the Great Hall of the People tomorrow afternoon.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777694028890325171_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777694909375373720","name":"李老师不是你老师","createdDate":"2024-04-09 21:47:49","content":"Central News Agency confirmed the news that reporters accompanying the delegation had nucleic acid tests\n","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777695743865761954","name":"李老师不是你老师","createdDate":"2024-04-09 21:51:07","content":"\"Shishuo Xinyu\"\nOn April 8, a netizen posted a video lamenting that \"we are already surrounded by sensitive words\" and listed some sensitive words detected by the system.\nIn response, netizens left messages in the comment area to share their posts that were detected with sensitive words.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777695743865761954_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777695743865761954_1.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777695743865761954_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777695743865761954_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777696473838133421","name":"李老师不是你老师","createdDate":"2024-04-09 21:54:02","content":"On April 8, the Urban Village Reconstruction Command Office of Shijing Street Tan Village, Baiyun District, Guangzhou City, issued an announcement:\nVillagers are not allowed to post false information on social platforms, insult, block, pull staff and other extreme behaviors, incite villagers to make illegal petitions or gather in the village to cause trouble, besiege the village committee office, and coerce others to express their wishes freely.\nOtherwise, they will be handed over to the public security or judicial organs for legal responsibility.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777696473838133421_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777699769369940066","name":"李老师不是你老师","createdDate":"2024-04-09 22:07:07","content":"April 8, Jining, Shandong. An owner of Shanglong Capital real estate in Jinxiang posted a video saying that the ceiling of the house he bought would fall off with sand and even stones when he touched it with his hands, and the steel bars were exposed.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777699769369940066_0.jpg,/tweet/video/whyyoutouzhele/2024/04/09/1777699769369940066_1.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777700382975590579","name":"李老师不是你老师","createdDate":"2024-04-09 22:09:34","content":"April 8, Suizhou, Hubei. A netizen posted a video saying that on April 3, the leaders of Suixian Economic Development Zone sent urban management law enforcement officers to demolish a house without any formalities. During the demolition, the two sides had a physical conflict. Afterwards, the urban management broke into the third floor and dragged the victim Liu Hui, causing Liu Hui to fall from the third floor and suffer comminuted fractures of the L1-L4 spine. She was rescued in the hospital for more than 6 hours.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777700382975590579_0.jpg,/tweet/video/whyyoutouzhele/2024/04/09/1777700382975590579_1.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777703667992285455","name":"李老师不是你老师","createdDate":"2024-04-09 22:22:37","content":"April 8, Qing County, Cangzhou, Hebei. The fourth phase of Country Garden Tianyu Academy was left unfinished due to the withdrawal of funds from the supervision account. The developer resumed work in a show-like manner. The owners held a banner parade to defend their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777703667992285455_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777703750674551146","name":"李老师不是你老师","createdDate":"2024-04-09 22:22:56","content":"On April 8, in Chaoyang, Liaoning Province, a real estate project in Yaqi has been left unfinished for many years and has not yet been delivered. The owners held up banners and even jumped off buildings to defend their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777703750674551146_0.jpg,/tweet/video/whyyoutouzhele/2024/04/09/1777703750674551146_1.jpg,/tweet/video/whyyoutouzhele/2024/04/09/1777703750674551146_2.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777705515914584121","name":"李老师不是你老师","createdDate":"2024-04-09 22:29:57","content":"April 8, Zunhua, Hebei. Country Garden Yonghua Mansion was left unfinished, and owners gathered on the rooftop with banners and jumped off the building to defend their rights.\nIt is reported that the property was originally scheduled to be delivered on November 30, 2023, but the project was postponed indefinitely due to the withdrawal of regulatory funds.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777705515914584121_0.jpg,/tweet/video/whyyoutouzhele/2024/04/09/1777705515914584121_1.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777708770581188746","name":"李老师不是你老师","createdDate":"2024-04-09 22:42:53","content":"April 7, Zibo, Shandong. Lijin Group lured a large number of deposits with high interest rates and then ran away with the money. The group was deserted and many elderly people lost their life savings. \nOn that day, investors gathered at Lijin Group and Zibo Petition Bureau to defend their rights. \nAn investor revealed that many elderly people in the village had committed suicide by drinking pesticides.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777708770581188746_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777708770581188746_0.jpg,/tweet/video/whyyoutouzhele/2024/04/09/1777708770581188746_1.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777712003479474281","name":"李老师不是你老师","createdDate":"2024-04-09 22:55:44","content":"April 8, Songyuan, Jilin. The Hadashan Township government seized the grain fields of the villagers of Qianha Village No. 2 without paying compensation. The villagers gathered in front of the Songyuan City Petition Bureau and held up banners to defend their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777712003479474281_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777713442981364163","name":"李老师不是你老师","createdDate":"2024-04-09 23:01:27","content":"On April 9, Xi'an, Shaanxi. A fire broke out at Northwest University.\nAccording to the contributor, no one notified the fire when it broke out, and the students knocked on the dormitory doors one by one to inform each other to save themselves. The windows were equipped with limiters and lacked fire-fighting facilities. The cause of the fire was suspected to be aging circuits.\nAfter the incident, the school notified that no information about the fire should be posted on social media.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777713442981364163_0.jpg,/tweet/image/whyyoutouzhele/2024/04/09/1777713442981364163_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777713442981364163_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1777717553285972316","name":"李老师不是你老师","createdDate":"2024-04-09 23:17:47","content":"On April 8, a student in the fourth community of Hebei University of Engineering was suspected of jumping off a building. The reason was suspected to be heavy study pressure.\nAccording to the contributor, when the police came to collect fingerprints on the morning of April 9, they found that the crime scene had been disturbed. The school notified that students in the fourth community were not allowed to return to the dormitory that morning, and some students were locked in the dormitory because they did not get up at that time.","images":"/tweet/image/whyyoutouzhele/2024/04/09/1777717553285972316_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/04/09/1777717553285972316_0.jpg,","hasFullContentTranslated":true,"hasPublished":false}]