[{"id":"1862528578573017212","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 24:12:12","content":"At around 9 pm on the 29th, a male student from Wuhan City College in Hubei Province was reported online to have jumped off a building in Wuhan, Hubei Province. It was suspected that this was because he did not receive any salary for his internship at the school and had difficulty finding a job.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862533190243819742","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 24:27:25","content":"Recently, in Russia, a man said he took a taxi from Red Square back to his hotel. The taxi app showed that it only cost 400 rubles, but the taxi driver charged him 5,000 rubles! The man said: I will be angry with anyone who talks about the friendship between China and Russia. \"The driver also asked us if we were Chinese. If we were Chinese, we would be ripped off.\" Netizens: Don't destroy the friendship between the two countries for this little money. Be aware of the overall situation.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862539162920133134","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 24:57:46","content":"November 29, Guizhou. An uncle climbed a crane to ask for his hard-earned money. He said, \"I will get tens of thousands of yuan today even if I risk everything.\" November 29, Qiannan, Guizhou. The Longli Guanyinshan Forest Town project owed wages. Workers stood on the roof and crane and shouted, \"I want to go home for the New Year. Give me back my hard-earned money.\" November 28, Qianjiang, Hubei. Yuanlin Sake Co., Ltd. owed wages. Workers stood on the roof to ask for wages.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862642341934137442","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 07:46:13","content":"On November 28, in Huai'an, Jiangsu, two people drove their car to force open the door of a liquor store and stole liquor worth more than 200,000 yuan.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862646868846813565","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:01:26","content":"Netizen contribution: Recently, in an open class at a school in Jiangxi, students turned around and clapped in unison to welcome the leaders to the class. It can be heard that this clapping was practiced many times. The applause and movements were surprisingly synchronized. The direction of turning back for each leader was different, but each row of students could turn back at the same angle. Netizens in the comment area said: This is so exaggerated that they danced and clapped in unison, as if they had come to North Korea.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862649835238957332","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:16:39","content":"On November 28, many schools in Heilongjiang were exposed for deducting students' meal fees to provide teachers and staff with 2 yuan luxury breakfasts. One principal was also exposed to have asked for a 3 yuan kickback for each breakfast. In order to meet the school's 2 yuan standard for teachers and staff breakfasts, the catering company was forced to lower the student lunch standard. The student meal fee is only 12-15 yuan. After deducting the kickbacks to the principal, the teacher meal subsidy and their own profits, how much can go into the students' mouths?","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862653871338000397","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:31:52","content":"On November 27, residents of Yujicheng Community in Pingdingshan, Henan Province blocked the road to protest their rights due to insufficient heating. A staff member of Beihuan Road Sub-district Office said: \"After the heating was supplied, the residents felt that it was not warm enough, so they protested. They wanted to resolve their demands and used extreme methods, so they blocked the road. The secretary and director went there, and the police also went there. Now that their demands have been resolved, they will not block the road.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862656567029768632","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:47:05","content":"On November 28, a large number of migrant workers held banners at the gate of Changan Yiyang Power Generation Company to demand their wages and defend their rights. According to Qichacha, the company is a state-owned enterprise jointly owned by two state-owned enterprises, Shaanxi Coal and Electric Power and Yiyang Local Electric Power Investment Company.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862658830628528401","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:47:10","content":"Recently, a food delivery rider posted a post online complaining that not only is the salary low for food delivery, but now there is a deduction for the order. The advantage of crowdsourcing riders should be flexibility and freedom, but now they have to deduct ten yuan for refusing an order.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862727710319247475","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 13:19:30","content":"A retired soldier was deceived to northern Myanmar, but he sought help from the embassy but to no avail. He said frankly: It's very disappointing. A Quan from Shenzhen was a former armed police officer. In 2021, he was deceived by a man with a Fujian accent in Thailand to a Myanmar industrial park. Because A Quan did not want to defraud and was physically punished, he finally escaped one night and asked the embassy for help: I dedicated my youth to the motherland, please help me. Then the embassy did not respond. \"The Wolf Warrior in my heart at that time, I felt disappointed.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862764593937805369","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 15:50:50","content":"RT @starshiner2023: A recent anti-lockdown protest in Chengdu by arrested youth: Eyewitness C airdropped his slogans from Sitong Bridge to the Chengdu subway until he was arrested and detained. Youth J rushed to Wangping Street at night, shouting \"Down with the nucleic acid economy, no lockdown, freedom\", marched in the city and was beaten and detained. There were about 40 spectators on the day, watching artist Deng Shangdong…","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862769414958989323","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 16:06:03","content":"On November 30, 2024, \"Flower Brother\" Li Yahui was interviewed by Voice of America:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862780486369812787","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 16:51:31","content":"Recently, in Shandong, a user named Gray Wolf said: his father died of alcohol poisoning, his mother died in a car accident, he had no grandparents, and grew up eating at other people's houses. At the age of 19, he was diagnosed with advanced gastric cancer. He decided to go home to visit his family because he had no money for treatment. On the 29th, his friend posted a message saying that Huazi had passed away. The friend said: Huazi was kind and worked hard. He only drank a pack of soy milk powder every day. Later, he suddenly vomited blood and was diagnosed with gastric cancer. Before he died, he gave his remaining 3,000 yuan to his friend.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862784844419441128","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 17:06:44","content":"On November 29, Hu Xijin posted a video saying: Should Wu Liufang be tolerated? This was met with dissatisfaction and ridicule from netizens. Netizens responded: Hu Xijin has been released, what's wrong with Wu Liufang? You are much more harmful than she is. \"You can tolerate Lao Hu and Auntie Gu Yan, but you can't tolerate Wu Liufang, who is harmless and often does public welfare for the glory of the country?","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862788601827971313","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 17:21:57","content":"On November 27, in Huai'an, Jiangsu, a woman posted a video saying that the police in Dangdu held an event, but the iron frame at the event site was blown down by strong winds, causing an old man and a child to be trapped underneath: \"No one cared, no one called the police, and the police didn't respond within 300 meters after I called them.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862797082798751781","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 18:07:25","content":"On November 29, it was reported that economist Fu Peng was summoned for a talk. Fu Peng then criticized HSBC in his WeChat Moments: The summons was pure rumor. On the 24th, Fu Peng mentioned in an internal speech at HSBC Private Wealth Planning: Everyone has a habit of saying that the domestic economy cannot be good. Anyone who says it cannot be good is a traitor and unpatriotic, and will be attacked. So a business was born. As long as you say that this thing is far ahead, you can sell a thing worth 8,000 yuan for 18,000 yuan.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862801380358193583","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 18:22:38","content":"On November 30, the Hong Kong government required all civil servants to visit the National Security Exhibition Hall at least once before the end of 2026. In addition, some departments also required civil servants to take photos and punch in at the scene as evidence. However, the Hong Kong government did not respond to the consequences of not visiting the exhibition hall within the deadline. The Hong Kong \"Policy Address\" proposed: to strengthen the patriotism and national security awareness of all civil servants.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862806187374436781","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 18:37:51","content":"November 29, Shaanxi. A man interviewed passers-by on the street: What is the most touching thing you have heard in 2024? Passer-by: \"It is the phrase that the government lives a tight life so that the people of the country can live a good life\" Netizen replied: I vomited all night after hearing this.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862808176737071185","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 18:37:56","content":"Recently, the Hefei Vanke Langshi real estate project was exposed to serious quality problems. The owners collectively refused to accept the house and gathered at the gate of the community to protest their rights. The developer instructed the workers to spray water to drive away the rights-defending owners, and finally a physical conflict broke out. After the conflict, the owners used various methods on various platforms to make sarcastic remarks about the developer. Some owners joked that the water sprayed by the developer was a gift.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862808981187784890","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 18:53:09","content":"On November 27, Henan. The woman said that when she took a picture of the national flag with a Huawei phone, she could not use the AI removal function to remove the national flag, and it said \"The removal function cannot be used for this picture.\" Netizens reported in the comment area that Xiaomi and OPPO were also unable to remove the national flag from the photo.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862811513071018095","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 18:53:15","content":"Some owners took the lead in setting up a WeChat public account to protect their rights and published a detailed tutorial on how to fill out a rejection notice, calling on owners to refuse to accept the house. A large number of owners responded to the call and sent a thick basket of rejection notices via EMS. The rights protection public account also posted that it found a large number of people suddenly appeared on Xiaohongshu and Douyin to whitewash the property, suspected to be hired by the developer. On the 27th, the rights protection WeChat public account received a lawyer's letter from the developer:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862812361079578628","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 19:08:28","content":"November 29 (Released) Japan. A woman posted a video saying that she rode a bicycle to a convenience store to buy something, and her child sat in the basket in front of the bicycle. As a result, an old lady stopped her and wanted to call the police. So she had to push the child home. The woman said she was very angry, \"The Japanese like to meddle in other people's business, and they even meddled in my business.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862812784167416071","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 19:08:34","content":"The rights-defending owners also have a sense of humor, and they use various means to criticize the developer's shoddy workmanship. The wires are exposed, but they praise Vanke for wrapping them with insulating tape. The floor tiles are loose and falling, but they say Vanke is actively solving the problem and has arranged for someone to buy double-sided tape to repair them. The drain in the underground garage is much higher than the ground, and they joked that it solved the problem of urgent urination, but they called on Vanke to buy a screen, otherwise it would be embarrassing to meet owners of the opposite sex.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862818033112424554","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 19:23:47","content":"On November 29, economist Ren Zeping said: If the private economy has no confidence, it is not enough to rely on government spending to boost the economy. The improvement of the private economy requires marketization and legalization. Marketization means letting go and letting enterprises create wealth, and legalization means that enterprises create wealth and you have to protect it. In recent years, our legalization needs to be strengthened. Boosting the confidence of the private economy is comparable to a 10 trillion stimulus.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862825483945279927","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 19:54:07","content":"Former gymnast Wu Liufang was questioned by netizens for switching to anchor after retirement. Wu Liufang said in a live broadcast that after retirement, she worked as an anchor in Hangzhou in 2019 with a guaranteed salary of 3,000 to 4,000 yuan. Her second job was as a teacher in a school in Hangzhou, but her boss withheld her salary and she didn't get the money in the end. In 2021, she moved to Jiaxing to be a coach, but after two years of work, she didn't get the establishment, so she resigned again.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862829706766438514","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 20:09:20","content":"On November 27, the Russian ruble fell by more than 8.5% against the US dollar. Guancha.com quoted an expert in an article: Why is Russia getting richer as it fights? Although the Russian-Ukrainian war accelerated the transformation of Russia's political and economic policies, Russia has implemented a series of industrial policies, and its production capacity has recovered and exceeded the highest level of the Soviet Union.","hasFullContentTranslated":true,"hasPublished":false}]