[{"id":"1862528578573017212","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 24:12:12","content":"At around 9 pm on the 29th, a male student from Wuhan City College in Hubei Province was reported online to have jumped off a building in Wuhan, Hubei Province. It was suspected that this was because he did not receive any salary for his internship at the school and had difficulty finding a job.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862533190243819742","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 24:27:25","content":"Recently, in Russia, a man said he took a taxi from Red Square back to his hotel. The taxi app showed that it only cost 400 rubles, but the taxi driver charged him 5,000 rubles! The man said: I will be angry with anyone who talks about the friendship between China and Russia. \"The driver also asked us if we were Chinese. If we were Chinese, we would be ripped off.\" Netizens: Don't destroy the friendship between the two countries for this little money. Be aware of the overall situation.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862539162920133134","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 24:57:46","content":"November 29, Guizhou. An uncle climbed a crane to ask for his hard-earned money. He said, \"I will get tens of thousands of yuan today even if I risk everything.\" November 29, Qiannan, Guizhou. The Longli Guanyinshan Forest Town project owed wages. Workers stood on the roof and crane and shouted, \"I want to go home for the New Year. Give me back my hard-earned money.\" November 28, Qianjiang, Hubei. Yuanlin Sake Co., Ltd. owed wages. Workers stood on the roof to ask for wages.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862642341934137442","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 07:46:13","content":"On November 28, in Huai'an, Jiangsu, two people drove their car to force open the door of a liquor store and stole liquor worth more than 200,000 yuan.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862646868846813565","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:01:26","content":"Netizen contribution: Recently, in an open class at a school in Jiangxi, students turned around and clapped in unison to welcome the leaders to the class. It can be heard that this clapping was practiced many times. The applause and movements were surprisingly synchronized. The direction of turning back for each leader was different, but each row of students could turn back at the same angle. Netizens in the comment area said: This is so exaggerated that they danced and clapped in unison, as if they had come to North Korea.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862649835238957332","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:16:39","content":"On November 28, many schools in Heilongjiang were exposed for deducting students' meal fees to provide teachers and staff with 2 yuan luxury breakfasts. One principal was also exposed to have asked for a 3 yuan kickback for each breakfast. In order to meet the school's 2 yuan standard for teachers and staff breakfasts, the catering company was forced to lower the student lunch standard. The student meal fee is only 12-15 yuan. After deducting the kickbacks to the principal, the teacher meal subsidy and their own profits, how much can go into the students' mouths?","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862653871338000397","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:31:52","content":"On November 27, residents of Yujicheng Community in Pingdingshan, Henan Province blocked the road to protest their rights due to insufficient heating. A staff member of Beihuan Road Sub-district Office said: \"After the heating was supplied, the residents felt that it was not warm enough, so they protested. They wanted to resolve their demands and used extreme methods, so they blocked the road. The secretary and director went there, and the police also went there. Now that their demands have been resolved, they will not block the road.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862656567029768632","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:47:05","content":"On November 28, a large number of migrant workers held banners at the gate of Changan Yiyang Power Generation Company to demand their wages and defend their rights. According to Qichacha, the company is a state-owned enterprise jointly owned by two state-owned enterprises, Shaanxi Coal and Electric Power and Yiyang Local Electric Power Investment Company.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862658830628528401","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 08:47:10","content":"Recently, a food delivery rider posted a post online complaining that not only is the salary low for food delivery, but now there is a deduction for the order. The advantage of crowdsourcing riders should be flexibility and freedom, but now they have to deduct ten yuan for refusing an order.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862727710319247475","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 13:19:30","content":"A retired soldier was deceived to northern Myanmar, but he sought help from the embassy but to no avail. He said frankly: It's very disappointing. A Quan from Shenzhen was a former armed police officer. In 2021, he was deceived by a man with a Fujian accent in Thailand to a Myanmar industrial park. Because A Quan did not want to defraud and was physically punished, he finally escaped one night and asked the embassy for help: I dedicated my youth to the motherland, please help me. Then the embassy did not respond. \"The Wolf Warrior in my heart at that time, I felt disappointed.\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862764593937805369","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 15:50:50","content":"RT @starshiner2023: A recent anti-lockdown protest in Chengdu by arrested youth: Eyewitness C airdropped his slogans from Sitong Bridge to the Chengdu subway until he was arrested and detained. Youth J rushed to Wangping Street at night, shouting \"Down with the nucleic acid economy, no lockdown, freedom\", marched in the city and was beaten and detained. There were about 40 spectators on the day, watching artist Deng Shangdong…","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862769414958989323","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 16:06:03","content":"On November 30, 2024, \"Flower Brother\" Li Yahui was interviewed by Voice of America:","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862780486369812787","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 16:51:31","content":"Recently, in Shandong, a user named Gray Wolf said: his father died of alcohol poisoning, his mother died in a car accident, he had no grandparents, and grew up eating at other people's houses. At the age of 19, he was diagnosed with advanced gastric cancer. He decided to go home to visit his family because he had no money for treatment. On the 29th, his friend posted a message saying that Huazi had passed away. The friend said: Huazi was kind and worked hard. He only drank a pack of soy milk powder every day. Later, he suddenly vomited blood and was diagnosed with gastric cancer. Before he died, he gave his remaining 3,000 yuan to his friend.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862784844419441128","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-30 17:06:44","content":"On November 29, Hu Xijin posted a video saying: Should Wu Liufang be tolerated? This was met with dissatisfaction and ridicule from netizens. Netizens responded: Hu Xijin has been released, what's wrong with Wu Liufang? You are much more harmful than she is. \"You can tolerate Lao Hu and Auntie Gu Yan, but you can't tolerate Wu Liufang, who is harmless and often does public welfare for the glory of the country?","hasFullContentTranslated":true,"hasPublished":false}]