[{"id":"1704558683361849784","name":"李老师不是你老师","createdDate":"2023-09-21 02:10:33","content":"After the game, Wuhan fans set fire to and tore down the Japanese flag outside the stadium","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704558683361849784_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/bzHxqiX4rO","accountId":"whyyoutouzhele"},{"id":"1704610101166854640","name":"李老师不是你老师","createdDate":"2023-09-21 05:34:52","content":"Follow-up of the incident\nShi Banyu said that the police station has contacted and understood the situation, and he has completely moved out of the original studio.\nThe video was taken down, not deleted.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704610101166854640_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/sHcwmSi774","accountId":"whyyoutouzhele"},{"id":"1704740994334224477","name":"李老师不是你老师","createdDate":"2023-09-21 14:15:00","content":"On September 20, the media reported that an off-campus internship arranged by a vocational and technical school in Chongqing included bathing male customers and massaging the genital triangle area.\nThe student complained to the class teacher but nothing happened. On September 14, the student's parents reported the case to the Chongqing police.\nThe internship unit involved said that the student's behavior was voluntary.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704740994334224477_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/De1JPCCRoC","accountId":"whyyoutouzhele"},{"id":"1704792375619457220","name":"李老师不是你老师","createdDate":"2023-09-21 17:39:10","content":"On September 21, a vehicle was suspected to have caught fire on the Shanghai Central Ring Elevated Road near Wenshui Road and Wanrong Road. Explosions were heard at the scene.\nFire and police have arrived at the scene. The specific situation is unknown.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704792375619457220_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/pBR2Txu0go","accountId":"whyyoutouzhele"},{"id":"1704792978093379942","name":"李老师不是你老师","createdDate":"2023-09-21 17:41:34","content":"On September 20, the Academic Affairs Office of Xi'an Jiaotong University announced that it would no longer use the College English Test Band 4 and Band 6, and scores of various English tests as conditions for undergraduate graduation and degree awarding.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704792978093379942_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/6U1X77SFpP","accountId":"whyyoutouzhele"},{"id":"1704793457984717020","name":"李老师不是你老师","createdDate":"2023-09-21 17:43:28","content":"On September 21, an explosion occurred at a factory in Dongguan County, Cangzhou, Hebei.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704793457984717020_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/2fvc9t0Rvk","accountId":"whyyoutouzhele"},{"id":"1704795184691581218","name":"李老师不是你老师","createdDate":"2023-09-21 17:50:20","content":"On September 21, an explosion occurred on a road in Jiaxing, Zhejiang. The cause is currently unknown.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704795184691581218_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/GoITXHSPcT","accountId":"whyyoutouzhele"},{"id":"1704797883948503253","name":"李老师不是你老师","createdDate":"2023-09-21 18:01:03","content":"Correction: the first five seconds of the video show the explosion in Cangzhou, Hebei today. The two submissions were mixed up.","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1704803362229621169","name":"李老师不是你老师","createdDate":"2023-09-21 18:22:49","content":"According to current information, the fire was caused by a truck tire burst.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704803362229621169_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/Avm5wXUGb8","accountId":"whyyoutouzhele"},{"id":"1704804104034299941","name":"李老师不是你老师","createdDate":"2023-09-21 18:25:46","content":"On September 19, a master's student from the School of Environment and Resources of Zhejiang University who had been delayed in graduation committed suicide by jumping into the Qizhen Lake in the Zijingang Campus.\nThe student's tutor allegedly asked him to drop out of school, and his family said the school was indifferent to the suicide.\nOn September 20, anonymous posts expressing condolences and discussing the incident in the school forum of Zhejiang University were blocked by 404. On the evening of September 20, about five people in white shirts were patrolling and standing guard on the lakeside where the body was suspected to have been fished out.\nIn addition, several students who posted non-anonymous posts to express condolences on the school forum received calls from the school leaders at night, asking them to delete the posts. Some students bought chrysanthemums and planned to distribute them for free to their classmates to pay tribute to the lakeside. After being discovered by the school, the chrysanthemums were confiscated and they were asked to be interviewed.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704804104034299941_0.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704804104034299941_1.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704804104034299941_2.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704804104034299941_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1704804281147166793","name":"李老师不是你老师","createdDate":"2023-09-21 18:26:29","content":"Students who went to mourn confronted the staff who tried to stop them in the rain.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704804281147166793_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/ifdg6nAV6B","accountId":"whyyoutouzhele"},{"id":"1704804517575901505","name":"李老师不是你老师","createdDate":"2023-09-21 18:27:25","content":"Students scattered flowers of mourning into the lake","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704804517575901505_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/VSo5jIlJPJ","accountId":"whyyoutouzhele"},{"id":"1704805006463918352","name":"李老师不是你老师","createdDate":"2023-09-21 18:29:21","content":"What happened online","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704805006463918352_0.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704805006463918352_1.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704805006463918352_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/l4X6LHTfKS","accountId":"whyyoutouzhele"},{"id":"1704805156401852590","name":"李老师不是你老师","createdDate":"2023-09-21 18:29:57","content":"https://t.co/6BhW3rO7GA","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704805156401852590_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/6BhW3rO7GA","accountId":"whyyoutouzhele"},{"id":"1704807872410837238","name":"李老师不是你老师","createdDate":"2023-09-21 18:40:45","content":"At present, there are a large number of employees and their families demanding wages in the comment section of every video on Kunming Metro’s official Douyin account.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704807872410837238_0.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704807872410837238_1.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704807872410837238_2.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704807872410837238_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/EMmNXXe6yv","accountId":"whyyoutouzhele"},{"id":"1704808116775235804","name":"李老师不是你老师","createdDate":"2023-09-21 18:41:43","content":"https://t.co/bLlZGCLWxk","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704808116775235804_0.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704808116775235804_1.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704808116775235804_2.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704808116775235804_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/bLlZGCLWxk","accountId":"whyyoutouzhele"},{"id":"1704815466655465743","name":"李老师不是你老师","createdDate":"2023-09-21 19:10:55","content":"https://t.co/lOXAPXxQ9x","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704815466655465743_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/lOXAPXxQ9x","accountId":"whyyoutouzhele"},{"id":"1704815842347601955","name":"李老师不是你老师","createdDate":"2023-09-21 19:12:25","content":"https://t.co/hnRUb9wZYx","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704815842347601955_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/hnRUb9wZYx","accountId":"whyyoutouzhele"},{"id":"1704817298920419768","name":"李老师不是你老师","createdDate":"2023-09-21 19:18:12","content":"On September 21, in Fuzhou, Jiangxi, a man climbed up a high-voltage power tower, walked back and forth between the poles and took off his clothes. It is said that he climbed up the power tower in a hurry when he was checked by the traffic police because he was riding an electric scooter without a helmet.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704817298920419768_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/ytYmfp8fxu","accountId":"whyyoutouzhele"},{"id":"1704820512478654638","name":"李老师不是你老师","createdDate":"2023-09-21 19:30:58","content":"On September 21, it was reported online that the Lingyin Temple in Hangzhou had laid a red carpet leading directly from the entrance to the main gate.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704820512478654638_0.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704820512478654638_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/WzZ0TthONl","accountId":"whyyoutouzhele"},{"id":"1704826983518253320","name":"李老师不是你老师","createdDate":"2023-09-21 19:56:41","content":"[Letters and visits are not as good as the Internet]\nOn September 20, the media reported that the director of the Letters and Visits Office of the Housing and Construction Bureau of Luonan County, Shangluo City, Shaanxi Province, repeatedly reported the deputy director of the Housing and Construction Bureau of Luonan County by real name for illegal issues such as interest transfer and the unknown source of huge amounts of property.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704826983518253320_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/8g9DLuuIuh","accountId":"whyyoutouzhele"},{"id":"1704835264961462424","name":"李老师不是你老师","createdDate":"2023-09-21 20:29:36","content":"It is reported that the car caught fire after colliding with another white van. It was not spontaneous combustion and there were no casualties.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704835264961462424_0.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704835264961462424_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/3r3icdyLBO","accountId":"whyyoutouzhele"},{"id":"1704837639193362607","name":"李老师不是你老师","createdDate":"2023-09-21 20:39:02","content":"On-site video supplement","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704837639193362607_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/PTsWQ5yP3z","accountId":"whyyoutouzhele"},{"id":"1704839483600843157","name":"李老师不是你老师","createdDate":"2023-09-21 20:46:21","content":"A netizen shared his experience","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704839483600843157_0.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704839483600843157_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/YZaxwOjasp","accountId":"whyyoutouzhele"},{"id":"1704865553372811531","name":"李老师不是你老师","createdDate":"2023-09-21 22:29:57","content":"  On September 21, an article titled \"Xu Chen, a young teacher at Zhejiang University of Communication, reported sexual assault by Fu Jin, a professor and doctoral supervisor at Shandong Normal University,\" was widely circulated among teachers and students at the Wall Art Institute. The full text is as follows: I am Xu Chen, female, born in 1989. I graduated with a PhD from Communication University of China in 2019, and then worked at Zhejiang Communication University. Real name report Dean of the School of Journalism and Media of Shandong Normal University, Vice Chairman of the Chinese Literary Critics Association, member of the 7th State Council Degree Committee Discipline Evaluation Group (Drama and Film and Television), member of the National Arts Fund Expert Committee, original school of the Chinese Academy of Opera Fu Jin, the director of the Academic Committee, the director of the Chinese Drama Research Center of the Central Academy of Drama, the director of the editorial board of the National People's Congress photocopied newspaper \"Stage Art\" (opera, drama), and professor and doctoral supervisor, tortured me. I have only met Fu Jin three times: The first time we met was when he participated in the defense of my doctoral thesis and served as the chairman of the defense committee. After the defense, I hosted a banquet with other teachers and classmates to thank the defending experts. With the encouragement of my mentor, I added Fu Jin’s WeChat account and toasted him with a glass of wine. Fu Jin picked up the wine glass with a smile and said, \"I don't usually drink, but today is an exception!\" Then he drank it all. As a junior and student, I was very grateful to Professor Fu Jin for his kindness. The second meeting was at an academic conference. After the meeting, Professor Fu Jin was surrounded by a group of people, but before leaving, he walked by my seat and smiled at me, and then took the initiative to send me a message. I felt guilty because of this, and felt that I was so rude that I didn't take the initiative to say hello to my seniors. Unexpectedly, the third meeting turned into my nightmare. It was October 31, 2019. Not long after I joined the company, I got my first business trip opportunity to participate in the 16th Chinese Theater Festival held in Fuzhou. My colleague Cao Nanshan (the witness of the incident mentioned below) was unable to set off at the same time as me due to work reasons, so he specifically told me to visit more senior teachers, especially Professor Fu Jin, during the conference. For me, who had been studying in school for the past thirty years and had no social experience, it was very scary to visit the teacher alone. After thinking about it, I checked into another hotel alone and reported my itinerary to the only senior I knew, Fu Jin, through WeChat. Fu Jin not only took the initiative to care and inquire about me, but also shared with me his experiences watching the drama in those days, so I actively and conscientiously reported to him everything I had done and thought. After that, Fu Jin invited me many times to attend the seminars he hosted, but I did not attend because of other arrangements. In other words, before Cao Nanshan arrived in Fuzhou, Fu Jin and I had not met alone. On November 4, Cao Nanshan arrived in Fuzhou. After learning that I had not visited Fu Jin and other seniors, or even checked into the participating hotels, but only communicated through WeChat, I was taught etiquette again. So I checked out of the previous hotel and went with Cao Nanshan to check in at Fuzhou Juchunyuan Exhibition Hotel, where the conference was held. Since we are not invited experts, the hotel can only provide us with accommodation at the original price (around 800). Considering that I had just started working and had no savings, Cao Nanshan thought of asking Professor Fu Jin to help us obtain the internal price of participating experts (around 400). At that time, I had just applied for a business card and was on the way from Hangzhou to Fuzhou. I had to ask the front desk if I could swipe another card first and then pay the bill and then convert it to a business card (my mother specially transferred 5,000 yuan to me before the business trip). (for emergencies). Fu Jin heard this and very generously took his business card directly to the front desk to advance payment for me. I declined repeatedly and refused to accept it, but Fu Jin said that the hotel could only use his business card to get the internal price, and it was a prepayment, so there was no need to worry. There were still many days to check out, and we could think of a solution then. I was very grateful to be cared for by an elder in this way. Later, Cao Nanshan and I went to the supermarket opposite the hotel and bought a lot of fruits and snacks, planning to give them to Professor Fu Jin later to express our gratitude. Thinking of my previous ignorance, I specifically asked Cao Nanshan if he wanted to visit Fu Jin early. Nanshan told me not to worry, saying that Fu Jin was a busy man and he had just met. It would be better to wait until after the show in the evening to deliver fruits together. But before Nanshan finished speaking, I received a WeChat message from Fu Jin, asking me to go and sit in his room. I immediately told Nanshan, and then the two of them quickly took the fruit to Fu Jin's room. After a brief chat, we all set off to watch the theater together. On the way back from the theater, Fu Jin did not take the first bus of the expert team. Instead, he took Cao Nanshan and I on the second bus to share our feelings about the theater, and made an appointment to chat in his room after returning to the hotel. . After getting off the bus, I asked Nanshan in a low voice whether it was appropriate to disturb the teacher's rest so late. Nanshan told me not to worry too much, saying that Fu Jin had always had this routine and was more energetic than young people. He also told me that it was the same when they participated in opera criticism training before: they discussed it immediately after watching the play and it was very rewarding. He told me not to miss it. Opportunities for seniors to learn. I thought so, and thought that if we had to chat for a long time and it would be inconvenient to use the bathroom in someone else's room, I told Cao Nanshan that I would go to the hotel lobby to use the bathroom first, and then go to Fu Jin's room to meet them later. This is where the nightmare begins. After walking into Fu Jin's room, I found that I was alone and Cao Nanshan was not there (Nanshan told me the next day that he had followed Fu Jin into the room as usual. But this time after Fu Jin entered the room, he immediately He turned around and kicked Cao Nanshan out, saying it was too late to talk. Although Nanshan felt it was sudden, he had to go back to his room. Later we figured out that Fu Jin had pretended to invite us to chat together in secret. Send Cao Nanshan away, just waiting for me to come to you without knowing it. Everything is a long-planned trap). I guessed at that time that Nanshan might have gone to the bathroom like me. After chatting with Fu Jin for a while, before Nanshan arrived, I began to feel a little uncomfortable. I felt that even though the other person was a senior who was more than 30 years older than me, he was of the opposite sex after all, so it was inconvenient after all, so I decided to leave. However, Fu Jin sometimes talked about my doctoral thesis, sometimes about drama, and sometimes about how to be a good scholar. Although I was anxious to leave, I still adhered to the tradition of respecting the teacher. Every time a topic ended, I took the opportunity to request to leave, but Fu Jin repeatedly refused. As time passed, I realized that Cao Nanshan would definitely not come, so I decided to get up and leave. Fu Jin finally nodded in agreement and stood up. I thought Fu Jin was going to see me off, so I hurriedly walked towards the door and waved my hand not to bother seeing him off. Unexpectedly, Fu Jin suddenly caught up with me, hugged me, stood between me and the door, and put his face close to me. It happened so suddenly! I didn't even have time to react before Fu Jin threw me onto the bed. I struggled to get up several times, but I didn't expect that I, a young woman, was completely unable to fight against an older man in his sixties. Fu Jin's greasy hair and sparse curly stubble rushed towards me with a stench. For a few seconds, I seemed to have lost consciousness. I only saw Fu Jin's face, like a living dead in the greenish light of the hotel. To this day, every time I think of this scene, I feel as if I have been sucked blood by a zombie eunuch. I am both frightened and disgusted. Thank God! I was wearing a pair of jeans and a pullover that were all buttoned that day, and they were not easy to unbutton, so I was able to break free when he was unbuttoning me, and I stood up and jumped out of bed. I desperately grabbed my clothes, my whole body was stiff and I couldn't move. Seeing my fierce reaction, Fu Jin changed his tactics. He sat on the bed, grabbed my hand, stared at me and said, \"Have you thought clearly? I never force others, so don't regret it!\" He repeated this sentence several times. That was the first time I really felt what it meant to be smiling but not smiling. I bit my lip and tried not to cry. I was afraid that I would be further intimidated and threatened, so I just relied on my escape instinct and walked toward the door. Fu Jin followed me again and grabbed me, saying that he was worried about me leaving alone and wanted to take me back to my room. My hands and feet were trembling, and I couldn't break away from his control. It was as if he was carrying me out of the door, into the elevator, and to the door of my room. As soon as he arrived at the door of the room, Fu Jin grabbed my room card, swiped it directly to enter the door, and immediately closed the curtains of the room and sat on my bed. My mentality is completely broken! Standing at the door not knowing what to do. I thought he realized that he had hurt me and was afraid that something would happen to me, so he sent me back, but I didn't expect that he was actually evil! I didn't expect him to be so arrogant. Not only did he dare to plot evil in his room, but he also dared to come into my room and try to invade me again in a hotel where surveillance was everywhere! It's terrible that a person doesn't even have a sense of security in his own room! I gathered myself together, finally mustered up the courage to walk into the room and asked him to come out. Fu Jin looked at me meaningfully and said \"Don't regret it in the future!\" several times. I begged him almost with desperation: \"Teacher, please let me go! Let's go!\" Similar conversations were repeated for several rounds, and Fu Jin was finally pushed out of the room by me. I couldn't help but yell. Start crying. The whole night, my stomach was like a rabbit thrown into the fire, twitching and roasting at the same time. I could only curl up and put a pillow against my stomach to relieve the pain. It was a sleepless night. During the period of pain, I sent messages to several close friends to tell them what had just happened. I still managed to keep my spirits up and did not dare to let down my guard. Every footsteps outside the door made me jump with fear. I was afraid of Fu Fu. I suddenly returned because with his ability, it was not difficult to get my room card at the front desk. Maybe I was overly frightened, but I felt so weak the next morning that I couldn't go out. Cao Nanshan felt something strange, so he called me and asked me to go downstairs and go to the theater together without letting Fu Jin wait for us. Out of helplessness, I had no choice but to tell Cao Nanshan the whole story. Nanshan was very surprised at the time, saying that although he had heard of Fu Jin's many misdeeds in this area before, he had always been unwilling to believe it out of respect for his teacher, and had been maintaining Fu Jin's image in front of outsiders. Cao Nanshan smoked cigarettes one after another. He couldn't understand why Fu Jin was so bold. In a high-end hotel where everything was under surveillance, he dared to commit violence on me, a junior with whom he had almost no interaction, and was so impatient. ! And suddenly realized why he had made an appointment with three people to chat together last night, but was sent away abruptly by Fu Jin. I thought of calling the police, but because Nanshan was working with Fu Jin at the time and had great respect for Fu Jin, after learning that Fu Jin's rape was unsuccessful, he advised me to settle the matter. I expressed my unwillingness, and Cao Nanshan tried hard to persuade me, asking me to think more about my future development and not just think about making a living. Once he offends Fu Jin, his future may be ruined. Besides, so many people have reported him before, but all failed. I am no match for him. I couldn't find support and had to call my mom. My mother is as kind and simple as me. She advised me to endure it if I can since I escaped the clutches of the devil. My mother also told me that the drama festival is not over yet and my work has not been completed. During this period, I should not get too serious with Fu Jin and just avoid seeing each other again to avoid retaliation. I understand my mother's distress and helplessness. She is not afraid that things will become tense, but she is worried that I will be isolated and helpless and hurt again in an unfamiliar place 2,000 kilometers away from my hometown. I comforted my mother in turn and assured her that I wouldn't be overwhelmed or make trouble, and then hung up the phone. After thinking about it for a long time, I finally didn't dare to tell my dad. Because I know that with my father’s love for me, he will definitely seek justice. I hope Fu Jin is punished, but it's not worth it to punish him and affect our family's peaceful life. The next afternoon, Fu Jin sent me an apology message. He interpreted his intrusion on me as his liking for me, and said that he had fallen in love with me the first time he saw me on the day of my defense. I just felt sick after seeing it, so I sent a screenshot to a friend who knew about it, and handed my phone to Cao Nanshan to see. Nanshan believes that since Fu Jin has taken the initiative to apologize, he should not let this incident affect our future relationship. He believes that Fu Jin will not dare to do anything that crosses the line again. They repeatedly advised me to pretend that nothing happened, reply to messages normally, downplay the matter, watch movies when I should, say hello when I should, and not have any alone contact in the future. I declined the offer to watch a show together and only responded to Fu Jin's messages at the bare minimum. Fu Jin's \"apology\" became more and more sincere, and he proposed to apologize in person and explain clearly. I'm used to being kind, and I felt that since Fu Jin had admitted his mistake, he must be sincerely remorseful for being able to do this, so I agreed to make it clear in person in the hotel lobby. And I also have another purpose: I want to end this matter and let him know that he has indeed caused harm to me, but I have no intention of reporting him. On the one hand, I did this out of sympathy, to save some face for an elder who admitted his mistake; on the other hand, I did this out of fear, so that he would not harm me. I wanted to prove I was harmless—who would push a harmless person to death? However, it turned out that I was wrong, and how wrong it was. I paid a heavy price for my innocence, kindness, retreat and tolerance! Some people have no conscience. The kinder the victim, the less bottom line the perpetrator has - when there is no cost or loss in harming others, doing evil becomes a perverted pleasure. Of course, this is something I learned later after Fu Jin repeatedly persecuted me over the next four years. After meeting in the lobby, Fu Jin said that there were too many people in the lobby and it was difficult to talk. There was a stage not far outside the hotel and he hoped that he could explain while walking. I thought there was nothing to be afraid of in the clear sky, so I agreed. During this process, he first expressed his love for me again and said that he could teach me how to read and write articles to support my career in the future. Then he gave many examples to prove his good character. Fu Jin said that there was a girl who admired him very much and told others that she had been in love with him. Wherever he went, the girl would follow him. He also pretended to be indignant and said that it was actually the girl who was mentally ill and liked him and seduced him, but he was unwilling to do so, so the girl went crazy and deliberately retaliated against him and slandered him. Afterwards, I realized that this was not the method used by some bad men to slander, suppress, and harm women—by portraying a woman as a madman in order to make all her words and deeds unreasonable. Seeing my suspicious look, Fu Jin then said: \"I am a very clean person. Think about it, I have judged awards for so many actors. If I were such a dirty person, wouldn't my reputation have been ruined long ago?\" ?\" As I watched Fu Jin work hard to prove his innocence, I felt that the world was so absurd and chaotic! I was even in a trance, and I didn’t even remember the photo he took with his mobile phone while I was sitting on a chair to rest. I just instinctively didn’t want to get along with this person anymore and ended the conversation in a hurry. What shocked me was that when we were about to separate in the hotel elevator, Fu Jin suddenly grabbed my hand again and said with a smile, \"Why don't you come and sit in my room?\" At that moment, I finally woke up completely: Fu Jin asked me out to meet him not to apologize at all, but he was still setting up a trap to deceive me! In the next few days, I avoided meeting him, but Fu Jin still sent me messages every day. I couldn't skip the meeting, so I could only bite the bullet and reply occasionally. As soon as I received the business card, I refunded the room fee that Fu Jin had paid in advance and informed him of the matter. I still expressed my gratitude to him for his help. Fu Jin also still avoided important matters and talked about things in an attempt to create opportunities to meet. But no matter what Fu Jin said, I realized his true nature and never agreed to meet him again. On the last day of the theater festival, Cao Nanshan asked Fu Jin to have dinner with us (later we learned that Fu Jin privately asked Nanshan to do this). Fu Jin was good at acting and still acted like an elder in front of Cao Nanshan, but when Cao Nanshan left the table to pay the bill, he immediately changed his face. Fu Jin once again said that as long as I am willing, he will come to Zhejiang more often. I tried not to break my heart, finished the meal with great disgust, and then returned to Hangzhou with Cao Nanshan. On the way back to Hangzhou, I told Cao Nanshan all the details. Although Nanshan also felt that Fu Jin's behavior was too much, he was also soft-spoken and could only comfort me and persuade me not to make the matter a big deal. Since then, I have never had any interaction with Fu Jin for four years. Perhaps due to excessive panic, I couldn't afford to fall ill after returning to Hangzhou. I didn't want to go out or see people. It was difficult for me to even go to school, so I just hid at home every day. My mental state was extremely poor, I was often distracted, occasionally cried for no reason, and I even wanted to end my life many times. Although Fu Jin's physical harm to me was limited, he left an indelible shadow on my mind. I lost trust in men, I lost trust in the teacher-student relationship, I lost trust in the sanctity of scholarship. In Hangzhou, a place with no friends, I was helpless. I was afraid that I would not be able to survive this experience, and I was even more afraid that my future and academic life would end before it even started, as Fu Jin had repeatedly threatened. I'm scared and don't know what to do. I couldn't talk to my parents; my friends were just like me, fledgling and weak, and I couldn't bear for them to feel sorry for me. I had nowhere to tell my story, and my grief and depression piled up in my heart, and my condition became increasingly serious. Finally, I couldn't bear it anymore, and on November 28, I went to the Clinical Psychology Department of Hangzhou First Hospital for a full set of examinations and psychological counseling. The report showed that I was in a state of depression. When the doctor asked about my situation, I was evasive and didn't want to mention Fu Jin's matter. But patients have no secrets in the eyes of doctors, especially when facing a professional and sensitive female psychologist. After just a few words, the doctor carefully asked me if I had been violated recently. I avoided answering, didn't want to record this matter, and got up and left. The doctor was very responsible, stopped me, and told me not to worry, she understood and understood what I didn't say. The doctor prescribed me medicine, left contact information, and told me that she hoped I would take the medicine as prescribed and keep in touch with her. But because I was too sad and the hospital was more than 20 kilometers away from home, I couldn't continue treatment. I stared at the depression diagnosis book every day, lost the ability to live a normal life, and felt that the world was dark. Because I hadn't been to school for a long time, the office director of my department noticed my abnormality and repeatedly asked me over the phone. I had no choice but to send her the report on depression. The director was very worried and quickly reported to my department leader at the time. The leader asked me to come to school no matter what. Faced with the leader's repeated questioning, my long-suppressed emotions finally broke out and I told the story. The state of being on the verge of collapse was finally relieved a little. Until now, I am very grateful for the care and help from my leaders and colleagues at that time. They helped me through the darkest moment of my heart. The pain left by Fu Jin has never subsided. I have been tolerant and avoiding, all for survival. However, in the next four years, Fu Jin abused his power again and again. Whenever he encountered my articles and projects, he would suppress them crazily for various reasons. His behavior was so abnormal and excessive that it puzzled other people present. They asked me why I had such a deep grudge with Fu Jin. If escaping rape is also a grudge, I really have no way to defend myself. In order to escape the persecution of the devil, my only way to survive was to report him, so that people who didn't know the truth would not be kept in the dark, and the bad guys would be able to speak eloquently, reverse right and wrong, and climb higher and higher on the corpses of the victims, and gain more and more power. I was clear about every time Fu Jin harmed my academics. His bullying behavior not only proved the content of the joint report letter of teachers from the Chinese Academy of Traditional Chinese Opera that was widely circulated a few years ago: those who obeyed him became his harem and were supported; those who disobeyed him were cruel and repeatedly harmed. It also verified his threats and intimidation in the hotel room that year, asking me to \"not regret it in the future.\" When I decided to stand up and expose his ugly face, my teachers, friends, and colleagues around me were worried whether I could withstand the pressure of public opinion. Because in China, as a woman, being sexually assaulted is a shame in itself, and making it public will inevitably bring secondary harm. When things move from the confined space where the crime occurred to the public space where comments can be made at will, the persecution of the victim by the perpetrator shifts from the body to the mind. However, I have nowhere to go, I can no longer bear it, I can no longer hide, I can no longer avoid it. I believe that this world does not belong to a bad guy who thinks he can cover the sky with one hand. I believe in the public's judgment and support for justice. When I can't get everything for my grievances, when good people are not rewarded, when I can't get a broader horizon if I take a step back, and when I can't get peace and quiet if I take a step back, I know that evil can't be influenced, it can't be self-purified, it can only be eradicated. My sadness, despair, anger and resistance at this moment do not come from a leader or hero who is cruelly destroyed when he fights against evil forces on his own; but from a victim who has neither made mistakes nor deliberately done anything wrong, and even wants to keep things quiet, compromise, give in again and again, and take the other party's face into consideration, but is still intimidated, threatened, deprived, and killed. If you don't stand up at all costs, you are helping the bad guys to do evil, and you are an accomplice. Fu Jin, I am not afraid of death, but I am afraid of dying in confusion and in obscurity, while the world does not even know that you, a wolf in sheep's clothing, are still sniffing every opportunity to do evil. It is you who made me stand up, I have no choice. I am a 34-year-old young scholar who has been bullied and suppressed by you since I graduated. You are a 68-year-old senior professor and doctoral supervisor who has worked in almost all relevant schools, with countless hats, enjoying special subsidies from the State Council, and swindling people everywhere with the title of \"the first person in opera research\". Your resume is shining, and you have already got everything you want. But behind this shining resume, how many innocent girls who are determined to study have you deceived with your mask? How many innocent women's physical and mental health have you destroyed? And how many young scholars' bright futures have you destroyed? I dare not think. It is precisely because I dare not imagine that I must stand up. To paraphrase Mr. Lu Xun: When I opened your resume and checked it, it had no date, and the words \"benevolence, righteousness, morality\" were written on every page. I couldn't sleep anyway, so I looked carefully for half a night, and only then did I see from the gaps between the words that the whole book was written with two words, \"eat people\". People are not plants that can be hurt and trampled on at will. If a person can use power to treat another living person like an ant, then even if you are as humble as an ant, you must resist with your own strength. You were recognized by the industry in your early years with your book \"The Power of Grassroots\", and I want to say, Fu Jin, you don't deserve it. You are not qualified to represent the grassroots, and what you do is to cut the grass and uproot it, which is harmful to the world! Although I am weak, like a weed, I will always sprout again in the next spring. I am not afraid of you, and I don't have anything to lose. I will never give in to you again, and I will not continue to let you slaughter me. On the road to exposing your ugly face, I will grit my teeth and move forward. I have both courage and confidence, even if tomorrow is cold and the road is long. If the road ahead is dark, I will burn myself and become the weak but real light, not the \"disappearing her\" as you wish. Because when facing the evil forces of darkness, what I am afraid of is not that the sun cannot shine into the cracks, but that I dare not yearn for the light anymore. I originally had nothing, and there is no stronger weapon than this.","images":"/tweet/image/whyyoutouzhele/2023/09/21/1704865553372811531_0.jpg,/tweet/image/whyyoutouzhele/2023/09/21/1704865553372811531_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1704866293113819269","name":"李老师不是你老师","createdDate":"2023-09-21 22:32:53","content":"On September 21, a property built by Fujian Jianfa Group in Putian cost 3,000 yuan for fine decoration, but the effect was not as good as that of 1,000 yuan. In the afternoon, more than 100 owners went to the Housing and Urban-Rural Development Bureau to seek an explanation from Jianfa leaders. Jianfa pretended to be stupid if they did not provide a solution. The owners gathered at the door and shouted for their rights. Jianfa leaders called dozens of police officers to form a human wall to escort Jianfa leaders away.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704866293113819269_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/p1LHpAehZI","accountId":"whyyoutouzhele"},{"id":"1704888005746360610","name":"李老师不是你老师","createdDate":"2023-09-21 23:59:10","content":"On September 20, an e-commerce company posted a video saying that it had lost thousands of yuan because of the Hangzhou Asian Games.\nThe video said that because of the Hangzhou Asian Games, more than 30 pieces of goods sent to Zhejiang were returned every day. Not only were the goods returned, but the platform also fined 5 yuan per order, resulting in heavy losses.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/09/21/1704888005746360610_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/ttlckOVkHk","accountId":"whyyoutouzhele"}]