[{"id":"1752010482368516110","name":"李老师不是你老师","createdDate":"2024-01-30 00:47:04","content":"On January 29, the student chose to defend his rights outside the milk tea shop by holding up a sign that read \"Gu Ming defrauds students and provides free labor.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/30/1752010482368516110_0.jpg","hasPublished":true},{"id":"1752011719319117890","name":"李老师不是你老师","createdDate":"2024-01-30 00:51:59","content":"On January 28, Yu Chengdong said, \"Huawei always puts user privacy protection first and continues to use innovative technology to protect everyone's privacy and security.\" As a result, he was ridiculed by a large number of netizens in the comment area, and some users questioned why Huawei deleted sensitive videos and pictures in the mobile phone album for no reason.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752011719319117890_0.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752011719319117890_1.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752011719319117890_2.jpg","videos":"","hasPublished":true},{"id":"1752012371176894899","name":"李老师不是你老师","createdDate":"2024-01-30 00:54:34","content":"January 28, Jiaxing, Zhejiang. Migrant workers were owed wages by the boss of a garment factory. They went to the Labor Bureau to deal with the matter but to no avail. When the police arrived, they not only did not deal with the boss, but drove the workers who were asking for wages out of the factory.\nAfterwards, some workers who were forced to do so chose to jump off the roof of a building to demand their wages.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/30/1752012371176894899_0.jpg","hasPublished":true},{"id":"1752017406719881330","name":"李老师不是你老师","createdDate":"2024-01-30 01:14:35","content":"Currently, the 20,000 comments in the comment section have been cleared to only 174.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752017406719881330_0.jpg","videos":"","hasPublished":true},{"id":"1752067582318805190","name":"李老师不是你老师","createdDate":"2024-01-30 04:33:58","content":"Recently, Gan Bihua, a retired professor of the Composition and Conducting Department of Shanghai Conservatory of Music, sent serious feedback to Liao Changyong, the president of Shanghai Conservatory of Music, and the Academic Affairs Office of Shanghai Conservatory of Music on the questions and marking of the harmony entrance examination, but received no response. As the examination is approaching, she decided to publish the contents of the letter in her real name to defend the fair and just rights that candidates should enjoy.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752067582318805190_0.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752067582318805190_1.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752067582318805190_2.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752067582318805190_3.jpg","videos":"","hasPublished":true},{"id":"1752132142904062333","name":"李老师不是你老师","createdDate":"2024-01-30 08:50:30","content":"On January 29, the Shenzhen Institute of Advanced Technology of the Chinese Academy of Sciences announced a substantial increase in dining prices. The previous 10% discount for breakfast, 50% discount for dinner, and no discount for lunch were revised to 40% discount for breakfast, 20% discount for dinner, and no discount for lunch.\nThe notice stated that the substantial preferential subsidies paid by the fiscal funds subsequently brought many problems, including national audit risks, so the prices were adjusted.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752132142904062333_0.jpg","videos":"","hasPublished":true},{"id":"1752149632824541535","name":"李老师不是你老师","createdDate":"2024-01-30 10:00:00","content":"Some online discussions about the recent series of high school students jumping off buildings in Jiangsu.\nOn one hand, there is the high-pressure study in school, and on the other hand, there are parents who do not give any breathing space.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752149632824541535_0.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752149632824541535_1.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752149632824541535_2.jpg","videos":"","hasPublished":true},{"id":"1752281955725357489","name":"李老师不是你老师","createdDate":"2024-01-30 18:45:48","content":"As A-shares fall again, people are looking forward to \"bad news\" again","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752281955725357489_0.jpg","videos":"","hasPublished":true},{"id":"1752282664776695906","name":"李老师不是你老师","createdDate":"2024-01-30 18:48:37","content":"Xinjiang Radio and Television Station interviewed Sohail Khan, Deputy Secretary-General of the Shanghai Cooperation Organization Secretariat, and asked him whether he thought the election system of Chinese deputies to the National People's Congress was democratic?\nNetizen comments: Cash back for good reviews","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752282664776695906_0.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752282664776695906_1.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752282664776695906_2.jpg","videos":"","hasPublished":true},{"id":"1752284968011673890","name":"李老师不是你老师","createdDate":"2024-01-30 18:57:46","content":"On January 30, Shanghai announced a significant relaxation of housing purchase qualifications. Non-local residents who have paid social security and personal income tax for five consecutive years can purchase only one house outside the outer ring road.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752284968011673890_0.jpg","videos":"","hasPublished":true},{"id":"1752285226301300764","name":"李老师不是你老师","createdDate":"2024-01-30 18:58:48","content":"On January 30, on the streets of Tianjin.\nA red Zotye car had a slogan on it: \"Eliminate fascism, freedom belongs to the people. Eliminate judicial corruption, and patriotic people will be liberated.\"","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752285226301300764_0.jpg","videos":"","hasPublished":true},{"id":"1752285454228136199","name":"李老师不是你老师","createdDate":"2024-01-30 18:59:42","content":"https://t.co/ZMzzw6PmWs","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752285454228136199_0.jpg","videos":"","hasPublished":true},{"id":"1752295288117616845","name":"李老师不是你老师","createdDate":"2024-01-30 19:38:47","content":"On January 29, a man who claimed to be an associate professor at the Guilin Institute of Aeronautical Technology in Guangxi reported on social media that the former party secretary of the Guilin Institute of Aeronautical Technology had engaged in power-for-sex transactions, raped and recorded multiple female students, and secretly photographed female teachers. He also claimed that he was drugged twice by the other party during his doctoral examination.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/30/1752295288117616845_0.jpg","hasPublished":true},{"id":"1752298666444943872","name":"李老师不是你老师","createdDate":"2024-01-30 19:52:12","content":"On January 30, the media reported that the young man born in 1999 worked five jobs and paid off his 90,000 yuan debt in 30 months. He only slept three or four hours a day to make money.\nNetizens were \"concerned\" about why he didn't go out to deliver food.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752298666444943872_0.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752298666444943872_1.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752298666444943872_2.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752298666444943872_3.jpg","videos":"","hasPublished":true},{"id":"1752299011325759621","name":"李老师不是你老师","createdDate":"2024-01-30 19:53:35","content":"On January 30, Tianjin’s Hebei District Wanfu Life Plaza owed workers money for renovating the mall’s exterior walls. Workers drove an elevator to the mall’s entrance and hung banners to protest their rights.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752299011325759621_0.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752299011325759621_1.jpg","videos":"","hasPublished":true},{"id":"1752302596348363068","name":"李老师不是你老师","createdDate":"2024-01-30 20:07:49","content":"Under a Xiaohongshu post, medical workers from all over the country reported that there are currently wage arrears and salary cuts in hospitals.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752302596348363068_0.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752302596348363068_1.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752302596348363068_2.jpg","videos":"","hasPublished":true},{"id":"1752305093397893359","name":"李老师不是你老师","createdDate":"2024-01-30 20:17:45","content":"On January 30, migrant workers from Hubei Wuhan Telecommunications Engineering Co., Ltd. demanded their wages","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/30/1752305093397893359_0.jpg","hasPublished":true},{"id":"1752307376198144336","name":"李老师不是你老师","createdDate":"2024-01-30 20:26:49","content":"On January 30, Landspace admitted that the loud noise was indeed caused by the company's test. There were no abnormalities in the test control process, some glass was slightly damaged, and three production staff were slightly scratched.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752307376198144336_0.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752307376198144336_1.jpg,/tweet/image/whyyoutouzhele/2024/01/30/1752307376198144336_2.jpg","videos":"","hasPublished":true},{"id":"1752314593626534395","name":"李老师不是你老师","createdDate":"2024-01-30 20:55:30","content":"Shandong Baoma responds to Bai Yansong about why ordinary people dare not spend money.\nRecently, in the CCTV program \"News 1+1\", the host Bai Yansong asked the expert \"Chinese people have money but dare not spend it, and are unwilling to spend it. What do you think of people willing to spend money?\" It has aroused widespread public discussion.\nOn January 29, a Baoma from Dezhou, Shandong, sent a video to respond to Bai Yansong, which caused heated discussions among netizens. She said: \"It's not that we don't want to consume, but we really don't have money.\"\nIn the video, she said that we have a small family of four. My husband works in other places. He bought a house last year and owed a foreign debt of 300,000 yuan. I don't know when I can pay it back. My parents are old and in poor health. My mother had a cerebral infarction last year and still can't take care of herself. And my parents' pension is only 150 yuan a month, which is not enough to buy medicine once. I don't know if Mr. Bai Yansong has seen the vegetable market arguing for a few cents, the taxi drivers sighing in the middle of the night, and the vendors who are still setting up stalls in minus ten degrees and have no business. I also want to consume and take my family out for travel. But I really have no money. If possible, Mr. Bai Yansong could suggest that we create more jobs, lower oil prices, and when we have money, we will naturally consume.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/30/1752314593626534395_0.jpg","hasPublished":true},{"id":"1752335553079427431","name":"李老师不是你老师","createdDate":"2024-01-30 22:18:47","content":"On January 30, Henan Village Bank depositors issued a joint reward announcement, offering a reward of 1 million yuan to the public to collect clues about crimes committed by Yuan Xiaogang, president of the Henan High People's Court, and Zhou Zhigang, president of the Xuchang Intermediate People's Court, during their tenure as public officials.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752335553079427431_0.jpg","videos":"","hasPublished":true},{"id":"1752336252974649576","name":"李老师不是你老师","createdDate":"2024-01-30 22:21:34","content":"It is reported that many of the unresolved large-scale capital issues in the Henan Village Bank incident were caused by entrepreneurs.\nNow that the company is facing the point of being forced into bankruptcy due to a broken capital chain, they are no longer afraid of them and have affixed the company seal.","images":"/tweet/image/whyyoutouzhele/2024/01/30/1752336252974649576_0.jpg","videos":"","hasPublished":true},{"id":"1752356312581574680","name":"李老师不是你老师","createdDate":"2024-01-30 23:41:16","content":"On January 30, the owners of Wuhan Sunac First River Residences went to the Wuhan Housing and Urban-Rural Development Bureau to defend their rights","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/30/1752356312581574680_0.jpg","hasPublished":true}]