[{"id":"1762243612048273621","name":"李老师不是你老师","createdDate":"2024-02-27 06:29:52","content":"Recently, the topic of delaying the retirement age to 65 has sparked heated discussions and opposition among netizens.\nCurrently, the topic \"delaying retirement\" has been banned on Weibo.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762243612048273621_0.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762243612048273621_1.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762243612048273621_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762267006894522513","name":"李老师不是你老师","createdDate":"2024-02-27 08:02:50","content":"At present, some owners have stated on social media that temporary entry and exit permits have been issued to Mingshang Xiyuan, the fire-affected residential area in Nanjing.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762267006894522513_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762273569638174839","name":"李老师不是你老师","createdDate":"2024-02-27 08:28:55","content":"This is the prequel to the incident in which a female entrepreneur from Liupanshui, Guizhou was provoked for asking for project payment. At that time, her attorney, Hou Zhitao, called on the public to pay attention to their situation. Because of this incident, the entire legal team was provoked.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762316876393419191","name":"李老师不是你老师","createdDate":"2024-02-27 11:21:00","content":"https://t.co/QFWDpHPISb","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762316876393419191_0.jpg","videos":"","hasPublished":true},{"id":"1762393529081311680","name":"李老师不是你老师","createdDate":"2024-02-27 16:25:35","content":"February 27, Chongqing Banan District. Elderly people took to the street to block the road.\nIt is said that the reason is that there was originally a zebra crossing here last year, but then the government built a fence in the middle of the road, making it inconvenient for pedestrians on both sides of the road to travel.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/27/1762393529081311680_0.jpg,/tweet/video/whyyoutouzhele/2024/02/27/1762393529081311680_1.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762409347424907673","name":"李老师不是你老师","createdDate":"2024-02-27 17:28:27","content":"From the picture, we can see the original zebra crossing and the obvious signs of being blocked.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762409347424907673_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762410152060174772","name":"李老师不是你老师","createdDate":"2024-02-27 17:31:38","content":"Netizens added","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762410152060174772_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762410963649646776","name":"李老师不是你老师","createdDate":"2024-02-27 17:34:52","content":"On February 27, the Standing Committee of the Tianjin Municipal People's Congress decided to accept Qin Gang's resignation as a representative of the 14th National People's Congress.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762410963649646776_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762411297256173603","name":"李老师不是你老师","createdDate":"2024-02-27 17:36:11","content":"Three months after the \"Egg Fried Rice\" incident, Wang Gang returned and started releasing new videos again.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762411297256173603_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762428350260232440","name":"李老师不是你老师","createdDate":"2024-02-27 18:43:57","content":"On February 27, Zhengzhou, Henan. A man stood outside the third-floor window holding a sharp knife.\nAccording to online rumors, the man did this because he was fired by the company after the Chinese New Year, and his salary was in arrears for three years.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/27/1762428350260232440_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762438103468302719","name":"李老师不是你老师","createdDate":"2024-02-27 19:22:43","content":"On February 27, Shuicheng District, Liupanshui City, Guizhou Province, issued a report stating that the news that the government owed enterprises 220 million yuan was false, and a woman was arrested for fabricating false information and maliciously hyping it up.\nOn February 26, Hao Cheng, a reporter from China Business News who reported the incident, said that he had previously sent text messages to the Yuhai Management Committee, Shuicheng District Court judges, Shuicheng District Mayor, Shuicheng District Prosecutor and others to inquire about the matter, but received no response.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762438103468302719_0.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762438103468302719_1.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762438103468302719_2.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762438103468302719_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762438734723616884","name":"李老师不是你老师","createdDate":"2024-02-27 19:25:13","content":"A document dated September 22, 2021, titled \"Opinion on the Handling of Ma Yigai's Petition by Yushe Forest Tourism Development Co., Ltd., Shuicheng District, Liupanshui City\", shows that after verification and investigation, the claim raised by Ma Yigai that \"the Yeyuhai Management Committee of Liupanshui City, Guizhou Province has been in arrears of project funds for 5 years and has been in arrears for 104 days\" is true.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762438734723616884_0.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762438734723616884_1.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762439831580262438","name":"李老师不是你老师","createdDate":"2024-02-27 19:29:35","content":"Recently, a screenshot of a Weibo report about \"Captain Wang Mouliang of Wei County Fire Brigade in Hebei Province showing off his power and taking his family to eat a free meal\" was widely circulated.\nThe report stated that Captain Wang Mouliang of Wei County Fire Brigade led more than 20 people to a hotel on the second day of the Chinese New Year. After the meal, he not only asked for a free meal, but also issued a high fine.\nThe reporter said that he \"didn't understand where I offended Captain Wang to make him treat us so ruthlessly.\nThe report also included a bill for a payable amount of 1,394 yuan, with the words \"Fire Brigade\", \"Wang Mouliang\", \"Free of charge\", etc., and a unified receipt for a fine of 4,900 yuan.\nOn the 27th, the reporter contacted the Hebei Provincial Public Security Fire Brigade, and a staff member said that the incident had been handled and the person involved had been fired.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762439831580262438_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762446600155090996","name":"李老师不是你老师","createdDate":"2024-02-27 19:56:28","content":"Netizen contribution\nA month ago, a discussion was held on Tsinghua’s campus forum about a student who was approached by the police for following me.\nAccording to the description, this student should have registered Twitter with a domestic mobile phone number during high school.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762446600155090996_0.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762446600155090996_1.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762446600155090996_2.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762446600155090996_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762452334553022669","name":"李老师不是你老师","createdDate":"2024-02-27 20:19:15","content":"On February 27, a screenshot circulated on the forum of Hubei Three Gorges University showed that the head teacher of Computer Science Class 2 notified all students that he would check whether there were any games installed on their phones in the evening (?)","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762452334553022669_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762452887035122072","name":"李老师不是你老师","createdDate":"2024-02-27 20:21:27","content":"Of course, some students also think that it may be an excuse to check whether there are other software on the phone.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762461741898690892","name":"李老师不是你老师","createdDate":"2024-02-27 20:56:38","content":"Subsequent developments one year after the incident:\nAfter the incident, the Jiangning District Real Estate Bureau, Chunhua Sub-district, and Qiaotou Community refused to allow the new property to enter the site on the grounds that there was an ongoing lawsuit without a result. In January 2024, the second instance of the lawsuit was finalized, and the selection of Yincheng Property as the new property was legal and valid, and the contract was legal. However, the Jiangning District Real Estate Bureau, Chunhua Sub-district, and Qiaotou Community still did not allow Yincheng Property to enter the site, and threatened that if Yincheng entered the site, they would impose credit penalties on the company. …","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762462587210416201","name":"李老师不是你老师","createdDate":"2024-02-27 21:00:00","content":"February 27, Harbin, Heilongjiang. A worker posted a video saying that Xinghua Wood Industry has been in arrears with wages, and the workers have been asking for wages for ten years without success, so they had no choice but to go to the district government to ask for an explanation.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/27/1762462587210416201_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762462712993333331","name":"李老师不是你老师","createdDate":"2024-02-27 21:00:30","content":"February 26, Tangshan, Hebei. The Central Yuefu residential complex was delayed for eight months before delivery, and the developer violated regulations and did not provide any compensation. The owners gathered outside the sales office and held banners to protest their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/27/1762462712993333331_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762479664851804460","name":"李老师不是你老师","createdDate":"2024-02-27 22:07:52","content":"February 26 (Released) In Zhengzhou, Henan Province, the Zhongzhou Textile No. 1 Yard Project owed workers wages. The workers wore vests with the words \"China Construction Second Engineering Bureau, give me back my hard-earned money\" printed on them and gathered outside the construction site to demand their wages.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/27/1762479664851804460_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762479782258724921","name":"李老师不是你老师","createdDate":"2024-02-27 22:08:20","content":"February 27 (Released) In Heihe City, Heilongjiang Province, a woman posted a video saying that she was intercepted by the local Justice Bureau section chief and police when she went out to see a doctor, and was dragged into a car and taken away.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/27/1762479782258724921_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762507770933149698","name":"李老师不是你老师","createdDate":"2024-02-27 23:59:33","content":"Today, the topic \"Taiwan Province\" topped the Weibo hot search list.\nThe reason is that Apple's mobile map in China marked Taiwan as \"Taiwan Province\". Clicking \"Taipei City\" will show that it is located in Taiwan Province, China. However, Apple maps in other countries and regions will show \"Taipei, Taiwan\".\nIt is reported that Apple Maps is provided by Amap in China.","images":"/tweet/image/whyyoutouzhele/2024/02/27/1762507770933149698_0.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762507770933149698_1.jpg,/tweet/image/whyyoutouzhele/2024/02/27/1762507770933149698_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false}]