[{"id":"1844062242268119339","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 01:07:54","content":"On October 9, netizens discovered that many of Hu Chenfeng’s accounts were shown as banned from following.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844062242268119339_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844062242268119339_1.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844062242268119339_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844109554457641065","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:15:54","content":"Following the \"wisp-fire teenagers\" in Jinan, dozens of people formed a group to blast the streets in Shantou, Guangdong in the early morning of October 9.\nAccording to Da Wan News: Not long after the incident of many young people blasting the streets in Lixia District, Jinan City, a netizen posted a video saying that someone drove a motorcycle to blast the streets in Chendian Town, Chaonan District, Shantou City, Guangdong Province, and dozens of people made noise while riding, which seriously affected the normal life of surrounding residents.\nIn the video, dozens of people drove motorcycles through the streets. Some people installed alarms on the front of the car and kept sounding alarms, and some people sat in the back seat and kept making noise. Witnesses in the video comment area said that this large-scale street blasting behavior is not common, and it has only happened once in more than two months.\nOn the morning of October 9, Da Wan News reporters contacted the Chendian Town Government about this matter. A staff member told reporters that they had paid attention to the matter, \"The relevant departments have intervened to deal with it, and the specific information is subject to official notification.\" According to reports, motorcycle blasting has always been...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844109554457641065_0.jpg,","hasFullContentTranslated":false,"fullContent":"继济南“鬼火少年”炸街后，10月9日凌晨，广东汕头又出现数十人组团骑车炸街。\n据大皖新闻报道：济南市历下区多名年轻人炸街事情刚发生不久，有网民发布视频称广东汕头市潮南区陈店镇有人驾驶摩托车炸街，数十人边骑车边发出噪音，对周边居民正常生活造成严重影响。\n视频中，数十人驾驶着摩托车穿行在街道上，有人在车头安装警报器，不断发出警报声，也有人坐在后座不断发出噪音。视频评论区有目击者表示，这种大规模的炸街行为并不常见，两个多月来只遇到这一次。\n10月9日上午，大皖新闻记者就此事联系上陈店镇政府，一名工作人员向记者表示已关注到此事，“相关部门已经介入处理，具体信息以官方通报为准。”据介绍，摩托车炸街一直是当地整治的对象，汕头市公安局潮南分局陈店派出所工作人员回应称：“今晚会派人去巡查一下。”","hasPublished":true},{"id":"1844109689774277074","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:16:26","content":"On October 9, the Wall Street Journal published an article analyzing the reasons for today's A-share market decline, believing that the main reason was that the National Development and Reform Commission's press conference did not release more positive signals. Lu Ting, chief economist of Nomura China, also reminded clients in a report last Thursday that in a pessimistic scenario, the stock market may plummet after the high sugar effect, similar to the plunge after the surge in 2015. The stimulus policies introduced in the next few weeks may also have only limited impact on the many challenges facing the real economy.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844109689774277074_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844109689774277074_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844110730628563058","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:20:34","content":"On October 9, a netizen posted a video saying that a rural resident's living environment was poor and a child was suspected of eating dirt on a tricycle. Reporters verified that the incident occurred in Wangqiao Village, Mituo Temple Township, Xincai County, Zhumadian City, Henan Province.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844110730628563058_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844114021563486415","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:33:39","content":"On October 9, the women's team final of the 2024 Table Tennis Asian Championships ended. The Chinese women's table tennis team composed of Sun Yingsha, Chen Xingtong and Wang Yidi lost 1-3 to the Japanese team and unfortunately won the runner-up.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844114021563486415_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844114021563486415_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844119720888500319","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:56:18","content":"October 6, Xiamen, Fujian. A surveillance video of a man threatening a merchant at the door of a store on Gulangyu Island, \"You have offended someone\" and \"I will find faults to close the store\", has attracted attention. According to the boss, the man involved brought a woman to take photos, wanting to \"get a set of travel photos for free\". After being rejected, he became angry and scolded the clerk, \"You have offended someone\", and repeatedly emphasized, \"Do you know what I do?\" In addition, the man kept saying, \"If I don't shut down your store, I will support you\", \"Do you believe it or not, I will issue a bill to fine you and punish you to death\", \"I can find faults to close your store at will\", etc. During this period, the man also notified others to inquire about the legal person information corresponding to the merchant's house number. On the morning of October 9, a Jimu News reporter sent a private message to the publisher of the video to learn more details, but received no reply. The staff of the Gulangyu Management Committee said that this person was not a manager. But as of press time, the surveillance video has been deleted.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844119720888500319_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844120690703860186","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 05:00:09","content":"On October 9, it was reported online that the famous film \"Black Cannon Incident\" shot in the 1980s was cut at a film festival in Guangzhou on September 28. Netizens lamented that the film that could be shot 40 years ago can not only not be shot now, but can not even be released.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844120690703860186_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844123366363627768","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 05:10:47","content":"On October 8, the National Healthcare Security Administration announced that an inspection found that Wuxi Hongqiao Hospital was suspected of illegally using 22.284 million yuan of medical insurance funds. It lured and induced insured persons to falsely hospitalize in the name of colluding with intermediaries or providing free physical examinations. It also forged medical documents and fabricated medical services, and was suspected of defrauding 11.792 million yuan of medical insurance funds. The final amount is subject to actual verification.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844123366363627768_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844123366363627768_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844125798443384899","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 05:20:27","content":"China's housing prices are falling, and European luxury goods are unsaleable? On October 9, the Wall Street Journal reported that with the decline in housing prices, the total wealth of Chinese households has shrunk by US$18 trillion (approximately 126 trillion yuan) compared with the peak, and the average wealth of each household has shrunk by US$60,000 (approximately 420,000 yuan). The sharp decline in the wealth of China's middle-class and upper-middle class households has had a significant impact on luxury goods sales in Europe.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844125798443384899_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844125798443384899_1.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844125798443384899_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844131485911220428","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 05:43:03","content":"Recently, the e-commerce platform \"Helijia\" has been caught up in negative public opinion about arrears of fees, wages, and difficulty in refunding, and has been besieged by employees, merchants, and consumers. Helijia was once regarded as China's largest O2O (Online to Offline) beauty platform with 8.67 million registered users, but now it has ushered in its darkest moment.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844131485911220428_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844131485911220428_1.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844131485911220428_2.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844131485911220428_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844131579473559677","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 05:43:25","content":"https://t.co/QMXU1KxBfR","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844131579473559677_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844131579473559677_1.jpg,","videos":"","hasPublished":true},{"id":"1844132411560636558","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 05:46:43","content":"On October 9, Sichuan Province's public security organs suspended household registration and ID card services due to a computer room failure. The Sichuan Provincial Public Security Department's Grassroots Basic Work Corps issued a notice today stating that due to a short circuit in the computer room, the household registration business server in our province failed, and the public security organs in the province suspended household registration and ID card services. At present, the public security organs are making every effort to repair and try to resume as soon as possible. The time for resuming business will be notified separately. In the notice, they apologized: \"We deeply regret the inconvenience caused to the general public.\"","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844132411560636558_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844132411560636558_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844133497163874367","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 05:51:02","content":"With the recent boom in the stock market, on October 9, rural commercial banks in many places issued business reminders that credit funds must not flow into the stock market and property market in violation of regulations. CCTV, Cailianshe, Caixin.com and many other media have reported and reprinted the news. Caixin.com pointed out that at present, the minimum annualized interest rate of consumer loans of some banks has dropped to below 3%, which is lower than the cost of financing through securities companies. Some investors have therefore begun to think of misappropriating loan funds for stock speculation, which is worthy of vigilance.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844133497163874367_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844133497163874367_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844136580463698316","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 06:03:17","content":"On October 9, Caixin reported that only two days after the market reopened after the National Day holiday, 99 listed companies announced that their shareholders had reduced their holdings of stocks. Since September 23, a total of 272 listed companies have reduced their holdings of stocks. Some listed companies have aggressively reduced their holdings, even \"clearing out\" their holdings.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844136580463698316_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844136580463698316_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844139241128984906","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 06:13:52","content":"On October 8, after a series of senior members were killed by the Israeli army, Hezbollah in Lebanon expressed its support for ceasefire negotiations with Israel. This was the first time that the organization publicly supported a ceasefire and did not make a ceasefire in Gaza a precondition.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844139241128984906_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844142544671866901","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 06:26:59","content":"On October 9, a Weibo blogger exposed that two boys were abused in a certain place in China. The pictures showed that the children were covered with scars. The suspected abuser was still saying: \"Lie down\" and \"All-round discipline is in place.\" It was rumored online that the two children scratched the community car and their parents were teaching them a lesson.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844142544671866901_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844142544671866901_1.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844142544671866901_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844143619705545074","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 06:31:16","content":"According to multiple media reports, of the three injured people reported by the Guangzhou police, two were primary school students, a fifth-grade girl was seriously injured, and a third-grade boy was slightly injured. Another was a parent who was picking up his child.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844143667482947682","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 06:31:27","content":"In the early morning of October 10, the police issued a notice: After investigation and verification, the incident occurred in the early morning of October 7 in a residential area of Shuangfu Street, Jiangjin District. The two boys were beaten by their biological father because they were naughty. The public security organs have filed a case in accordance with the law and taken criminal compulsory measures against Chen. The case is under further investigation and processing.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844143667482947682_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844143667482947682_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844147521855132022","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 06:46:46","content":"Another Nobel Prize in AI! After winning the Nobel Prize in Physics for research related to artificial neural network machine learning, the Nobel Committee announced on October 9 that the 2024 Nobel Prize in Chemistry was awarded to three scientists who used AI technology in protein research.\nThe winners include David Baker, a professor at the University of Washington, and Demis Hassabis, founder and CEO of DeepMind, and John M. Jumper, a senior research scientist. Baker received half of the prize for \"computer-aided protein design\", while Hassabis and Jumper shared the other half for \"protein structure prediction\". The three winners will share the prize of 11 million Swedish kronor (about 7.44 million yuan).\nThe Nobel Committee highly praised the achievements of the winners, saying that \"they cracked the amazing structure of proteins...","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844147521855132022_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844147521855132022_1.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844147521855132022_2.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"AI领域又赢一诺奖！继人工神经网络机器学习相关研究赢得诺贝尔物理学奖后，10月9日，诺贝尔委员会宣布，2024年诺贝尔化学奖授予三位在蛋白质研究中运用AI技术的科学家。\n获奖者包括美国华盛顿大学教授戴维·贝克（David Baker），以及DeepMind的创始人兼CEO戴密斯·哈萨比斯（Demis Hassabis）和高级研究科学家约翰·江珀（John M.Jumper）。贝克因\"计算机辅助蛋白质设计\"获得半数奖金，而哈萨比斯和江珀则因\"蛋白质结构预测\"共享另半数奖金。三位获奖者将平分1100万瑞典克朗（约744万人民币）的奖金。\n诺贝尔委员会高度评价获奖者的成就，称\"他们破解了蛋白质惊人结构的密码\"。这一奖项进一步彰显了AI技术在科学研究中的重要性和广泛应用前景。","hasPublished":true},{"id":"1844148867417383096","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 06:52:07","content":"TSMC's revenue growth exceeded expectations. On October 9, the Wall Street Journal reported that TSMC, a major supplier of advanced process chips for Apple and Nvidia, saw a significant increase in revenue in the third quarter, with sales of NT$251.87 billion (US$7.82 billion) in September, a year-on-year increase of 39%. Revenue in the third quarter reached NT$753.61 billion (US$23.41 billion), up 12% from the third quarter of 2023. This shows the continued demand for high-tech chips driven by the continued boom in artificial intelligence (AI).","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844148867417383096_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844155052824592790","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 07:16:41","content":"October 10 (Release), Qitaihe, Heilongjiang. Due to the poor performance of the property management company in the year-end evaluation, the owners' meeting of Nan'an Garden Community decided to terminate the contract with the property management company at the end of last year. After the contract was terminated, the property management company should have withdrawn before August 15 this year, but the property management company has been slow to withdraw. The street office protected the property management company and stopped the work of the owners' committee. In desperation, the owners had to hold up banners to protest.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844155052824592790_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844155454336942490","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 07:18:17","content":"On October 8, Italy signed a decree to expel Zulfiqar Khan, a 54-year-old pro-Hamas imam living in Bologna. Khan has made many controversial speeches, including strong anti-Western, anti-Semitic, homophobic and anti-feminist sentiments. He also claimed that the Quran guides his speech and that the Italian Constitution is an umbrella for his freedom of speech.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844155454336942490_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844155454336942490_1.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844155454336942490_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844157548192202916","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 07:26:36","content":"At 3 pm on October 9, Xi'an Peihua College and the First Affiliated Hospital of Xi'an Jiaotong University held an organ donation lecture for freshmen.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844157548192202916_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844162916435755290","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 07:47:56","content":"October 10 (Release), Tianjin Tianmu. A girl was selling sweet and sour pork (pork ingredients) on the street in Tianmu (a Hui Muslim community), but was obstructed by Hui Muslims and was almost beaten. The local Hui Muslims said, \"This is a Hui Muslim area, and Han Muslims are not allowed to set up stalls.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844162916435755290_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844163677731140011","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 07:50:58","content":"On October 4, a B-station UP host who had been an instructor in an addiction treatment school for a year posted a video about his views on addiction treatment schools. In the video, he defended addiction treatment schools, saying that many problem teenagers who fight, get involved in society, and even steal and rob, would also go to police stations and prisons if they were not sent to these addiction treatment schools. In the video, he affirmed that beatings, abuse, or electric shock therapy do not exist in current addiction treatment schools. However, forcibly taking children to addiction treatment schools, militarized management, etc. are all real, and forcing a child to be taken away only requires the consent of the parents.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844163677731140011_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]