[{"id":"1844062242268119339","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 01:07:54","content":"On October 9, netizens discovered that many of Hu Chenfeng’s accounts were shown as banned from following.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844062242268119339_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844062242268119339_1.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844062242268119339_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844109554457641065","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:15:54","content":"Following the \"wisp-fire teenagers\" in Jinan, dozens of people formed a group to blast the streets in Shantou, Guangdong in the early morning of October 9.\nAccording to Da Wan News: Not long after the incident of many young people blasting the streets in Lixia District, Jinan City, a netizen posted a video saying that someone drove a motorcycle to blast the streets in Chendian Town, Chaonan District, Shantou City, Guangdong Province, and dozens of people made noise while riding, which seriously affected the normal life of surrounding residents.\nIn the video, dozens of people drove motorcycles through the streets. Some people installed alarms on the front of the car and kept sounding alarms, and some people sat in the back seat and kept making noise. Witnesses in the video comment area said that this large-scale street blasting behavior is not common, and it has only happened once in more than two months.\nOn the morning of October 9, Da Wan News reporters contacted the Chendian Town Government about this matter. A staff member told reporters that they had paid attention to the matter, \"The relevant departments have intervened to deal with it, and the specific information is subject to official notification.\" According to reports, motorcycle blasting has always been...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844109554457641065_0.jpg,","hasFullContentTranslated":false,"fullContent":"继济南“鬼火少年”炸街后，10月9日凌晨，广东汕头又出现数十人组团骑车炸街。\n据大皖新闻报道：济南市历下区多名年轻人炸街事情刚发生不久，有网民发布视频称广东汕头市潮南区陈店镇有人驾驶摩托车炸街，数十人边骑车边发出噪音，对周边居民正常生活造成严重影响。\n视频中，数十人驾驶着摩托车穿行在街道上，有人在车头安装警报器，不断发出警报声，也有人坐在后座不断发出噪音。视频评论区有目击者表示，这种大规模的炸街行为并不常见，两个多月来只遇到这一次。\n10月9日上午，大皖新闻记者就此事联系上陈店镇政府，一名工作人员向记者表示已关注到此事，“相关部门已经介入处理，具体信息以官方通报为准。”据介绍，摩托车炸街一直是当地整治的对象，汕头市公安局潮南分局陈店派出所工作人员回应称：“今晚会派人去巡查一下。”","hasPublished":true},{"id":"1844109689774277074","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:16:26","content":"On October 9, the Wall Street Journal published an article analyzing the reasons for today's A-share market decline, believing that the main reason was that the National Development and Reform Commission's press conference did not release more positive signals. Lu Ting, chief economist of Nomura China, also reminded clients in a report last Thursday that in a pessimistic scenario, the stock market may plummet after the high sugar effect, similar to the plunge after the surge in 2015. The stimulus policies introduced in the next few weeks may also have only limited impact on the many challenges facing the real economy.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844109689774277074_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844109689774277074_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844110730628563058","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:20:34","content":"On October 9, a netizen posted a video saying that a rural resident's living environment was poor and a child was suspected of eating dirt on a tricycle. Reporters verified that the incident occurred in Wangqiao Village, Mituo Temple Township, Xincai County, Zhumadian City, Henan Province.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844110730628563058_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844114021563486415","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:33:39","content":"On October 9, the women's team final of the 2024 Table Tennis Asian Championships ended. The Chinese women's table tennis team composed of Sun Yingsha, Chen Xingtong and Wang Yidi lost 1-3 to the Japanese team and unfortunately won the runner-up.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844114021563486415_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844114021563486415_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844119720888500319","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 04:56:18","content":"October 6, Xiamen, Fujian. A surveillance video of a man threatening a merchant at the door of a store on Gulangyu Island, \"You have offended someone\" and \"I will find faults to close the store\", has attracted attention. According to the boss, the man involved brought a woman to take photos, wanting to \"get a set of travel photos for free\". After being rejected, he became angry and scolded the clerk, \"You have offended someone\", and repeatedly emphasized, \"Do you know what I do?\" In addition, the man kept saying, \"If I don't shut down your store, I will support you\", \"Do you believe it or not, I will issue a bill to fine you and punish you to death\", \"I can find faults to close your store at will\", etc. During this period, the man also notified others to inquire about the legal person information corresponding to the merchant's house number. On the morning of October 9, a Jimu News reporter sent a private message to the publisher of the video to learn more details, but received no reply. The staff of the Gulangyu Management Committee said that this person was not a manager. But as of press time, the surveillance video has been deleted.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/10/1844119720888500319_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844120690703860186","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 05:00:09","content":"On October 9, it was reported online that the famous film \"Black Cannon Incident\" shot in the 1980s was cut at a film festival in Guangzhou on September 28. Netizens lamented that the film that could be shot 40 years ago can not only not be shot now, but can not even be released.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844120690703860186_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844123366363627768","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-10 05:10:47","content":"On October 8, the National Healthcare Security Administration announced that an inspection found that Wuxi Hongqiao Hospital was suspected of illegally using 22.284 million yuan of medical insurance funds. It lured and induced insured persons to falsely hospitalize in the name of colluding with intermediaries or providing free physical examinations. It also forged medical documents and fabricated medical services, and was suspected of defrauding 11.792 million yuan of medical insurance funds. The final amount is subject to actual verification.","images":"/tweet/image/whyyoutouzhele/2024/10/10/1844123366363627768_0.jpg,/tweet/image/whyyoutouzhele/2024/10/10/1844123366363627768_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]