[
  {
    "id": "1741857215017783577",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 00:21:36",
    "content": "Fourth anniversary\nOn January 2, 2020, CCTV reported that pneumonia of unknown cause was found in Wuhan, and eight people who spread rumors were investigated and punished according to law.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1741857215017783577_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/PVYTcZp7QO",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1741922976834982328",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 04:42:55",
    "content": "The new program \"Snowflake Daily News\"\nVideo the daily Twitter content, which is convenient for those who cannot see the latest tweets every day because they cannot register for Twitter\nIf the little pinks are not comfortable with the content, it is recommended to take it together with \"News Broadcast\"\n",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/YTx6GtBlxl",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1741937285782704509",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 05:39:47",
    "content": "On January 1, a blunder occurred during the New Year’s Eve countdown at Qianxi Plaza in Zhengzhou. When the countdown reached the eighth second, two sentences of \"Hello, teacher!\" suddenly appeared, and then the lights in the entire building suddenly went out.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1741937285782704509_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/UeY3Sch4SY",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1741939923836342783",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 05:50:16",
    "content": "@zwang5893？",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1741955224716124228",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 06:51:04",
    "content": "@RonaldSimmonsUS probably accidentally clicked on the Teacher's Day file",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742084787601285614",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 15:25:54",
    "content": "On January 2, CCTV released the latest report on the death of a student at Yuhuayuan School in Ningling County: The forensic doctors of the three levels of public security organs in Henan Province, city and county jointly confirmed that no tools or bare hands were found to cause injuries, and there were no penetrating injuries to the hands and forearms. The surface injuries of the corpse were epidermal detachment and subcutaneous bleeding, which were consistent with the cause of a fall from a high place. Suicide notes were found in the school and at home, and no bullying was found.\n\nAccording to the Ningling Education WeChat official account, on January 2, the Henan Ningling County Joint Investigation Team reported on the investigation of the death of Yang Moumou, a student at Yuhuayuan School in Ningling County.\n\nOn December 24, 2023, Yang Moumou, a student at Yuhuayuan School in Ningling County, died after falling from a high place at school. We are very sad and sorry for this, and express our condolences to the parents and relatives who lost their children. After the incident, Ningling County immediately set up a joint investigation team composed of education, public security, health and other departments to investigate and handle the incident. In order to thoroughly find out the truth, the joint investigation team conducted a full-process and all-round investigation in accordance with the law and regulations, formed an investigation conclusion, and asked the relatives of the deceased to review the relevant evidence. On December 29, his relatives had buried Yang Moumou, and the investigation and aftermath of the incident have been completed. Thank you for the attention of the majority of netizens and the society! The investigation results are now reported as follows:\n\n1. About the death of Yang Moumou\n\nAt 6:04 on December 24, the on-duty vice principal of Yuhuayuan School in Ningling County found someone lying on the ground in front of Building 1 of the student dormitory wearing a grass green fleece coat and dark blue sweatpants during a routine inspection. After repeated calls and tapping on the shoulder without response, the school dormitory manager called the 120 emergency number and the 110 police number at 6:05. Medical staff from Ningling County Hospital of Traditional Chinese Medicine and police officers arrived at the scene one after another.\n\nMedical staff immediately conducted on-site inspections and diagnoses, and found that the person was unresponsive, had no breathing, dilated pupils on both sides, no carotid artery pulsation, no heart sounds, and no blood pressure or pulse rate on the electronic sphygmomanometer. The electrocardiogram showed a straight line, and the patient had no vital signs. The death was confirmed on the spot and the school was informed. At 6:39, the 120 medical staff left the school. After on-site identification, the deceased was Yang Moumou, a student in the seventh grade (three) class. After the public security organs conducted on-site inspections, the body was sent to the morgue of Ningling County People's Hospital.\n\nAt 6:45, the head teacher of the seventh grade (three) class of Ningling County Yuhuayuan School called to inform Yang Moumou's grandfather Yang Moushan.\n\n2. About the on-site video surveillance\n\nAfter investigation, Ningling County Yuhuayuan School has a monitoring room. The surveillance videos of the school's classrooms, apartment areas, and dormitory corridors were retrieved, showing that the deceased Yang returned to the dormitory after school at 20:58 on December 23, and walked out of the 501 dormitory to the public toilet on the fifth floor at 1:41 on December 24 (the 501 dormitory has a small toilet. To avoid affecting others' rest and causing odors, the school encourages students to use the public toilet at night). He returned to the 501 dormitory at 1:43, and Yang was not found entering or leaving the 501 dormitory until the branch school called the police at 6:05. Although the area where the deceased Yang fell to his death was covered by surveillance, the light was dark at night, and the camera was far away (about 87 meters), so the fall could not be seen (according to on-site experiments, falling objects from high altitudes can be seen during the day).\n\n3. On-site investigation\n\nAfter an on-site investigation of the student dormitory where the deceased Yang lived (501, 5th floor, Building 1, Student Apartment), it was found that there was a folded quilt on the No. 5 bed in the 501 dormitory (Yang's bed), and a stapled paper was found under the pillow with the word \"suicide note\" written on it. The glass window on the east side of the dormitory can be opened 24.5cm (it was confirmed by the roommates that the window of the 501 dormitory could be opened due to the fall of the limit screws one or two months ago. After the incident, the school inspected and repaired all the windows in the school). A broken left palm print was found on the inner wall tile on the east side of the window, which was consistent with the fingerprint of the deceased Yang's left index finger after comparison; a broken shoe print was found on the windowsill inside the window, with the toe facing outward; a shoe print was found on the air conditioner outside the fourth floor below the window, with the toe facing outward. After comparison, the two shoe prints had the same pattern as the slippers worn by the deceased. By comparing the shoe prints of all other students in the same dormitory, they were all different from the shoe prints on the windowsill and the air conditioner.\n\nIV. About the suicide note\n\nAfter investigation, a suicide note was found in the school and the home of the deceased Yang Moumou. The contents of the suicide notes showed that Yang Moumou had a tendency to commit suicide before his death. On December 27, the public security organs commissioned the Henan Public Judicial Appraisal Center to appraise the handwriting of the two suicide notes and confirmed that they were all Yang Moumou's handwriting. The contents of the suicide note corroborate with other evidence. Respecting the opinions of relatives and protecting Yang Moumou's privacy, the specific contents of the suicide note will no longer be announced to the public.\n\nV. About the autopsy\n\nIn order to find out the cause of death, on the morning of December 24, the forensic doctor of the Ningling County Public Security Bureau examined Yang Moumou's body in the forensic room of the Ningling County People's Hospital. At 12:13, the autopsy was completed. On the morning of the same day, the relatives of the deceased had been negotiating with the school at the school and were quite emotional. At 14:50, after the relatives' emotions stabilized, the police accompanied the relatives to the Ningling County People's Hospital to check Yang Moumou's body. On December 25, the Ningling County Public Security Bureau requested the forensic doctor of the Municipal Public Security Bureau to re-examine and confirm the body. Several body injuries in the photos circulated on the Internet were all found in the autopsy, and other parts of the body were also found to be injured. The forensic doctors of the provincial, municipal and county public security organs jointly confirmed that no injuries caused by tools or bare hands were found, and there were no penetrating injuries on the hands and forearms. The surface injuries of the corpse were epidermal exfoliation and subcutaneous bleeding, which were consistent with falling from a high place. Combined with the CT scan examination, the deceased Yang Moumou had intracranial hemorrhage, left pneumothorax, bilateral pleural effusion, right lower limb and sacral coccygeal fractures, which were consistent with death from craniocerebral injury caused by falling from a high place. The results of the forensic identification have been notified to the relatives of the deceased.\n\nVI. Whether Yang Moumou was bullied in school\n\nThrough interviews and investigations of 47 people including Yang Moumou's relatives and Ningling County Yuhuayuan School administrators, class teachers, subject teachers, life teachers, classmates, dormitory classmates, and good classmates, it was found that Yang Moumou was not bullied in school before his death.\n\nDuring the investigation of the incident, we deeply realized that we did not pay enough attention to the mental health education of young people, and we deeply apologize for this! We will deeply learn the painful lessons of this incident, draw inferences from it, and comprehensively strengthen and improve education. We also ask the majority of netizens to respect the law and facts, respect the deceased and their relatives, surf the Internet in a civilized manner, surf the Internet in accordance with the law, do not spread rumors, do not believe in rumors, and do not spread rumors, and jointly maintain a clean, clear and healthy cyberspace.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742084787601285614_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742086198510735612",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 15:31:30",
    "content": "On December 29, students from Luzhou Senior High School in Sichuan Province posted an open letter at school to protest the school's decision to change the statutory three-day holiday to two days.\nAccording to the content of the open letter, the students said that they will face another fourteen-day continuous class. The protest is not for the holiday, but for the rights and dignity that are being plundered.\nThe morbidity of Luzhou Senior High School education is gnawing at our hearts bit by bit.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742086198510735612_0.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742086198510735612_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/7REhU7SgVT",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742088323479285830",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 15:39:57",
    "content": "At present, the video \"Xiao Li Helps\" about the teacher of Yuhuayuan School in Ningling County instigating the whole class to bully two students in 2021 has been removed from the shelves",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742088323479285830_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/oItInyvOwY",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742089006706237530",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 15:42:40",
    "content": "On January 2, migrant workers demanded their wages at the gate of Northern Machinery (Arsenal) in Taiyuan, Shanxi Province.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742089006706237530_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/TpsE4cYfRS",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742090856364986513",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 15:50:01",
    "content": "\"Has the last-place elimination system also begun to be implemented within the system?\"\nOn January 1, the media reported that Nanshan Town, Foshan, Guangdong Province, publicly announced 8 \"lay-down leisure personnel\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742090856364986513_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/JssKLxzi4I",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742092329916190984",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 15:55:52",
    "content": "In the early morning of January 1, due to the cancellation of the New Year's Eve in Shenzhen, many young people from Shenzhen went to Hong Kong to participate in the New Year's Eve fireworks event in Victoria Harbor, and chose to return to Shenzhen that night without booking a hotel. As a result, due to the large number of people returning to Shenzhen that night, only two windows were opened at the port, resulting in passengers being stranded, tens of thousands of people \"left on the streets\", and some people waiting for cross-border buses all night. The incident triggered a discussion among netizens. A Hong Kong netizen said: Is it expensive to stay in a hotel for one night with a day's salary? A Shenzhen netizen replied: Your one-day salary is half a month's salary for us",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742092329916190984_0.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742092329916190984_1.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742092329916190984_2.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742092329916190984_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742096514615226718",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 16:12:30",
    "content": "The \"Attack on Titan\" concert on New Year's Eve in Tianjin caused the audience to be angry and dissatisfied due to the poor performance level. The audience shouted \"It's not so easy to cheat the money of the second dimension!\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1742096514615226718_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/DYCgsOJZmi",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742096530658533432",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 16:12:34",
    "content": "December 31, Xi'an, Wenyue Huafu workers demanded their wages",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742096530658533432_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/BwCtob5Lur",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742098895579087154",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 16:21:57",
    "content": "On January 2, Huzhou, Zhejiang. A market manager boasted in a group that he trampled on the vegetables of vegetable farmers on the street at will. He said, \"This is my job\" and \"I stepped on them for fun.\" Because of his bad behavior, netizens raised funds to open the box and found that his father worked for the Huzhou Municipal Committee of the Communist Youth League.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1742098895579087154_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/KFu3K8z9Xx",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742105407001104645",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 16:47:50",
    "content": "Oops happen frequently\nOn New Year's Eve, the light show at May Fourth Square in Qingdao played repeatedly during the countdown",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1742105407001104645_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/ZFISoPesvh",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742107391942877207",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 16:55:43",
    "content": "On January 2, operators of a shopping mall in Beijing issued an emergency notice, requiring catering businesses to install chain locks on knives used in the kitchen. The length of the knives must not exceed the range of the chopping board, and the rectification must be completed before this Friday.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742107391942877207_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/oNnVq9Hy34",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742115053678043610",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 17:26:10",
    "content": "On January 1, it was reported online that at the Jinan Comic Exhibition, someone distributed snacks containing razor blades, needles, and unknown pills to the audience. Photos circulated online showed that many people were affected.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742115053678043610_0.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742115053678043610_1.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742115053678043610_2.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742115053678043610_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/C4FbeKKNTD",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742115138910466475",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 17:26:30",
    "content": "https://t.co/vmCZJLl9FB",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742115138910466475_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/vmCZJLl9FB",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742115770929197484",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 17:29:01",
    "content": "On January 2, in Haikou International Trade City, villagers demanded that the Longhua District Government return 370 million yuan in demolition compensation.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742115770929197484_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/CqezxPGWZc",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742120229990228168",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 17:46:44",
    "content": "Changsha exposes \"sky-high price of spicy hot pot\" again\nDecember 31, Changsha, Hunan. The boss charged 106 yuan for a bowl of spicy hot pot. The woman was dissatisfied with the dish and checked with the boss face to face.\nOn January 2, the Changsha Tianxin District Market Supervision and Administration Bureau issued a notice stating that the incident was true and the illegal behavior of the vendor had been dealt with.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1742120229990228168_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/WRy8TzpL3o",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742120302870458555",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 17:47:01",
    "content": "As early as April last year, the sky-high price of spicy hot pot in Changsha had caused social discussion. At that time, a couple from Shandong ordered a bowl of spicy hot pot from a mobile vendor on Taiping Street, which cost 86 yuan. The couple chose to call the police.",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/TWKQ8R9kIa",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742120856497631446",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 17:49:13",
    "content": "A company in Xi'an moved from the city center to the mountainous area to lay off employees? The company moved back to the city four days after the employee resigned \nRecently, a netizen in Changde, Xi'an, posted a video saying that Xi'an Shenmeng Advertising Company moved the company to the Qinling Mountains to lay off employees without compensation. More than a dozen employees resigned voluntarily due to long commuting time and inconvenient living conditions, but then they found that the company had moved back to the city. \nAfter the company moved, many colleagues had to take a 3-hour bus to commute, and then walk for more than 30 minutes on the mountain village road. The company said that if they couldn't hold on, they could resign. Among the company of more than 20 people, 14 signed the resignation agreement. After the employees resigned, the company moved back to the city and began recruiting. \nThe resigned employees believed that the company boss had not shown up, and the purpose was to use this bad environment to make you resign voluntarily, so as to avoid N+1 compensation. \nOn December 31, the person in charge of the company said that the company had told them that moving to the mountains was only a temporary measure, and they did not expect the employees to resign. The resigned employees said that they had been told that going to the mountains might last until the second year, and the working environment was bad.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1742120856497631446_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742121443821817902",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 17:51:33",
    "content": "https://t.co/mUInFKLDOy",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742121443821817902_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/mUInFKLDOy",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742122293784936732",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 17:54:56",
    "content": "On January 2, \"It seems that the authenticity of New Year's Eve is slowly being lost\" became a hot search on Weibo",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742122293784936732_0.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742122293784936732_1.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742122293784936732_2.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742122293784936732_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/vawSiyE6Gs",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742123832268202054",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 18:01:03",
    "content": "January 1, Xinxiang, Henan. An old man was selling balloons on New Year's Eve, but was robbed by young people at the scene for \"0 yuan\". In a blink of an eye, the balloons in the old man's hand were snatched away and only one or two were left. The old man cried at the scene: someone in the family has cancer, so he came out to sell balloons to supplement the family income. A man at the scene came forward to comfort the old man and gave him 100 yuan as a token of comfort. Then the old lady knelt down to thank and was helped up.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1742123832268202054_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/EwmcnuZNsH",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742126849201713592",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 18:13:02",
    "content": "January 1, Jining City, Shandong Province. Two men set off fireworks and attracted a police car to chase them.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1742126849201713592_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/ljruLgg2Vl",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742132620299760065",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 18:35:58",
    "content": "Currently, the Henan Village Bank depositors who were intercepted at Zhengzhou East Station on the 31st are being detained at Qinglong Villa, a training center under the Henan Financial Supervision and Administration Bureau.\nAccording to photos circulated online, there are more than a dozen unidentified \"red vests\" outside the door, and the depositors are currently on a hunger strike.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742132620299760065_0.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742132620299760065_1.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742132620299760065_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/bAqMXLY5c5",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742134344821391468",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 18:42:49",
    "content": "On January 2, Ningling County Yuhuayuan School opened, and the school used buses to pick up children to go to school.\nBut one netizen said that if a student did not go, the brigade secretary would come to the door and force you to go.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1742134344821391468_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/OnZGmXPkFs",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742181007212544019",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 21:48:14",
    "content": "On January 2, when Ningling County released its investigation results again, netizens were collectively sarcastic.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/02/1742181007212544019_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/8DajMhzZ2i",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742186082446299453",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 22:08:24",
    "content": "On January 2, a serious traffic accident occurred in Liuyang, Hunan Province. A bus collided with a truck, killing 4 people and injuring 7.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742186082446299453_0.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742186082446299453_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Djv3SBtAyn",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742187434522108226",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 22:13:47",
    "content": "On January 1, Hainan Radio Station host Xiao Chenghao released a video saying, \"A 7.4-magnitude earthquake occurred in Japan, retribution has come,\" which caused controversy. On January 2, Hainan Radio Station said that it had suspended his work. However, netizens said, \"What he said is correct\" and \"he should be promoted.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742187434522108226_0.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742187434522108226_1.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742187434522108226_2.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742187434522108226_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/O1pL8tt18s",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742199556878500113",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 23:01:57",
    "content": "On January 2, Hangzhou, Zhejiang Province, was suspected of being deducted by the leader due to the Asian Games subsidy. Angry Hangzhou subway employees complained on Weibo.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742199556878500113_0.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742199556878500113_1.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742199556878500113_2.jpg,/tweet/image/whyyoutouzhele/2024/01/02/1742199556878500113_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/BsBLOCReSG",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1742200659657499058",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-02 23:06:20",
    "content": "Later, the local market supervision and administration bureau stated that Sun was an employee of the third-party management company of the farmers' market and had been summoned by the public security organs. The relevant illegal acts were under investigation. The company had terminated the labor contract with Sun and apologized to the vegetable farmers.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/02/1742200659657499058_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/5u1vSBWv86",
    "accountId": "whyyoutouzhele"
  }
]