[{"id":"1861094283018699021","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 01:14:40","content":"RT @xiangli001: On November 22, young people from the San Francisco Bay Area gathered at the University of California, Berkeley. The local youth diaspora group #擦星星務所 held a \"#UrumqiFire2AnniversaryMemorialPoetrySession\" to mourn those who died in the fire and continue the White Paper Revolution with the Bay Area youth. During the event, they recited my poem \"White Paper\"... Thank you to these young people,...","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861096054524936194","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 01:14:46","content":"\"Where is Urumqi Middle Road?\" On the occasion of the second anniversary of the White Paper Movement, European white paper youths traveled across Europe carrying a street sign of Urumqi Middle Road. \"A street sign on Urumqi Middle Road travels across Europe, carrying fragments of memories from two years ago: some people have forgotten it, but some people still remember it.\" UK China Deviants @China_Deviants Netherlands Censored Face(s) | People(s) @ censored_face_s France","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861085072943652922","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 24:44:14","content":"Netizens submitted articles from early November to the end of the month. In order to welcome the central leadership, Nanchang University required students to sit according to seat arrangements and use AI to check head-up rates, etc. They also had to take photos and clock in before classes. Every student had to greet the teacher before class, and on the 25th and 26th, students who did not have classes were not allowed to stay in the dormitory and had to study on their own to leave a good impression on the leaders.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861086290185195671","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 24:44:19","content":"On November 25, the State Administration of Radio, Film and Television issued a document requiring the standardization and guidance of the \"domineering CEO\" theme in short short dramas. The document emphasized that it must not affect the public's perception of Chinese entrepreneurs and damage the image of the entrepreneurial group. It is necessary to tell the stories of Chinese entrepreneurs well and prevent the promotion of marriage and love views that cling to the powerful, wealthy, and rich.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861097803495174163","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 01:29:59","content":"\"Where is Urumqi Middle Road?\" On the occasion of the second anniversary of the White Paper Movement, European white paper youths traveled across Europe carrying a street sign of Urumqi Middle Road. \"A street sign on Urumqi Middle Road travels across Europe, carrying fragments of memories from two years ago: some people have forgotten it, but some people still remember it.\" UK China Deviants @China_Deviants Netherlands Censored Face(s) | People(s) @ censored_face_s France","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861213918586183712","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 09:04:41","content":"On November 25, the police officer’s personal social media account “Luzhou Laojiao” released a video to support the deputy director of Zhangyi Town, Ningxia, who assaulted a 12-year-old boy, saying that “only courageous police officers can protect the people.”","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861294506844528962","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 14:37:33","content":"On November 25, a 61-year-old migrant worker reported in his real name that the secretary of the Party Committee of Handan Wharf Town, Hebei Province, was shielding a contractor who had withheld wages for migrant workers. The contractor also led people to beat him twice when he demanded his wages.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861330562499387793","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 16:53:46","content":"In July this year, a blogger went undercover and bought a truckload of raw materials for shady sanitary napkins, exposing the shady dealings of cheap sanitary napkins on Pinduoduo. The blogger discovered that there were cigarette holders and cockroach legs in the recycled shady cotton, and the blogger had an allergic reaction on his arm when he touched it. This truckload of raw materials could make hundreds of thousands of sanitary napkins. CCTV also exposed a shady sanitary napkin manufacturer, and the on-site environment was worrying, with mosquitoes flying around and laying eggs at will.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861331578640834707","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 16:53:51","content":"According to netizens, as the Chinese sanitary napkin incident fermented, a large number of Chinese people rushed to local stores in Japan to buy sanitary napkins. Some Japanese stores have already imposed purchase limits on sanitary napkins, but some stores still have out-of-stock problems.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861335439539610001","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 17:09:04","content":"On November 24, President Vladimir Putin signed a law allowing citizens who sign up to fight in the war in Ukraine to be forgiven of nearly $100,000 in debt as a new measure to recruit soldiers.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861337556039959035","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 17:24:18","content":"Netizen contribution: Shantou conducted a surprise fire inspection in the middle of the night. Merchants turned off lights and drew curtains at the speed of light. In recent days, in order to avoid the national fire inspection, Shantou merchants have been closed during the day and open at night. Previously, the Shantou local emergency bureau responded to reporters: merchants are operating normally, and there are no large-scale closures. Some netizens jokingly called this: \"The devils have entered the village.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861338352521519218","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 17:24:23","content":"Follow-up of Ningxia Guyuan police beating primary school students: Netizens from many places sent banners to the deputy director who beat the primary school student, presumably because the primary school student had beaten other lower grade students that day","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861339515983667212","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 17:24:29","content":"According to online reports, on the evening of November 23, a group of will-o'-the-wisp teenagers in Shantou chased and beat cyclists with knives, and even ran to the government gate to provoke, and were chased and arrested by the police at the gate of the city government.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861339960386990300","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 17:24:35","content":"Recently, a netizen posted on Xiaohongshu that her husband was laid off and she also quit her job this year. \"What a miserable couple.\" In response, many people commented that they and their families had encountered the same situation. \"My husband was laid off without telling me, and I was homeless for a few days.\" \"My husband has worked in the street for 12 years. This week, he received a notice that his salary was cut by 3,000 yuan.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861341233232441435","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 17:39:48","content":"Netizen contribution: Around November 22, a gang fight occurred in a suburb of Ningde, Fujian. Several people surrounded and beat one person with weapons. Several people kicked the victim in the head, and one person hit the victim with a baseball bat, cursing while beating.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861342806351941912","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 17:39:53","content":"More footage of the devils entering the village:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861346786612519172","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 17:55:07","content":"In Australia, all homes with mold problems do not meet the living and rental standards, which means they are not suitable for living! Mold is also a common source of allergies, asthma or eczema problems, and may even cause serious distribution diseases or direct infections of the lungs and sinuses.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861346873128427678","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 17:55:12","content":"Recently, China announced a trial visa exemption for Japan, which triggered boycotts and anger from many netizens. Netizens responded, \"I am so angry, who came up with this idea? It turns out that what fell these two days was not rain, but the blood of the soldiers.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861348184569848010","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 18:10:25","content":"On the evening of November 23, a deliveryman in Chengdu spit into a customer's food while smoking. According to an insider, the platform assigned a low-priced order, and the customer was urging for delivery, so he became resentful and spit into the food. The platform responded: This order was not delivered, and it was a fake photo taken after the meal was returned. The rider has been permanently restricted from accepting orders.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861350003522073035","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 18:10:31","content":"Recently, the Economic Daily published an article entitled \"Strengthening the Party's overall leadership over economic work\". The article stated that Xi Jinping's economic thoughts creatively put forward important theoretical viewpoints on strengthening the Party's overall leadership over economic work.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861352322867368325","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 18:25:44","content":"November 25, Guiyang, Guizhou. Netizens open VPN and Instagram next to the grid worker.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861353668647518471","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 18:25:50","content":"Yangmaoyue, a blogger with 8 million followers on Douyin, posted a video mocking the post-2000s generation for not being able to find a job: \"The post-2000s generation can't even get into the workplace, how can they rectify the workplace?\" The video sparked huge controversy, causing the blogger to lose more than 800,000 followers in two days. The blogger subsequently deleted the video and posted a video to apologize. Netizens in the comment section responded: He doesn't really think he said something wrong, he is just afraid of not making money.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861361825968988476","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 18:56:10","content":"Recently, in Suzhou, Jiangsu, it was revealed that three young men born after 2005 took turns ordering takeout for 19 yuan, and then applied for a refund on the grounds that they did not receive the food. The three repeated this operation for a month. It was reported that due to the \"sexy operation\" of the three young men, more than a dozen riders were banned. In the end, the merchants and riders called the police, and the three were taken away by the police. The police responded: suspected of fraud, because they were minors, they would not execute it.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861362197999559123","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 18:56:16","content":"The party secretary of Gongzhai Village, Gong Guangsen, was taken away by the Commission for Discipline Inspection for investigation in May 2024, and the village has no new secretary yet. Geng Jianwei, the former party secretary of Xincheng Street who was in charge of the demolition of Xincheng Street a few years ago, has retired and was also taken away by the Commission for Discipline Inspection in March 2024.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861362404078367011","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 18:56:21","content":"At the scene of the villagers' rights protection, there was also a woman holding a sign to protect her rights. The woman claimed that she bought a 140-square-meter resettlement house from another villager in Gongzhai Village, Gong Shengwu, in 2017. By 2024, Gong Shengwu had not delivered the house to her as promised, leaving her homeless. Ironically, the background of this photo is: Don't forget your original intention and keep your mission in mind.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861364825181561229","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 19:11:34","content":"On November 23, Shandong. A netizen posted that she encountered volunteers promoting anti-abortion in a scenic spot. The picture showed that the volunteer’s vest had slogans such as “Abortion and miscarriage, cutting off the bloodline of ancestors is the greatest unfilial act” written on it.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861368866607374569","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 19:26:47","content":"November 25 (Release) Shandong. An 80-year-old grandfather tells his story. The old man said that his son and daughter-in-law are dead, and his wife is also sick at home. He also has heart problems. He can't even earn enough to buy a bowl of noodles by selling vegetables at a stall. He only gets a subsidy of more than 100 yuan a month. He also has to take medicine worth 200 yuan, and he basically doesn't eat meat. The old man said: I don't want to come to the world in my next life. It's too hard.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861375908025962650","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 19:57:08","content":"November 25 (Released) Ambassador Wang Wenbin and the Cambodian Minister promoted the local tourism industry. In the video, the Cambodian Minister said, \"If there are tourists visiting Cambodia, we will definitely ensure everyone's safety,\" which caused ridicule from netizens. Netizens replied, \"If safety is emphasized, it means it is unsafe.\" Some netizens said that the outfits of Wang Wenbin and the Cambodian Minister reminded them of Pol Pot.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861377564864049180","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 19:57:14","content":"Recently, an article titled \"Waiting for Fish to Die\" has been circulated online, comparing the current economic downturn and depressed business environment to \"waiting for fish to die\". \"Some time ago, I took a client to see a storefront. The storefront spent hundreds of thousands on decoration, but closed down due to poor business. The owner had no choice but to transfer it with great pain, and the decoration cost hundreds of thousands was also given away for free. However, the client who saw the storefront still complained that the rent was too expensive. The client said he was relieved that there would be more and more such storefronts in the future.\" \"Look, another one is waiting for a dead fish.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861381425221824533","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 20:12:27","content":"Recently, some residents in Wanzhou, Chongqing reported that they received a series of text messages from the Health and Family Planning Commission, which stated that \"the country advocates childbearing at the appropriate age. A couple can have three children. Remarried couples can have three children after remarriage. The number of children born before remarriage will not be counted together.\" Netizens: \"Is the three-child policy stuck with a bug?\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861383144391483492","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 20:27:40","content":"On November 26, in Lanzhou, Gansu, a car suddenly accelerated and hit pedestrians crossing the road. In the process of fleeing, it also hit and injured three pedestrians. The police reported that the perpetrator had been arrested and the injured had been sent to the hospital for treatment.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861384249838051704","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 20:27:45","content":"Recently, some residents in Wanzhou, Chongqing reported that they received a series of text messages from the Health Commission, which stated that \"a couple can have three children, and a remarried couple can have three children after remarriage. The number of children born before remarriage will not be counted together.\" Netizens: \"Is there a bug in the three-child policy?\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861389242230022276","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 20:42:58","content":"November 25 report: Ling Chengxing, former director of the State Tobacco Monopoly Administration, illegally accepted money and property from others in \"extremely large amounts\". Netizens: \"Is it so large that it cannot be expressed in numbers?\" \"I am afraid that telling the amount will scare everyone\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861391844036563308","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 20:58:11","content":"The Ministry of Foreign Affairs responded to China's trial visa-free policy for Japan: The Chinese government has always attached great importance to facilitating personnel exchanges between China and foreign countries, and we certainly hope that the Japanese side will work with us in the same direction.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861400052562043317","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 21:28:32","content":"On November 24, a takeaway delivery man died suddenly on Sichuan Road in Shanghai. The video showed that the delivery man was lying on the takeaway box and motionless. After the police were called, they arrived at the scene but could not wake him up. After searching, it was found that there have been many cases of sudden deaths of delivery men in the past six months. Netizens responded: \"Don't reincarnate here in the next life\" \"The miserable world, the prosperous world is what you wish for\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861404103110484099","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 21:43:45","content":"Data company Altrata recently released the \"2024 Billionaire Census\", which shows that among the top 15 countries in the world in terms of the number of billionaires, only China, Germany, Hong Kong and Saudi Arabia have seen a decline in the number of billionaires compared to a year ago. The number of billionaires in China has dropped the most, by 14.8%.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861409091878637959","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 21:58:58","content":"November 25 (Released) Jining, Shandong. A woman reported in her real name that the local police in Jining extorted 6 million yuan from her. In order to force her to surrender, the police detained her and her family knowing that there was no crime. The woman also claimed that the position of the local police was bought at a cost of 1.2 million yuan, and that she was abused during her detention. The guards did not allow her to drink water, brush her teeth, wash her face, or take a bath.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861415712285434221","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 22:29:18","content":"Recently, Zhao Hong, a law professor at Peking University, published an article: Why is the \"distant-sea fishing\" type of law enforcement so persistent despite repeated prohibitions? The article states that although there are already many laws and regulations prohibiting it, such cases may result in the confiscation of huge amounts of illegal gains, and driven by interests, the public security organs will make arrests across provinces. Only by establishing a market economy based on the rule of law and by also restricting government power can we gain confidence in the market economy and the private economy.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861415757558751315","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 22:29:24","content":"","hasPublished":false},{"id":"1861426824724783616","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 23:14:52","content":"On November 26, 16 years ago, a young man named Yang Jia was executed by injection. On the evening of October 5, 2007, Yang Jia was riding a rented bicycle in Shanghai when he was stopped by the police and taken back to the police station for several hours of interrogation. Afterwards, Yang Jia complained several times and demanded the dismissal of the police officers on duty. On July 1, 2008, Yang Jia went to the Zhabei Branch with a gasoline bottle and a single-edged knife and attacked the police officers at the police station, killing six police officers.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861431911165632679","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 23:30:05","content":"On November 25, in Shuozhou, Shanxi, a man posted a message asking for help, saying that he became disabled due to a work-related injury in 2004, his wife went missing in 2015, his parents died one after another, and the house he lived in collapsed in 2022. His son has been unemployed and has a hard life. His family is facing water, electricity and heating cuts due to non-payment of fees. He has sought help from the government many times, but not only has he failed, he has also been threatened by his superiors. The man said: I paid a penny of public grain before I was injured, and I am really disappointed with the government.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861432289714151797","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 23:45:18","content":"On November 25, in Shuozhou, Shanxi, a man posted a message asking for help, saying that he was disabled due to a work-related injury in 2004, his wife went missing in 2015, his parents died one after another, and the house he lived in collapsed in 2022. His son has been unemployed and has a hard life. His family is facing water, electricity and heating outages due to non-payment of fees. He has sought help from the government many times, but not only has he failed, he has also been threatened by his superiors. The man said: I paid a penny of public grain before I was injured, and I am really disappointed with the government.","hasFullContentTranslated":true,"hasPublished":false}]