[{"id":"1861094283018699021","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 01:14:40","content":"RT @xiangli001: On November 22, young people from the San Francisco Bay Area gathered at the University of California, Berkeley. The local youth diaspora group #擦星星務所 held a \"#UrumqiFire2AnniversaryMemorialPoetrySession\" to mourn those who died in the fire and continue the White Paper Revolution with the Bay Area youth. During the event, they recited my poem \"White Paper\"... Thank you to these young people,...","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861096054524936194","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 01:14:46","content":"\"Where is Urumqi Middle Road?\" On the occasion of the second anniversary of the White Paper Movement, European white paper youths traveled across Europe carrying a street sign of Urumqi Middle Road. \"A street sign on Urumqi Middle Road travels across Europe, carrying fragments of memories from two years ago: some people have forgotten it, but some people still remember it.\" UK China Deviants @China_Deviants Netherlands Censored Face(s) | People(s) @ censored_face_s France","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861085072943652922","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 24:44:14","content":"Netizens submitted articles from early November to the end of the month. In order to welcome the central leadership, Nanchang University required students to sit according to seat arrangements and use AI to check head-up rates, etc. They also had to take photos and clock in before classes. Every student had to greet the teacher before class, and on the 25th and 26th, students who did not have classes were not allowed to stay in the dormitory and had to study on their own to leave a good impression on the leaders.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861086290185195671","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 24:44:19","content":"On November 25, the State Administration of Radio, Film and Television issued a document requiring the standardization and guidance of the \"domineering CEO\" theme in short short dramas. The document emphasized that it must not affect the public's perception of Chinese entrepreneurs and damage the image of the entrepreneurial group. It is necessary to tell the stories of Chinese entrepreneurs well and prevent the promotion of marriage and love views that cling to the powerful, wealthy, and rich.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861097803495174163","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 01:29:59","content":"\"Where is Urumqi Middle Road?\" On the occasion of the second anniversary of the White Paper Movement, European white paper youths traveled across Europe carrying a street sign of Urumqi Middle Road. \"A street sign on Urumqi Middle Road travels across Europe, carrying fragments of memories from two years ago: some people have forgotten it, but some people still remember it.\" UK China Deviants @China_Deviants Netherlands Censored Face(s) | People(s) @ censored_face_s France","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861213918586183712","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-26 09:04:41","content":"On November 25, the police officer’s personal social media account “Luzhou Laojiao” released a video to support the deputy director of Zhangyi Town, Ningxia, who assaulted a 12-year-old boy, saying that “only courageous police officers can protect the people.”","hasFullContentTranslated":true,"hasPublished":true}]