[{"id":"1751275594329825400","name":"李老师不是你老师","createdDate":"2024-01-28 00:06:53","content":"A student from Jiangsu sent a self-study schedule for the holidays, which showed that even during the holidays, they still had to study and take online classes at home according to school schedule every day.","images":"/tweet/image/whyyoutouzhele/2024/01/28/1751275594329825400_0.jpg","videos":"","hasPublished":true},{"id":"1751306141538148771","name":"李老师不是你老师","createdDate":"2024-01-28 02:08:16","content":"On January 27, some netizens discovered that when Hong Kong Satellite TV reported the Wu Xiaolei incident on Douyin, it said that he stopped another student from posting \"anti-China leaflets.\" They questioned whether \"anti-China\" is freedom of speech and \"anti-anti-China\" is a crime? \nUnfortunately, Hong Kong Satellite TV forgot to erase the real content of the so-called \"anti-China leaflets.\"","images":"/tweet/image/whyyoutouzhele/2024/01/28/1751306141538148771_0.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751306141538148771_1.jpg","videos":"","hasPublished":true},{"id":"1751306340817842440","name":"李老师不是你老师","createdDate":"2024-01-28 02:09:04","content":"https://t.co/5n19gaVk4U","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751306340817842440_0.jpg","hasPublished":true},{"id":"1751551648801972319","name":"李老师不是你老师","createdDate":"2024-01-28 18:23:49","content":"January 27, Putian, Fujian. Hundreds of people from Xiuyu District entered the village to carry out forced demolition.\nThe video circulated online showed that the demolition personnel entered the village with steel forks, and two buses were parked at the entrance of the village.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751551648801972319_0.jpg","hasPublished":true},{"id":"1751552395299946714","name":"李老师不是你老师","createdDate":"2024-01-28 18:26:47","content":"On January 22, in Xi'an, Shaanxi, a Didi driver born in 1996 died suddenly due to overwork from working long hours.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751552395299946714_0.jpg","hasPublished":true},{"id":"1751552708530553304","name":"李老师不是你老师","createdDate":"2024-01-28 18:28:02","content":"Previously, the media had reported in detail on the living conditions of online car-hailing drivers\n","images":"","videos":"","hasPublished":true},{"id":"1751555649517899924","name":"李老师不是你老师","createdDate":"2024-01-28 18:39:43","content":"On January 28, a fire broke out in a logistics park in Zhumadian, and the fire was soaring into the sky. According to eyewitnesses, explosions were heard from time to time at the scene, and the roof of the warehouse collapsed.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751555649517899924_0.jpg","hasPublished":true},{"id":"1751558623145119957","name":"李老师不是你老师","createdDate":"2024-01-28 18:51:32","content":"On January 28, a professor named Yao posted a message saying that on January 11, he was threatened and beaten on the road because he reported that the secretary of Hebei University of Technology was involved in organized crime, and now he is seeking help from the society.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751558623145119957_0.jpg","hasPublished":true},{"id":"1751565060881715208","name":"李老师不是你老师","createdDate":"2024-01-28 19:17:07","content":"On January 28, a video of a 38-year-old man in North Korea secretly delivering food without telling his family after being laid off went viral on the Internet.\nIn the video, the wife broke down and cried when she found out that her husband was secretly delivering food after being laid off. In the end, the couple decided that no matter whether they could bear it or not, they would bear it together.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751565060881715208_0.jpg","hasPublished":true},{"id":"1751573052268200072","name":"李老师不是你老师","createdDate":"2024-01-28 19:48:52","content":"The dog is cooked after the rabbit dies\nOn January 28, CCTV published an article criticizing a group of patriotic Vs, saying that \"patriotism is not a business, and reports should have a basis.\" The man who reported the Nanjing mall and some people with bad intentions and ill intentions were criticized for fabricating facts. Some people took the words literally, applied them mechanically, made random connections, deliberately made false claims, and disrupted the normal economic order and social life. Those who tried to become Internet Vs with the attitude of \"everyone is drunk but I am sober\" should be punished and held accountable.","images":"/tweet/image/whyyoutouzhele/2024/01/28/1751573052268200072_0.jpg","videos":"","hasPublished":true},{"id":"1751574936940863923","name":"李老师不是你老师","createdDate":"2024-01-28 19:56:22","content":"The current statements of patriotic celebrities: some have cut off their stance at the speed of light while others are still arguing.","images":"/tweet/image/whyyoutouzhele/2024/01/28/1751574936940863923_0.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751574936940863923_1.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751574936940863923_2.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751574936940863923_3.jpg","videos":"","hasPublished":true},{"id":"1751583778089193918","name":"李老师不是你老师","createdDate":"2024-01-28 20:31:30","content":"Some bloggers said that what the positive energy big Vs did was similar to what Zhan Ma did, but Zhan Ma teacher obviously did it better.","images":"/tweet/image/whyyoutouzhele/2024/01/28/1751583778089193918_0.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751583778089193918_1.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751583778089193918_2.jpg","videos":"","hasPublished":true},{"id":"1751585069066555567","name":"李老师不是你老师","createdDate":"2024-01-28 20:36:37","content":"@IngWeilai I am very grateful that he used his Youtube account to drive traffic to my \"Daily News\".","images":"","videos":"","hasPublished":true},{"id":"1751585977426952218","name":"李老师不是你老师","createdDate":"2024-01-28 20:40:14","content":"Simply answer the doubts in the comments section\n1. I don’t think this is acting, because if it is acting, there is obviously too much garbage time in the video. If it is a script, all conflicts need to be resolved within the time limit of Douyin. The script of a 1-minute video and a 10-minute video is very different, and there is no editing or NG throughout the whole process. These two people can beat 100% of domestic actors to win awards. …","images":"","videos":"","hasPublished":true},{"id":"1751591497110061480","name":"李老师不是你老师","createdDate":"2024-01-28 21:02:10","content":"January 28, Zhejiang. A college student posted a video on a social platform saying that his salary was deducted from his work at a milk tea shop, and his hourly wage was only 6 yuan.\nThe student said that he worked as a receptionist at a local Gu Ming milk tea shop. Because he left early, he was told by the HR to resign early. His salary was settled at 60 yuan a day and there was no salary for the first three days as a probation period. According to the description of the college student, he was only a receptionist, but he had to handle everything in the store and worked ten hours a day. If he followed the settlement conditions proposed by the HR. That means his hourly wage was only 6 yuan.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751591497110061480_0.jpg","hasPublished":true},{"id":"1751591547013919136","name":"李老师不是你老师","createdDate":"2024-01-28 21:02:22","content":"https://t.co/HFL5ADXnED","images":"/tweet/image/whyyoutouzhele/2024/01/28/1751591547013919136_0.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751591547013919136_1.jpg","videos":"","hasPublished":true},{"id":"1751593927973478420","name":"李老师不是你老师","createdDate":"2024-01-28 21:11:50","content":"On January 28, media reported that many lawyers reported on the Internet under their real names that Liu, vice president of the Yingtan Intermediate People's Court of Jiangxi Province, had serious plagiarism in his master's thesis, with a plagiarism rate of 63.9%. They also reported the situation to Nanjing University, Liu's master's degree school.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751593927973478420_0.jpg","hasPublished":true},{"id":"1751599216319767023","name":"李老师不是你老师","createdDate":"2024-01-28 21:32:50","content":"On January 28, the medical question bank \"Yi Kao Bang\" app was reported to have 64 comments.\nMany netizens left comments in the comment area of a question numbered 1989N73A to discuss the 64 incident.\nThe pictures circulated online show that the comments of netizens were very direct and bold, and one netizen even commented \"Do you want to eat Qingfeng brand peanuts?\"","images":"/tweet/image/whyyoutouzhele/2024/01/28/1751599216319767023_0.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751599216319767023_1.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751599216319767023_2.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751599216319767023_3.jpg","videos":"","hasPublished":true},{"id":"1751606779794882668","name":"李老师不是你老师","createdDate":"2024-01-28 22:02:54","content":"On January 27, Guanyun County, Jiangsu Province, it was reported that the well-known patriotic blogger \"Yiduolian\" on Douyin was stopped by the police when he went to Zhang Xinwei's home in Guanyun County, and then lost contact.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751606779794882668_0.jpg","hasPublished":true},{"id":"1751607554277306580","name":"李老师不是你老师","createdDate":"2024-01-28 22:05:58","content":"It is reported that \"Yi Duo Lian\" is a slightly radical patriotic blogger who became famous for reporting a Japanese restaurant during a live broadcast on Shanghai Fengqing Street.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751607554277306580_0.jpg","hasPublished":true},{"id":"1751611617274368254","name":"李老师不是你老师","createdDate":"2024-01-28 22:22:07","content":"@woyongdehuawei When you care about foreign countries, you are a patriotic blogger.\nWhen you care about China, you become a traitor.","images":"","videos":"","hasPublished":true},{"id":"1751616564497932630","name":"李老师不是你老师","createdDate":"2024-01-28 22:41:47","content":"At 5:00 a.m. on January 28, in Taiping Street, Jinan City, Shandong Province, the demolition office organized more than 300 people equipped with shields and helmets to confront the villagers at the entrance of the village.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/28/1751616564497932630_0.jpg","hasPublished":true},{"id":"1751635698598244568","name":"李老师不是你老师","createdDate":"2024-01-28 23:57:49","content":"On January 28, a Henan Village Bank depositor went to Zhengzhou to withdraw money again. Before he even got off the car, he was blocked by security guards.","images":"/tweet/image/whyyoutouzhele/2024/01/28/1751635698598244568_0.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751635698598244568_1.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751635698598244568_2.jpg,/tweet/image/whyyoutouzhele/2024/01/28/1751635698598244568_3.jpg","videos":"","hasPublished":true}]