[{"id":"1766539371509846337","name":"李老师不是你老师","createdDate":"2024-03-10 02:59:41","content":"On March 9, a video titled \"Zhang Xiaolei, founder of Songsan Auto, reported BYD Party Secretary and Chairman Wang Chuanfu by real name\" attracted wide attention in the automotive industry. In the video, Zhang Xiaolei held up his ID card and reported BYD Party Secretary and Chairman Wang Chuanfu by real name for having an affair with a female executive, Li Ke, and having two illegitimate children of American nationality. He said that Wang Chuanfu was frugal and patriotic in China, but had many assets in the United States, and that he had seriously violated the party membership. The video has been deleted in China.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/10/1766539371509846337_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766544407505883253","name":"李老师不是你老师","createdDate":"2024-03-10 03:19:42","content":"According to public information, the predecessor of Songsan Auto is the world's top customized motorcycle brand Songsan Motorcycle, and its founder Zhang Xiaolei is a well-known \"motorcycle boss\" in the circle. Songsan Auto has cooperated with BYD to launch many high-end retro new energy vehicles. These models use BYD's car logo and power system. One of the hybrid convertible retro sports cars priced at nearly 600,000 yuan, a blogger said in February 23, some car owners even added 100,000 yuan and waited for three months before ordering it.\nHowever, in September 23, Songsan Technology sued BYD in court for \"contract dispute\". It said that it invested all the funds of 235 million yuan to entrust BYD to OEM, but the delivery was delayed for 25 months, and the final delivery was \"illegal products\" with unqualified accessories, falsified environmental protection vehicle lists, and no RDE experiments, resulting in tens of thousands of orders being unable to be delivered.\nOn the same day, Zhang Xiaolei posted on Weibo that he spent 235 million yuan to endure more than three years of bullying, only to get...","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766544407505883253_0.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766544407505883253_1.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766544407505883253_2.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766544407505883253_3.jpg","videos":"","hasFullContentTranslated":false,"fullContent":"根据公开资料显示，松散汽车的前身是全球顶级定制机车品牌松散机车，其创始人张小雷是圈内著名的“机车大佬”。松散汽车曾经与比亚迪合作推出过多款高端复古新能源汽车。这些车型采用的比亚迪的车标和动力系统。其中一款售价近60万的混动敞篷复古跑车，23年2月份有博主称，有的车主甚至加价10万苦等三个月才定到。\n然而23年9月，松散科技却向法院起诉比亚迪，案由为“合同纠纷”。称投入全部资金2.35亿元委托比亚迪代工，但却延迟交付长达25个月，而且最终交付的还是配件不合格、环保随车清单造假、未作RDE实验的“违规品”，导致数万订单无法交付。\n当天，张小雷曾发微博称，自己花了2.35亿忍受了三年多霸凌，仅仅换来100多台车，单车成本近200万，结果车的动力和电控系统品质不合格，环保随车清单造假、未作RDE实验的“违规品”。","hasPublished":false},{"id":"1766585188883075361","name":"李老师不是你老师","createdDate":"2024-03-10 06:01:45","content":"An online car-hailing driver tells from his perspective why the driver in the video ran over the law enforcement officers to escape, and the current situation of online car-hailing drivers being exploited by the platform, insurance, and car rental companies. When I lamented that online car-hailing drivers are the modern-day camel Xiangzi, he said, don't insult Xiangzi.","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766585188883075361_0.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766585188883075361_1.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766585188883075361_2.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766585188883075361_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766628109174915578","name":"李老师不是你老师","createdDate":"2024-03-10 08:52:18","content":"A video circulated online in the early morning of March 10 showed that a black car was suspected to rush to the front of Xinhua Gate of Zhongnanhai, and then a group of security personnel controlled the driver and carried him to Fuyou Street. This video was taken by a passing vehicle. In the video, it can be seen that the vehicle was very close to the main entrance of Xinhua Gate. It is not clear at present when the video was taken and why the incident occurred.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/10/1766628109174915578_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766642170994319864","name":"李老师不是你老师","createdDate":"2024-03-10 09:48:10","content":"Some videos and photos uploaded in recent days show that lanterns are currently hung at Xinhua Gate.","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766642170994319864_0.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766642170994319864_1.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766644406646452569","name":"李老师不是你老师","createdDate":"2024-03-10 09:57:03","content":"@JimmyZ315 There are green trees in the video too","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766780863331594653","name":"李老师不是你老师","createdDate":"2024-03-10 18:59:17","content":"On the evening of March 9, Zhang Xiaolei posted on Weibo saying \"This is just the beginning\"","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766780863331594653_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766781297815413185","name":"李老师不是你老师","createdDate":"2024-03-10 19:01:01","content":"Netizen contribution\nAt Xuchang East Station in Henan, each person on the train bound for Beijing will be given a small red dot after the second security check\n\"I don't know if it's a tribute to Japan\"","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766781297815413185_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766785266000240854","name":"李老师不是你老师","createdDate":"2024-03-10 19:16:47","content":"On March 10, at Guangzhou Animation Star City, a man smashed the autograph wall in anger because he mistook the illustrations of \"Grave Robbers' Chronicles\" for Japanese anime.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/10/1766785266000240854_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766785401421713642","name":"李老师不是你老师","createdDate":"2024-03-10 19:17:19","content":"https://t.co/PyMwBJt28M","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766785401421713642_0.jpg","videos":"","hasPublished":false},{"id":"1766808070389186870","name":"李老师不是你老师","createdDate":"2024-03-10 20:47:24","content":"On the evening of March 9, Zhengzhou traffic police conducted a surprise inspection on electric motorcycles racing near the Olympic Sports Center and arrested 13 riders, the oldest of whom was 17 years old and the youngest was 13.","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766808070389186870_0.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766808070389186870_1.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766818851281408423","name":"李老师不是你老师","createdDate":"2024-03-10 21:30:14","content":"Last week, many places in Russia held activities to commemorate the 55th anniversary of the \"Zhenbao Island\" battle.\nIn March 1969, China and the Soviet Union had an armed conflict on Zhenbao Island. The incident ended with China's victory. China actually controlled Zhenbao Island after the incident.","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766818851281408423_0.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766818851281408423_1.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766818851281408423_2.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766818851281408423_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766820267555180887","name":"李老师不是你老师","createdDate":"2024-03-10 21:35:52","content":"On the evening of March 10, a car hit someone at the intersection of Wuyi Road and Guangming Road in Xuchang, Henan Province.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/10/1766820267555180887_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766820352816971791","name":"李老师不是你老师","createdDate":"2024-03-10 21:36:12","content":"https://t.co/JoKjJSAjY3","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766820352816971791_0.jpg","videos":"","hasPublished":false},{"id":"1766824242463539319","name":"李老师不是你老师","createdDate":"2024-03-10 21:51:40","content":"Netizen added: At the end of last year, some students from Beijing University of Chinese Medicine felt that this club was \"wrong\" and that they were a \"cult\". They posted about the club on their campus wall and reported the club to the school. Beijing University of Chinese Medicine also responded, determining that the organization had the nature of a pyramid scheme and a cult, and gave students safety education, asking them not to participate.","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766824242463539319_0.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766824242463539319_1.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766824242463539319_2.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766824242463539319_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766828217946509648","name":"李老师不是你老师","createdDate":"2024-03-10 22:07:27","content":"A lot of discussions and clues about this incident point to a person named Ding Xiaoping. According to online rumors, Ding Xiaoping has been organizing this kind of patriotic summer camp for many years. At the same time, in addition to General Jia Xueyang, the guests of the summer camp also include Luo Yuan and others. However, Ding Xiaoping's name cannot be found on the official website of the summer camp, and there is no Ding Xiaoping in the company's equity relationship. Currently, when searching for \"Ding Xiaoping\" on Google, the top result is an article published in New Century Weekly in 2007 titled \"Unveiling the Brainwasher Ding Xiaoping\", which tells about his recruitment of students from Beijing universities to participate in the \"Fourth China University Student Self-Improvement Summer Camp\" in 2007. According to Sogou Encyclopedia, Ding Xiaoping, male, was born in Yanshou County, Heilongjiang Province in 1962. He is a young mathematician and natural dialectician. [1] In the 1980s, Ding Xiaoping was admitted to and studied at Tsinghua University, Peking University and Minzu University of China, becoming the first person in New China to cross the engineering,...","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766828217946509648_0.jpg,/tweet/image/whyyoutouzhele/2024/03/10/1766828217946509648_1.jpg","videos":"","hasFullContentTranslated":false,"fullContent":"关于该事件的大量讨论和线索都指向一个名为丁小平的人，据网传消息称丁小平已经组织这种爱国夏令营活动很多年。同时，该夏令营嘉宾里除了贾雪阳将军外，还有罗援等人\n但同时在该夏令营的官方网站上却找不到丁小平的名字，公司股权关系里也没有丁小平。\n目前在谷歌搜索“丁小平”，靠前的是一篇2007年新世纪周刊发表的名为《揭幕洗脑者丁小平》的文章，讲述其2007年在北京高校间招募学生参加“第四届中华大学生自我完善夏令营”的文章。\n根据搜狗百科显示，丁小平，男，1962年出生于黑龙江省延寿县，青年数学家、自然辩证法学家。[1]上世纪八十年代，丁小平分别考入并就读于清华、北大和中央民族学院，成为新中国第一位横跨工、理、哲三个专业的硕士研究生。他多年来一直从事科研和校外教育活动，在哲学、心理学、科学方法、数学、物理学和中医学等多个学科指导博士和博士后。[2]现主要从事科学研究工作，在数学、哲学、心理学等领域有突破性学术成果。代表作品有《浅谈现行微积分原理的错误》、《略论作为微积分原理的完善的实变函数》、《微分之讲授》、《新型微积分原理》等。","hasPublished":false},{"id":"1766853981555339417","name":"李老师不是你老师","createdDate":"2024-03-10 23:49:50","content":"On the evening of March 10, a fire broke out in a dormitory of Jiangsu Yancheng Vocational and Technical College.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/10/1766853981555339417_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1766854069769924639","name":"李老师不是你老师","createdDate":"2024-03-10 23:50:11","content":"https://t.co/0HxWvxeey7","images":"/tweet/image/whyyoutouzhele/2024/03/10/1766854069769924639_0.jpg","videos":"","hasPublished":false}]