[
  {
    "id": "1879198682652049409",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-15 00:07:34",
    "content": "Netizen contribution\nThe winter vacation job recruitment cards distributed on the campus of colleges and universities in Chuzhou, Anhui, all have working hours of 10 hours.",
    "images": "/tweet/image/whyyoutouzhele/2025/01/15/1879198682652049409_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 87,
    "replies": 17,
    "retweets": 3,
    "views": 20567,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1879200645129089053",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-15 00:15:22",
    "content": "South Korea's National Intelligence Service revealed that on the note carried by the dead soldiers, the North Korean authorities had found an order requiring the soldiers to \"commit suicide before being captured\". Recently, a North Korean soldier shouted \"General Kim Jong-un\" and tried to commit suicide with a grenade when facing Ukrainian prisoners, but was shot dead.\nThe total number of casualties of North Korean soldiers sent by North Korea to fight in the Kursk region of Russia exceeded 3,000, including more than 300 deaths and more than 2,700 injuries.\nThe Ukrainian intelligence department cooperated with the National Intelligence Service to obtain statements from two captured soldiers. According to the confession, the North Korean authorities promised to pay wages and give \"hero treatment\", but the actual situation did not match the promise, and the soldiers were actually treated as \"consumables\"",
    "images": "/tweet/image/whyyoutouzhele/2025/01/15/1879200645129089053_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 133,
    "replies": 17,
    "retweets": 14,
    "views": 23486,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1879203340221096093",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-15 00:26:04",
    "content": "On January 13, a netizen said in the comment area that he recently received a fraudulent call, and then received a call from the police asking him to go to the police station to register, otherwise his bank card would be frozen. The netizen had no choice but to go to the police station to register his identity, address and other information, and then he had to hold up the registration form and take a photo.\nThe netizen said: It was obviously me who was defrauded, but not only was I not protected, I was also threatened to freeze my bank card. Why don't they check the fraudsters?",
    "images": "/tweet/image/whyyoutouzhele/2025/01/15/1879203340221096093_0.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 72,
    "replies": 12,
    "retweets": 10,
    "views": 16750,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1879209318450647556",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-01-15 00:49:50",
    "content": "On January 14, the man said that the protective equipment used by the workers engaged in container spraying in the video was substandard. The workers should have worn chemical protective gloves, but they wore ordinary leather gloves. They should have worn chemical protective clothing, but the workers wore homemade plastic sheets. The man said that after working for a few years, his salary was not enough to cover medical expenses. Many domestic companies do not treat workers as human beings.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2025/01/15/1879209318450647556_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 73,
    "replies": 9,
    "retweets": 6,
    "views": 11611,
    "originVideos": "https://video.twimg.com/ext_tw_video/1879206216183988225/pu/vid/avc1/720x1280/4qXgxJeoqWlJPRFf.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]