[
  {
    "id": "1758661750650708092",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-17 09:16:50",
    "content": "Afterwards, after the video received over 100,000 likes, the comment section disappeared first, and then the video itself disappeared.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/17/1758661750650708092_0.jpg,/tweet/image/whyyoutouzhele/2024/02/17/1758661750650708092_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758810749462306918",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-17 19:08:54",
    "content": "At present, the dome and twin towers of the Najiaying Mosque have been renovated.\nIn May 2023, when the government planned to demolish the dome of the mosque, it caused a fierce conflict with local people.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/17/1758810749462306918_0.jpg,/tweet/image/whyyoutouzhele/2024/02/17/1758810749462306918_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758812855111934183",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-17 19:17:16",
    "content": "Following the previous series of high school students jumping off buildings in Jiangsu, which triggered the province's early winter vacation, on February 17, it was reported online that Jiangsu high schools will fully restore the weekend double-day off system in the new semester and cancel evening self-study.\nHowever, according to the feedback from Jiangsu students, there are countermeasures to the policies, and many schools have already forced \"voluntary return to school\" from the third to the fifth day of the Chinese New Year.\nHowever, according to the news, the Jiangsu Provincial Department of Education has issued instructions to strictly prohibit early school opening",
    "images": "/tweet/image/whyyoutouzhele/2024/02/17/1758812855111934183_0.jpg,/tweet/image/whyyoutouzhele/2024/02/17/1758812855111934183_1.jpg,/tweet/image/whyyoutouzhele/2024/02/17/1758812855111934183_2.jpg,/tweet/image/whyyoutouzhele/2024/02/17/1758812855111934183_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758819554392723536",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-17 19:43:53",
    "content": "At present, the house number of No. 80 Hongxing Road, Hefei, which is rumored to be Li Keqiang’s former residence, has been blocked.",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758824479382261863",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-17 20:03:27",
    "content": "After the Guiyang fire hydrant incident, netizens across the country began to pay attention to the fire safety issues of their own buildings.\nOn February 16, when the Hechang Youdi community in Zhengzhou, Henan Province was handed over, the owners found that the door of the fire-fighting facilities in the corridor was sealed with a seal printed with \"Fire-fighting facilities, please do not touch without permission.\"\nHowever, when the owners tore off the seal, they found that it was empty inside, the fire hydrant interface was facing the wall, and even the door of the fire hydrant was sealed.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/17/1758824479382261863_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1758825640973705580",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-17 20:08:04",
    "content": "There is another update on the controversy over Messi's absence from the Hong Kong exhibition match. The organizers suddenly changed their words, saying that they knew Messi would not play 15 minutes before the match. Previously, they claimed that they only learned the news after the first half.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/17/1758825640973705580_0.jpg,/tweet/image/whyyoutouzhele/2024/02/17/1758825640973705580_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758828641306468622",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-17 20:20:00",
    "content": "At the age of 15, @FIC_HK was unable to tolerate the patriotic education that was constantly added to Hong Kong classrooms, so he embarked on the path of \"humiliating children\" and was taken away by the National Security Bureau.\nFrom then on, his life changed completely: he interrupted his studies at a young age, fled to the United States alone, and experienced many hardships and setbacks.\nToday, @FIC_HK hopes to tell you his story\nhttps://t.co/oDUxPx4wdQ",
    "images": "/tweet/image/whyyoutouzhele/2024/02/17/1758828641306468622_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1758833282253308318",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-17 20:38:26",
    "content": "It was reported online that a woman in Guiyang posted a video showing off the New Year's condolence money issued by the Veteran Affairs Bureau of the Yunyang District Committee of the Communist Party of China, and lamented that \"the treatment is still very good.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/17/1758833282253308318_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1758853124326822048",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-17 21:57:17",
    "content": "Netizen contribution\nDuring the Chinese New Year, some civil servants in some regions also shared their \"relaxed feelings\" online.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/17/1758853124326822048_0.jpg,/tweet/image/whyyoutouzhele/2024/02/17/1758853124326822048_1.jpg,/tweet/image/whyyoutouzhele/2024/02/17/1758853124326822048_2.jpg,/tweet/image/whyyoutouzhele/2024/02/17/1758853124326822048_3.jpg",
    "videos": "",
    "hasPublished": true
  }
]