[
  {
    "id": "1890432961574760460",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-15 00:08:35",
    "content": "Bloomberg: China's real estate crisis enters a dangerous new phase.\nFour years after Evergrande and other real estate developers fell into default, Communist Party officials decided in late January to rescue Vanke, one of China's last surviving real estate giants. Faced with a plunge in Vanke's bond prices and the company's warning of a record loss of $6.2 billion, officials in Shenzhen stepped in and took over operational control.\nBut it also highlights a grim reality: The real estate crisis is worsening. The crisis has dragged down China's economy and created nearly $160 billion in bad debt, the largest in the world.\nAlthough Chinese President Xi Jinping's government has repeatedly introduced stimulus policies, the brief recovery in the real estate market has disappeared.\nAccording to people familiar with the matter, Chinese bankers have basically stopped lending to real estate projects outside major cities such as Shanghai. International creditors are losing patience: More debt restructuring deals are falling apart, and as of...",
    "images": "/tweet/image/whyyoutouzhele/2025/02/15/1890432961574760460_0.jpg,/tweet/image/whyyoutouzhele/2025/02/15/1890432961574760460_1.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 172,
    "replies": 26,
    "retweets": 21,
    "views": 35304,
    "originVideos": "",
    "hasFullContentTranslated": false,
    "fullContent": "彭博：中国房地产危机进入危险的新阶段。\n 在恒大等房地产开发商陷入违约的四年后，中共官员在1月底决定，出手挽救中国最后幸存的房地产巨头之一万科，面对万科债券价格的暴跌和该公司对创纪录的62亿美元亏损的警告，深圳的官员介入，接管了运营控制权。\n 但也凸显了一个严峻的现实：房地产危机正在恶化。这场危机拖累了中国经济，并造成了近1,600亿美元的不良债务，是世界上规模最大的。\n 尽管中国国家主席习近平的政府已多次推出刺激政策，但房地产市场短暂的回暖势头已经消失。\n 据知情人士透露，中国银行业人士已基本停止向上海等主要城市以外的房地产项目提供贷款。国际债权人正在失去耐心：更多的债务重组交易正在破裂，至少12家开发商面临清算申请，其中包括碧桂园等曾经传奇的公司。\n 随着中国内地购房者和游客的减少，这种痛苦也在向香港蔓延。房地产巨头新世界发展有限公司由香港一个富有家族控制，随着亏损不断增加，该公司正竞相出售资产，并将旗下一些大型地产作为抵押。",
    "hasPublished": true
  },
  {
    "id": "1890438630692303009",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-15 00:31:06",
    "content": "Blogger \"Talent Behind the Scenes\" talks about the reasons for the poor box office of \"Operation Jiaolong\": There are really people in this world who cannot establish the necessary connection between Wu Jing being dragged down by various stubborn jokes and the rescue of Myawaddy. Directors like Yu Dong simply cannot see how hard, difficult and desperate we ordinary people are today.\nThe failure of \"Operation Jiaolong\" was because it was too grand, too unrealistic, too out of touch with the masses... so that in the end everyone wanted to boycott it too much. https://pbs.twimg.com/ext_tw_video_thumb/1890438422390861824/pu/img/VPv5JbUuE4_Ls7JW.jpg",
    "images": "/tweet/image/whyyoutouzhele/2025/02/15/1890438630692303009_0.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2025/02/15/1890438630692303009_0.jpg,",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 92,
    "replies": 25,
    "retweets": 14,
    "views": 18607,
    "originVideos": "https://video.twimg.com/ext_tw_video/1890438422390861824/pu/vid/avc1/720x960/43fSp9qx4UiaaD6J.mp4?tag=12,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1890443438316990890",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2025-02-15 00:50:13",
    "content": "Chinese Foreign Minister Wang Yi said at the Munich Security Conference: If the United States insists on suppressing China, China will fight to the end.\nWang Yi stated that China will not impose economic pressure on Russia by restricting the purchase of natural gas: \"If China does not buy from Russia, which country can provide such a huge amount of natural gas to meet the needs of the Chinese people?\"\nWang Yi described the relationship between China and Russia as a \"strategic partnership based on mutual trust.\" He said: \"We have experienced many tests and tribulations in our common history, and we have also learned lessons from them.\"\nAs for the Ukrainian crisis, Wang Yi stated that China has its own position on regional hot issues and has always advocated that all disputes and conflicts should be resolved politically through dialogue, because force and sanctions cannot truly and thoroughly solve problems, and the same is true for the Ukrainian crisis.",
    "images": "/tweet/image/whyyoutouzhele/2025/02/15/1890443438316990890_0.jpg,/tweet/image/whyyoutouzhele/2025/02/15/1890443438316990890_1.jpg,",
    "videos": "",
    "isReply": false,
    "isRetweet": false,
    "isSelfThread": false,
    "likes": 54,
    "replies": 40,
    "retweets": 9,
    "views": 16422,
    "originVideos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]