[
  {
    "id": "1750189917890658467",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 00:12:48",
    "content": "A screenshot of a group chat in the \"Tongxing Community Police-Citizen Exchange Group\" circulated online shows that a netizen reminded in the group that all residents should not go to Zhang Baoshan to watch recently, and should not tremble because if the circle of friends is found in the background, it will be treated as a disturbance of social order. Another netizen asked the local residents of Guanyun County if they had seen his wife. He said that his wife went to Zhang Baoshan Village this afternoon and could not be contacted. He suspected that his wife was invited for tea.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/25/1750189917890658467_0.jpg,/tweet/image/whyyoutouzhele/2024/01/25/1750189917890658467_1.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750192555877102068",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 00:23:16",
    "content": "During the incident, there was a scuffle between the people at the scene and the police.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750192555877102068_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750234072784179322",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 03:08:15",
    "content": "Not only Zhangbaoshan Village was sealed off by the police, but on the evening of January 24, police also guarded Yuejin Gate and other places in Guanyun County, Lianyungang City, allowing only exit but not entry.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750234072784179322_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750234431825076377",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 03:09:40",
    "content": "https://t.co/QscAOyLMrH",
    "images": "/tweet/image/whyyoutouzhele/2024/01/25/1750234431825076377_1.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750306497853079758",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 07:56:02",
    "content": "On January 12, 16 people died in the Pingdingshan coal mine accident.\nOn January 19, 13 people died in a dormitory fire in Fangcheng County.\nOn January 20, 8 people died in a dust explosion in a Changzhou factory.\nOn the evening of January 20, an abandoned grain warehouse in Heze, Shandong exploded. The news is still \"verifying the casualties.\"\nOn January 22, 34 people died in a landslide in Yunnan and 10 people were missing.\nOn January 23, 4 people died in a hotel fire in Jinan.\nOn January 24, 39 people died in a building fire in Xinyu.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/25/1750306497853079758_0.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750445492486434887",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 17:08:21",
    "content": "On January 24, in Jinan, Shandong, a fire broke out at the Ginza Jiayi Changqing Garden Expo Park store, killing four people.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750445492486434887_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750445695167799457",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 17:09:10",
    "content": "At around 0:00 in the morning of January 24, a fire broke out at the Jinfeng Hotel in Cenxi, Wuzhou, Guangxi. Video footage showed that the fire was fierce and the flames were blue. According to an eyewitness, the hotel had not been open for a long time and no one lived there.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750445695167799457_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750445860171731262",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 17:09:49",
    "content": "On the evening of January 24, in Chaozhou, Guangdong, a fire broke out at the Tianrun Furniture Redwood Factory in Chao'an District. According to the video on the Internet, the fire was fierce and accompanied by crackling explosions. As of now, the local official department has not issued a notice on the matter, and the cause of the fire and the casualties are unknown.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750445860171731262_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750446310547735038",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 17:11:36",
    "content": "At noon on January 25, a fire broke out in a factory building in Xinzhan Jiahai Industrial Park, Yaohai District, Hefei, Anhui. Black smoke billowed at the scene. The cause of the accident and the casualties are currently unknown.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750446310547735038_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750446805240689064",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 17:13:34",
    "content": "In the early morning of January 25, a fire broke out at the provincial color printing factory in Fuzhou, Fujian. The scene was full of flames and thick smoke. Witnesses said that the fire broke out in the early morning, and ashes were floating in the sky. Witnesses said that the fire affected seven or eight shops.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750446805240689064_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750451326507450815",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 17:31:32",
    "content": "Some netizens believe that the fires everywhere are caused by spies",
    "images": "/tweet/image/whyyoutouzhele/2024/01/25/1750451326507450815_0.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750452220703756663",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 17:35:05",
    "content": "After the 2023 national GDP data was released, the 2023 GDP data of various provinces have been announced in the past few days.\nSome netizens have sorted out the preliminary GDP rankings of various provinces in the country in 2023. Guangdong Province continued to rank first, and Henan Province was surpassed by Sichuan Province for the first time, ranking fifth in the country for 18 consecutive years and retreating to sixth in the country.\nWhat is more noteworthy is the relevant situation of Henan Province's GDP in 2023: 2023 GDP: 5913.239 billion yuan (preliminary calculation), ranking 6th in the country; actual growth rate 4.1%, ranking 24th in the country; increment -221.266 billion yuan, ranking 26th in the country; nominal growth rate -3.61%, ranking 26th in the country. The GDP data announced by Henan in 2023 was 5913.239 billion yuan, and the preliminary GDP data announced by Henan in 2022 was 6134.505 billion yuan. Based on this calculation, there was actually negative growth in 2023. Henan lowered its 2022 year-end GDP data by nearly 300 billion, achieving positive GDP growth in 2023.\nAt a press conference held by the Information Office of the Henan Provincial People's Government on January 24, Zhu Ming, Secretary-General of the Henan Provincial Government and spokesperson of the Provincial Government, introduced the economic operation of Henan Province in 2023, and explained that since 2023, Henan has focused on improving data quality, increasing the intensity of statistical data verification, and revising historical data for the same period in a realistic manner. After final verification, in 2022, the total amount of Henan Province's GDP at current prices was 58220.13. The revised data is nearly 300 billion yuan less than the nuclear data at the beginning of 2022.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/25/1750452220703756663_0.jpg,/tweet/image/whyyoutouzhele/2024/01/25/1750452220703756663_1.jpg,/tweet/image/whyyoutouzhele/2024/01/25/1750452220703756663_2.jpg,/tweet/image/whyyoutouzhele/2024/01/25/1750452220703756663_3.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750459863308628174",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 18:05:28",
    "content": "On January 25, at Emerald Lake International Plaza in Ningxiang, Hunan Province, several workers were demanding their wages at the elevator entrance. During the process, a policeman got into an argument with a worker because he complained about the people's police (he didn't understand the dialect).",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750459863308628174_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750466527155884133",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 18:31:56",
    "content": "On January 24, the Education Bureau of Xinyu City, Jiangxi Province, conducted a fire hazard inspection on all educational institutions in the city, especially boarding schools, and required all off-campus training institutions in the city to suspend training activities and carry out in-depth fire safety inspections and rectifications.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750466527155884133_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750469309095190938",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 18:43:00",
    "content": "On January 24, South Korea called on China to protect North Korean \"defectors\". The spokesperson of the Ministry of Foreign Affairs responded: There is no such thing as \"defectors\" in China. People who come to China illegally for economic reasons are not refugees.\nThis statement attracted collective criticism from netizens in the comment area, who called on the Ministry of Foreign Affairs to respect life and not be so cold-blooded.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750469309095190938_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750474332361376049",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 19:02:57",
    "content": "On January 25, Hong Kong Chief Executive John Lee said that he had noticed that hostile forces were trying to use propaganda to smear and distort the facts on the Internet, and the SAR government would set up a \"response rebuttal team\" to fight back against social media. John Lee said that Hong Kong had truly awakened after experiencing the \"black violence\" in 2019. After 2019, seeing the pain and hardship of risks endangering national security in front of everyone, everyone understood that even if Hong Kong is a gentleman, it must guard against villains, hostile forces, and espionage activities. Hong Kong must guard against hostile forces trying to maximize their interests in Hong Kong and safeguard Hong Kong's interests and economic development.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750474332361376049_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750482208886751534",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 19:34:15",
    "content": "On January 18, when the School of Water Resources and Environment of China University of Geosciences announced the recruitment of 8 teachers who passed the preliminary test, many people noted their relatives' teacher-student relationship in their profiles.\nAmong them, Zhang Boaiqi's profile noted that his father was Zhang Shouting, director of the school's Development Planning and Scientific Construction Department.\nJi Daodao's postdoctoral co-supervisor Jiang Xiaowei is the vice dean of the School of Water Resources and Environment\nXing Shiping's doctoral supervisor Guo Huaming is the dean of the School of Water Resources and Environment.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/25/1750482208886751534_0.jpg,/tweet/image/whyyoutouzhele/2024/01/25/1750482208886751534_1.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750500357271134573",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 20:46:22",
    "content": "@Chineselawyer_m The author did not specify the details of how the traffic accident ended up with the deputy director of the police station being questioned.",
    "images": "",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750500923544129815",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 20:48:37",
    "content": "On January 23, it was reported online that the deputy director of the Yutian Town Police Station in Tangshan was stabbed in anger. In the video, the young man kept emphasizing that the person next to him was the \"deputy director of the Yutian Town Police Station\" and \"didn't let me speak.\" Then the middle-aged man next to him suddenly got angry and stabbed him in the abdomen with a suspected sharp object, and then attacked the woman who came to persuade him to stop fighting. In the picture, it can be seen that the man's down jacket was pierced and there was suspected blood at the corner of his mouth. The two sides wrestled to the middle of the road, and then several people hid in the car to call the police.\nAccording to the contributor, the two people who were stabbed in the video, a man and a woman, had previously had a traffic accident with a third person. During the accident, the woman said that she was pushed and called the police. During the police station's handling process, they were detained because they were dissatisfied with the police station's handling. Afterwards, the scene in the video happened when the two went to the deputy director to argue.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750500923544129815_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750504758496882911",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 21:03:51",
    "content": "Follow-up\nAfter the incident attracted attention, the page has been removed.\nThe school responded that the public notice period has ended, so the public notice page has been removed.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/25/1750504758496882911_0.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750508578601857446",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 21:19:02",
    "content": "On January 25, Sina Finance announced the list of \"Top Ten Most Influential Economists of the Year\", and Liu Jipeng, who was banned from Weibo, was among them.\nPreviously, Liu Jipeng had publicly stated that the key to the stock market's failure to take off was the system, and that it must be fair and just so that everyone can make money. Subsequently, his Weibo and Douyin were banned, and the content remained on December 5.\nAfter testing, netizens found that, like the food writer Wang Gang before, when users click to follow, it will show success, but it will not exist in the follow list.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/25/1750508578601857446_0.jpg,/tweet/image/whyyoutouzhele/2024/01/25/1750508578601857446_1.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750514005905465784",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 21:40:36",
    "content": "On January 24, Hu Xitui posted a video in support of Liu Jipeng, suggesting that the CSRC should lift the ban on Liu Jipeng and allow him to do more to achieve investor-oriented communication between officials and the public. Lifting the ban on him will help investors trust the sincerity of the CSRC's statements.\nHowever, this video can no longer be found on its homepage.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750514005905465784_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750526056338215390",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 22:28:29",
    "content": "January 25, Jingdezhen, Jiangxi. Jingdezhen Ceramic Culture and Tourism Holdings Co., Ltd. has been in arrears of wages for workers for three years, and workers gathered outside the company to demand their wages.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750526056338215390_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750534830188613869",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 23:03:21",
    "content": "https://t.co/k7B6zaJoAB",
    "images": "",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1750536829105840286",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 23:11:18",
    "content": "January 24, Jiaozuo, Henan. A man posted a video saying that \"Jiaozuo has been invaded by Japanese culture\" and said that \"Japanese-style 100 lanterns\" were hung on every street in Enzhouyi Ancient Town, as if he had traveled to Japan again.\n On January 25, Jiaozuo City Tianhe Park issued a statement stating that the overall decoration design of Enzhouyi Ancient Street is in Chinese Tang style, and has now been replaced with red lanterns. ",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750536829105840286_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1750547207554514993",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-25 23:52:32",
    "content": "On January 25, under a video titled \"Ministry of National Defense: The motherland is unified, Taiwan will return, and the People's Liberation Army always speaks with actions\", netizens expressed their willingness to donate all their debts to the country.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/25/1750547207554514993_0.jpg",
    "hasPublished": false
  }
]