[{"id":"1644074870815309826","name":"李老师不是你老师","createdDate":"2023-04-07 04:29:29","content":"Netizen contribution, Sun Yat-sen University follow-up\nThe school notified that dormitories with a view of the gymnasium should not open windows during the day","images":"/tweet/image/whyyoutouzhele/2023/04/07/1644074870815309826_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/8p4s1gLjAD","accountId":"whyyoutouzhele"},{"id":"1644259477862875138","name":"李老师不是你老师","createdDate":"2023-04-07 16:43:03","content":"On April 7, the verdict of the Fengxian County \"mother of eight children\" case was announced, and Dong Zhimin was sentenced to nine years in prison.","images":"/tweet/image/whyyoutouzhele/2023/04/07/1644259477862875138_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/9GxfK60otP","accountId":"whyyoutouzhele"},{"id":"1644260789711151109","name":"李老师不是你老师","createdDate":"2023-04-07 16:48:15","content":"According to the first-instance verdict of the Intermediate People's Court of Xuzhou City, Jiangsu Province\nIn early 1998, the defendants Shi Lizhong and Sang Heniu abducted Xiaohuamei from Yagu Village, Zilijia Township, Fugong County, Yunnan Province to Donghai County, Jiangsu Province under the pretext of medical treatment, and then sold Xiaohuamei to Xu Moudong, a farmer in the county, for RMB 5,000. Xiaohuamei lived with Xu Moudong until early May of the same year, after which her whereabouts were unknown.\nIn June of the same year, the defendant Tan Aiqing and his wife Li Mouling sold Xiaohuamei, who was found and taken in by them in Tanwa Village, Luoji Township, Xiayi County, Henan Province, to the defendants Huo Yongqu and Huo Fude for RMB 3,000. Huo Yongqu and Huo Fude took Xiaohuamei to Huankou Town, Feng County, and, through the introduction of Liu Mouzhu (who played a minor role in the crime, the circumstances were relatively minor, and the statute of limitations had expired, so he was not prosecuted according to law), resold it to Dong Mougeng (deceased) and his son, the defendant Dong Zhimin, for RMB 5,000. The defendant Dong Zhimin brought Xiao Huamei to live with him at his home in Dongji Village.\nWhen Xiao Huamei first arrived at Dong's house, she was able to take care of herself and communicate with others, but sometimes she had silly smiles and dull eyes. In 1999, the couple gave birth to their eldest son. From 2011 to 2020, the couple gave birth to seven children. After Xiao Huamei gave birth to her second and third sons in 2011 and 2012, her mental disorder symptoms gradually worsened, and after giving birth to her sixth son in 2017, the symptoms became more obvious. During this period, Dong Zhimin only took Xiao Huamei to the outpatient clinic of a township hospital in a neighboring county for medication treatment in the first half of 2013, and then never sent her to a doctor for treatment. From July 2017 to before the incident, Dong Zhimin also abused and detained Xiao Huamei by tying her with cloth strips and ropes and locking her neck with iron chains. During this period, Xiao Huamei's diet and daily life were not guaranteed normally, and she often went hungry and cold. There was no water, electricity or sunlight in her living place, and her living environment was poor. Dong Zhimin's abuse caused Xiao Huamei to suffer serious damage to her health. Xiao Huamei was diagnosed with schizophrenia (recession stage) and was assessed as a second-level mental disability.","images":"/tweet/image/whyyoutouzhele/2023/04/07/1644260789711151109_0.jpg,/tweet/image/whyyoutouzhele/2023/04/07/1644260789711151109_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1644265575500197895","name":"李老师不是你老师","createdDate":"2023-04-07 17:07:16","content":"During the trial and judgment process of the Xuzhou Court, it was determined that the \"mother of eight children\" was Xiao Huamei from Yagu Village, Zilijia Township, Fugong County, Yunnan Province.\nBut before that, whether the \"mother of eight children\" was Xiao Huamei had always been a focus of online debate.\nNow that the judgment has been issued, do you believe that the \"mother of eight children\" is Xiao Huamei?","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1644339120993452032","name":"李老师不是你老师","createdDate":"2023-04-07 21:59:31","content":"On April 7, the Deyang Municipal Public Security Bureau issued a police report stating that the chat records of \"collective resignation of China Electronics Technology Group Corporation employees\" that were previously circulated on the Internet were forged. Chen Moulong (male, Han nationality, 26 years old) was dissatisfied because he had applied for a job at China Electronics Technology Group Corporation but was not hired. He used image processing software to fabricate the relevant chat records, which aroused public discussion and caused adverse effects. \nHe has been punished with administrative detention and the case is still under further investigation.","images":"/tweet/image/whyyoutouzhele/2023/04/07/1644339120993452032_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/biPfRX4UHu","accountId":"whyyoutouzhele"},{"id":"1644342628199038976","name":"李老师不是你老师","createdDate":"2023-04-07 22:13:27","content":"Netizen submission\nRecently, a Xiaohongshu netizen revealed that he found that Huawei phones automatically generate algorithms when shooting the moon, resulting in a fake moon.\nThis has sparked widespread discussion among netizens","images":"/tweet/image/whyyoutouzhele/2023/04/07/1644342628199038976_0.jpg,/tweet/image/whyyoutouzhele/2023/04/07/1644342628199038976_1.jpg,/tweet/image/whyyoutouzhele/2023/04/07/1644342628199038976_2.jpg,/tweet/image/whyyoutouzhele/2023/04/07/1644342628199038976_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/U28jpyrNBM","accountId":"whyyoutouzhele"},{"id":"1644349569029881856","name":"李老师不是你老师","createdDate":"2023-04-07 22:41:02","content":"Original post\n","images":"","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/FOhpT257H2","accountId":"whyyoutouzhele"},{"id":"1644368253416865795","name":"李老师不是你老师","createdDate":"2023-04-07 23:55:17","content":"Here, I sincerely apologize to my readers, Canadian Segev Law Firm, and other people who may be affected. I admit my mistakes and apologize to everyone who was affected.\n\nI have been thinking and reflecting these days, and I realized the troubles caused by my negligence. Here I promise that I will be more cautious in the future, carefully verify the information, and ensure that I will not make similar mistakes again. Please supervise me. …","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"}]