[{"id":"1855645795510350047","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-11 00:16:48","content":"On November 10, NBC reported that Trump may deport hundreds of thousands of illegal immigrants who entered the United States through the route after taking office.\nAmong them, Chinese men who are considered to have reached the age of military service will be the first targets of deportation, on the grounds that \"they may pose a threat to national security.\" If China does not accept them, it will consider deporting them to a third country.\nHowever, the article also stated that immigrants who legally arrived in the United States under the Biden administration's two programs (CBP One and Cuba, Haiti, Nicaragua, Venezuela (CHNV) Parole Program) may be exempt from deportation if they have been granted asylum or are applying for asylum, or have other legal status to stay in the United States.\nAt the same time, this policy is also expected to be subject to some legal obstacles.\nHowever, some sources warned that after Trump took office, even if they may have been granted asylum and would not be considered the first targets for deportation, they may still end up...","images":"/tweet/image/whyyoutouzhele/2024/11/11/1855645795510350047_0.jpg,/tweet/image/whyyoutouzhele/2024/11/11/1855645795510350047_1.jpg,/tweet/image/whyyoutouzhele/2024/11/11/1855645795510350047_2.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"11月10日，美国NBC报道称，特朗普上任后可能会驱逐数十万走线进入美国的非法移民。\n其中，那些被认为达到服兵役年龄的中国男性，将成为首批遣返目标，理由是“因为他们可能对国家安全构成威胁”。如果中国不接收，将会考虑将他们遣返到第三国。\n不过文中也表示，根据拜登政府的两项计划（CBP One 和古巴、海地、尼加拉瓜、委内瑞拉 (CHNV) 假释计划）合法抵达美国的移民，如果已经获得庇护或正在申请庇护，或拥有其他合法身份留在美国，可能免于被驱逐出境。\n同时，这一政策预计也会受到一些法律阻扰。\n不过也有消息人士警告称，特朗普上任后，即使他们可能获得了庇护，不会被视为驱逐出境的首要对象，但最终仍有可能被驱逐出境。\n","hasPublished":true},{"id":"1855649976250241117","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-11 00:33:25","content":"November 10, Hengyang, Hunan. The government's livelihood shantytown renovation project has been in breach of contract for more than 30 months and has not delivered the houses. The owners knelt down collectively and begged the government to make a decision for the people.\nNovember 10, Chengde, Hebei. A petitioner cried loudly outside the court and asked to see the president, hoping that the president would come out to make a decision for the people.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/11/1855649976250241117_0.jpg,/tweet/video/whyyoutouzhele/2024/11/11/1855649976250241117_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1855672332486066288","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-11 02:02:15","content":"On the evening of November 10, in Kaifeng, Henan, students who walked to Kaifeng shouted: \"Please rest assured, the Party will make the country strong.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/11/1855672332486066288_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1855705129845919876","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-11 04:12:34","content":"Earlier this year, Mr. Li suddenly appeared in the domestic encyclopedia entry and was defined by the Chinese government as an \"online traitor.\" How could a person who reports on social events happening in China become a \"Han spy\"? What is the relationship between \"Han\" and this country, and what is the relationship between \"Han\" and this party-state?","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/11/1855705129845919876_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1855712936678809753","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-11 04:43:36","content":"On November 10, a university in Shanghai also issued a notice requiring students not to easily join any off-campus or unofficial organization activities, and those who did not return to school that day needed to report to their counselors.","images":"/tweet/image/whyyoutouzhele/2024/11/11/1855712936678809753_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false}]