[{"id":"1845868915139674342","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-15 00:46:58","content":"Recently, players of the domestic mobile game \"Identity V\" found out that the production team had a preference for the game character \"Entomologist\" and had some ulterior motives in the skin design. It is suspected that many elements in the skin are related to the wedding of the game's chief planner and his wife. Angry players then began to trace back and find fault with the game, and found that the game had released a game skin for a Japanese character on the National Memorial Day and misspelled China in the event. Therefore, many players cursed the game online as a \"traitor game.\"","images":"/tweet/image/whyyoutouzhele/2024/10/15/1845868915139674342_0.jpg,/tweet/image/whyyoutouzhele/2024/10/15/1845868915139674342_1.jpg,/tweet/image/whyyoutouzhele/2024/10/15/1845868915139674342_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/15/1845868915139674342_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1845872566398775409","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-15 01:01:29","content":"Two more people have been added to the Taiwan independence list. On October 14, Chen Binhua, spokesperson for the Taiwan Affairs Office of the State Council, said that after carefully checking and identifying the clues and information reported by people on both sides of the Taiwan Strait to the Taiwan Affairs Office to collect clues and reports on \"Taiwan independence\" diehards, it was decided to punish Shen Boyang, Cao Xingcheng and the \"Black Bear Academy\" in accordance with the law. The 16th President of the Republic of China, Lai Ching-te, is still not on this list.","images":"/tweet/image/whyyoutouzhele/2024/10/15/1845872566398775409_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/15/1845872566398775409_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]