[{"id":"1813854332972085533","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-18 16:32:27","content":"On July 18, a fire broke out in the Jiuding Building in Zigong, Sichuan. Two men drove a construction vehicle to rescue dozens of people near the fire.\nIt is reported that the fire killed 16 people. After preliminary investigation, the fire was caused by construction work.\nhttps://t.co/VeqUBs6RlT","images":"/tweet/image/whyyoutouzhele/2024/07/18/1813854332972085533_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/07/18/1813854332972085533_0.jpg,","hasPublished":true},{"id":"1813857723903324513","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-18 16:45:55","content":"On July 18, the Hong Kong Consumer Council apologized for the Nongfu Spring incident, saying that it was sorry for the misunderstanding caused by the difference in sample classification in the earlier test of Nongfu Spring. After re-scoring, the overall performance of the sample was adjusted from 4.5 stars to 5 stars.\nhttps://t.co/9fn1T7d0Ot","images":"/tweet/image/whyyoutouzhele/2024/07/18/1813857723903324513_0.jpg,/tweet/image/whyyoutouzhele/2024/07/18/1813857723903324513_1.jpg,","videos":"","hasPublished":true},{"id":"1813859469119615181","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-18 16:52:51","content":"July 17, Luliang, Shanxi. Near Xin'an Street, a man violently beat a woman on the street, smashed her head with a brick, and kicked her several times.\nOn July 18, the Women's Federation of Xiaoyi City stated that the man was not a local, he came from another place and found the woman and beat her. The local police responded that the man had been detained and the woman was hospitalized for treatment. The police are investigating the specific situation.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/07/18/1813859469119615181_0.jpg,/tweet/video/whyyoutouzhele/2024/07/18/1813859469119615181_1.jpg,","hasPublished":true},{"id":"1813864750905962610","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-18 17:13:51","content":"July 16, Shandong. Blogger \"Kong Meng Yan Wandering Around the World\" interviewed an old man who worked as a sanitation worker in the countryside. The old man said that he was 77 years old, worked 9 hours a day, and had a monthly salary of only 700 yuan. He was also owed wages for several months. The old man also said that his child had died. \"The child froze to death, no one took care of him at home, and his mother (wife) had cerebral thrombosis.\"","images":"/tweet/image/whyyoutouzhele/2024/07/18/1813864750905962610_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/07/18/1813864750905962610_0.jpg,","hasPublished":true}]