[{"id":"1757091217689440619","name":"李老师不是你老师","createdDate":"2024-02-13 01:16:06","content":"Video of police and citizens working together to subdue the driver\nSome netizens said it was drunk driving, while others said it was drug driving\nDuring the process of being subdued, the driver shouted \"I am from Kunming, Guandu District, save me\", which attracted ridicule from the surrounding citizens.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/13/1757091217689440619_0.jpg","hasPublished":true},{"id":"1757108493675319334","name":"李老师不是你老师","createdDate":"2024-02-13 02:24:45","content":"Some updates from Zhaike Village, Ju County, Rizhao, Shandong:\nIn addition to the death of a doctor on the same day, a nurse was also sent to the ICU on the first day of the new year.\nZhaike Village currently grows tobacco as an industry, and its internal conflicts and disputes are relatively complicated. Some of the victims testified in court when the main culprit was sentenced to prison.\nThe murderer was determined when committing the crime, and almost all the injuries were fatal. He did not intend to leave anyone alive.","images":"","videos":"","hasPublished":true},{"id":"1757189053575795100","name":"李老师不是你老师","createdDate":"2024-02-13 07:44:52","content":"How to talk about the White Paper Movement openly in China without being blocked: Stigmatization is enough","images":"/tweet/image/whyyoutouzhele/2024/02/13/1757189053575795100_0.jpg","videos":"","hasPublished":true},{"id":"1757195077619691725","name":"李老师不是你老师","createdDate":"2024-02-13 08:08:48","content":"Shanghai White Paper Protests Documentary/Director PLATO","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/13/1757195077619691725_0.jpg","hasPublished":true},{"id":"1757195241298210886","name":"李老师不是你老师","createdDate":"2024-02-13 08:09:27","content":"Since you want to stigmatize me, I will let more people know.","images":"","videos":"","hasPublished":true},{"id":"1757268361757807000","name":"李老师不是你老师","createdDate":"2024-02-13 13:00:00","content":"❤ ","images":"/tweet/image/whyyoutouzhele/2024/02/13/1757268361757807000_0.jpg","videos":"","hasPublished":true},{"id":"1757349695758762436","name":"李老师不是你老师","createdDate":"2024-02-13 18:23:12","content":"On February 13, Ren County, Xingtai. It was reported online that an explosion occurred in Building 9, Jinwan Mengdu, Xingjiawan Community. According to the video circulated online, the explosion occurred at 7:44 in the morning. The impact of the explosion caused serious damage to the surface of the residential building, and the glass in the residents' homes was also shattered. The scene was a mess with bricks and tiles all over the ground.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/13/1757349695758762436_0.jpg","hasPublished":true},{"id":"1757349963518898659","name":"李老师不是你老师","createdDate":"2024-02-13 18:24:15","content":"On the morning of the 13th, the staff of Xingtai City Emergency Management Bureau said that the leaders of relevant departments and personnel from various departments have rushed to the scene for rescue. The staff of Renze District Emergency Management Bureau said that rescue work is underway. The cause of the accident and the casualties are under investigation.","images":"/tweet/image/whyyoutouzhele/2024/02/13/1757349963518898659_0.jpg,/tweet/image/whyyoutouzhele/2024/02/13/1757349963518898659_1.jpg","videos":"","hasPublished":true},{"id":"1757358091371257966","name":"李老师不是你老师","createdDate":"2024-02-13 18:56:33","content":"On February 12, in the latest episode of \"World Football\" yesterday, the opening shot of Messi holding the World Cup was replaced by the shot of German captain Lahm holding the cup. \nBut then netizens discovered that Lahm had publicly criticized China's human rights issues.","images":"/tweet/image/whyyoutouzhele/2024/02/13/1757358091371257966_0.jpg,/tweet/image/whyyoutouzhele/2024/02/13/1757358091371257966_1.jpg,/tweet/image/whyyoutouzhele/2024/02/13/1757358091371257966_2.jpg,/tweet/image/whyyoutouzhele/2024/02/13/1757358091371257966_3.jpg","videos":"","hasPublished":true},{"id":"1757385975653671011","name":"李老师不是你老师","createdDate":"2024-02-13 20:47:21","content":"Netizen contribution\nOn the evening of the first day of the Chinese New Year, a fire broke out at Tianyi Academy in Nancheng County, Jiangxi Province. When the owner tried to save himself, he found that there was no water in the fire hydrant, which almost caused a disaster.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/13/1757385975653671011_0.jpg","hasPublished":true},{"id":"1757407022159430075","name":"李老师不是你老师","createdDate":"2024-02-13 22:10:59","content":"At present, Linyi District has begun to urgently collect information on migrant population outside the five districts of Linyi. People speculate that it is related to the case in Zhaike Village, Ju County.","images":"/tweet/image/whyyoutouzhele/2024/02/13/1757407022159430075_0.jpg","videos":"","hasPublished":true},{"id":"1757432760753336743","name":"李老师不是你老师","createdDate":"2024-02-13 23:53:16","content":"The five districts in the picture refer to Lanshan District, Luozhuang District, Hedong District, Linyi High-tech Industrial Development Zone, and Linyi Economic and Technological Development Zone.","images":"","videos":"","hasPublished":true}]