[{"id":"1860816554264277196","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 06:47:44","content":"User contribution: Cooperation agreement for daily-paid riders in Kunshan, Jiangsu","hasFullContentTranslated":true,"hasPublished":true},{"id":"1860927372167631248","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 14:06:28","content":"The school said the teacher beat and kicked the student in public at the request of the parents. \"The student repeatedly violated discipline and talked back to the teacher.\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860938164350898318","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 14:51:56","content":"On November 25, the staff of the Shantou Municipal Emergency Management Bureau refuted the rumor: all shops were open for business during the fire inspection, and the inspection would not affect their normal work. There were no large-scale closures of shops. However, local people in Shantou in the comment section complained that they could not find a place to eat, and some people even went hungry for two meals. Netizens joked: 99% of the \"individual\" shops were closed.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860941147432202699","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 15:07:09","content":"On November 23, a man in Shantou sent a message in a WeChat group saying: \"Some businesses in Chenghai District were fined due to inspections by relevant departments.\" The police determined that the man was suspected of spreading rumors and imposed administrative penalties. However, according to Figure 2, the Shantou Fire Department's article stated: A processing factory in Chenghai District was found to have people living in the factory illegally during a fire inspection on November 21, and was ordered to suspend production and business and fined. This inspection is suspected to be a local self-inspection before the national inspection on the 23rd of this month.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860945980163789171","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 15:22:22","content":"On the morning of November 23, at the sales office of Phase 3 of Yunyue Xiaoyuan in the New Town of Qingdao High-tech Zone, several people who seemed to be real estate sales staff were holding up a banner to demand their wages. The banner read \"Unscrupulous profiteers, return my hard-earned money.\" There was also a small loudspeaker next to it, shouting \"Unscrupulous profiteers, pay your debts and return our commissions.\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860960221595906265","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 16:22:57","content":"Porsche officials said: This was done by the partner project team and they have reached a settlement with the driver under the mediation of the police (Figure 2 is the description of the incident given by Porsche officials)","hasFullContentTranslated":true,"hasPublished":false}]