[{"id":"1860816554264277196","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 06:47:44","content":"User contribution: Cooperation agreement for daily-paid riders in Kunshan, Jiangsu","hasFullContentTranslated":true,"hasPublished":true},{"id":"1860927372167631248","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 14:06:28","content":"The school said the teacher beat and kicked the student in public at the request of the parents. \"The student repeatedly violated discipline and talked back to the teacher.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1860938164350898318","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 14:51:56","content":"On November 25, the staff of the Shantou Municipal Emergency Management Bureau refuted the rumor: all shops were open for business during the fire inspection, and the inspection would not affect their normal work. There were no large-scale closures of shops. However, local people in Shantou in the comment section complained that they could not find a place to eat, and some people even went hungry for two meals. Netizens joked: 99% of the \"individual\" shops were closed.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1860941147432202699","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 15:07:09","content":"On November 23, a man in Shantou sent a message in a WeChat group saying: \"Some businesses in Chenghai District were fined due to inspections by relevant departments.\" The police determined that the man was suspected of spreading rumors and imposed administrative penalties. However, according to Figure 2, the Shantou Fire Department's article stated: A processing factory in Chenghai District was found to have people living in the factory illegally during a fire inspection on November 21, and was ordered to suspend production and business and fined. This inspection is suspected to be a local self-inspection before the national inspection on the 23rd of this month.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1860945980163789171","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 15:22:22","content":"On the morning of November 23, at the sales office of Phase 3 of Yunyue Xiaoyuan in the New Town of Qingdao High-tech Zone, several people who seemed to be real estate sales staff were holding up a banner to demand their wages. The banner read \"Unscrupulous profiteers, return my hard-earned money.\" There was also a small loudspeaker next to it, shouting \"Unscrupulous profiteers, pay your debts and return our commissions.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1860960221595906265","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 16:22:57","content":"Porsche officials said: This was done by the partner project team and they have reached a settlement with the driver under the mediation of the police (Figure 2 is the description of the incident given by Porsche officials)","hasFullContentTranslated":true,"hasPublished":true},{"id":"1860988732163428482","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 18:08:55","content":"On the morning of November 20, a woman in Fushun, Liaoning Province, held a banner to report that a deputy director had sexually harassed and disrupted a military marriage. The woman held a loudspeaker and held a white banner to report under her real name that Mi, deputy director of the Fushun Municipal Market Supervision Administration, as a public official, had sexually harassed her for a long time, disrupted a military marriage, and caused serious impact on her family, life, and psychology. She urged the relevant leaders of the Market Supervision Administration to deal with the matter seriously.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1860993335781151171","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 18:39:15","content":"Details: After the worker returned my hard-earned money, he drew a turtle bastard behind it?","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861007966004298207","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 19:24:43","content":"A girl from Shandong Zibo Vocational College called 120 because of respiratory alkalosis (usually caused by hyperventilation). The school's female student on duty refused to let the 120 emergency personnel and the uncle of the victim go upstairs to rescue her because they were both men. She called the dormitory manager for help, but the manager praised the girl on duty for doing a good job. Afterwards, the girl who called for help was asked by the school to delete the post: \"Because the school is going to be upgraded to a university, it will have a bad impact.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861014678807466374","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 19:55:04","content":"Recently, a woman in Huaihua, Hunan, reported that the village secretary beat her 72-year-old father to the point of cerebral infarction and hospitalization. On November 25, the local town government responded that the woman's statement was untrue and the beginning and the end of the video were cut off. The police have been notified, and the village secretary has not been suspended or punished by the party discipline.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861019334031921425","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 20:10:17","content":"On November 24, a student at Guangdong Ecological Vocational College asked for leave because his family member was critically ill. He begged the dormitory manager to open the door in the early morning but to no avail, and he was unable to see his family member for the last time.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861024845972340968","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 20:40:43","content":"Supplementary video: After the police set up the awning, the 120 ambulance still did not send the victims lying on the ground to the hospital.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861026599896072434","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 20:40:48","content":"Ping An launches 996 Worry-free Struggle Insurance. The slogan is: \"No need to work overtime, get a late night insurance to fuel your dream.\" It's true - escort your life","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861031562722074846","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 21:11:09","content":"On November 23, Tsai Ing-wen pointed out the direction for Xi Jinping at the Halifax International Security Forum.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861033114350375229","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 21:11:15","content":"Netizens contributed November 25, the current situation of Urumqi Middle Road","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861037818362937816","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 21:26:28","content":"On November 25, at Sichuan University of Light Industry, parents protested their rights by holding up a banner saying, \"Sichuan University of Light Industry instigated students to commit crimes and forced my son to death.\" A special police bus was dispatched to the scene, and the parents were taken away.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861040847653134783","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 21:41:41","content":"Former Chinese gymnastics world champion Wu Liufang's Douyin account 56senior was banned from following and a large number of her videos were deleted. Her junior sister, gymnastics Olympic champion Guan Chenchen, had a dispute with 56senior on Douyin over the content of the videos, and Guan Chenchen believed that these videos were discrediting gymnastics. On November 23, Wu Liufang apologized to netizens on live broadcast, but it turned out to be a blessing in disguise, helping her gain 2 million followers in two days.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861042774797435121","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 21:56:55","content":"Chinese sports have long lacked life security for retired athletes, especially in unpopular sports such as gymnastics and weightlifting. Even among Olympic champions, many retired athletes have to sell their medals to survive, not to mention the city and provincial teams that failed to enter the Olympics, or the athletes who died of injuries on the way to becoming champions.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861053922799960556","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 22:27:15","content":"","hasPublished":false},{"id":"1861054350258213074","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 22:42:28","content":"","hasPublished":false},{"id":"1861054415194538183","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 22:42:34","content":"","hasPublished":false},{"id":"1861054508316455283","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 22:42:40","content":"","hasPublished":false},{"id":"1861054615338336671","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 22:42:45","content":"","hasPublished":false},{"id":"1861054821165322718","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 22:42:51","content":"","hasPublished":false},{"id":"1861054897895936134","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 22:42:57","content":"","hasPublished":false},{"id":"1861060321982431370","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 22:58:10","content":"November 25th is called \"Chinese Thanksgiving Day\" by Chinese netizens to commemorate Mao Zedong's son Mao Anying who died in the Korean battlefield, so as to prevent China from following the hereditary path similar to North Korea. On that day, many official media published content related to egg fried rice, which triggered ridicule from netizens.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1861060472163672544","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-25 22:58:16","content":"RT @badiucao: On the second anniversary of the White Paper Movement, I was invited to work with Amnesty International @amnestychinese to draw portraits of Uyghur college student #Kamilai, Uyghur rapper #Yashar, and the director of the documentary \"Urumqi Middle Road\" #ChenPinlin to show support for them and the many brave people who have been arrested, harassed, and persecuted by the Chinese Communist Party authorities because of this movement. ✊The se…","hasFullContentTranslated":true,"hasPublished":false}]