[{"id":"1746578581361201274","name":"李老师不是你老师","createdDate":"2024-01-15 01:02:38","content":"On the 14th, after the news that Chen Si earned 1.02 million yuan in three years as a food deliveryman went viral, a food deliveryman in Shanghai released a list of that month, which did not include his name, suspecting that the news was fake.\nThen it was reported online that food deliverymen in Shanghai began to attack Chen Si, and photos of him being beaten and bleeding from the nose were circulated.","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746578581361201274_0.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746578581361201274_1.jpg","videos":"","hasPublished":true},{"id":"1746635025141870940","name":"李老师不是你老师","createdDate":"2024-01-15 04:46:55","content":"Later, the Henan Department of Culture and Tourism responded that it had not sent any text messages.","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746635025141870940_0.jpg","videos":"","hasPublished":true},{"id":"1746636253997433190","name":"李老师不是你老师","createdDate":"2024-01-15 04:51:48","content":"On January 14, a Weibo blogger asked: If you were a compatriot from Taiwan Province, would you be willing to return?\nAlmost all the comments expressed unwillingness.","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746636253997433190_0.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746636253997433190_1.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746636253997433190_2.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746636253997433190_3.jpg","videos":"","hasPublished":true},{"id":"1746636930886852742","name":"李老师不是你老师","createdDate":"2024-01-15 04:54:29","content":"https://t.co/L761nQR7O8","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746636930886852742_0.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746636930886852742_1.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746636930886852742_2.jpg","videos":"","hasPublished":true},{"id":"1746681937710727661","name":"李老师不是你老师","createdDate":"2024-01-15 07:53:20","content":"@jun17630250 ？","images":"","videos":"","hasPublished":true},{"id":"1746692462892949562","name":"李老师不是你老师","createdDate":"2024-01-15 08:35:09","content":"The full text of \"Death of Suspect Sun Renze\" by Wang Heyan of Caixin was deleted from the entire network. During the trial, Ren Tingting cried several times at her desk; before the adjournment, Ren Tingting suddenly stood up from the prosecution seat and shouted to the eight suspects below the stage: \"Murderers, I will not forgive you.\" There was a commotion in the defendant's seat, and the chief judge hurriedly spoke out to stop Ren Tingting, who is over 50 years old and lives in Yining City, Ili Kazakh Autonomous Prefecture, Xinjiang Autonomous Region. Her husband was a senior policeman, but later...","images":"","videos":"","hasPublished":true},{"id":"1746692558678311238","name":"李老师不是你老师","createdDate":"2024-01-15 08:35:32","content":"Bai Zhenhua said that he reported the Sun Renze incident to the leaders of the Yili Prefecture Public Security Bureau, and it was the bureau leaders who suggested making a fake video to deal with the investigation by the discipline inspection department. According to this instruction, he notified the deputy director of Huocheng County Detention Center, Chai, to provide the filming site, and asked Cui Liang, who had a body shape similar to Sun Renze, to cover his head with a black mask and pretend to be Sun Renze, pretending to enter the detention center normally, and made a fake video. However, the bureau leaders denied that they knew about it in the transcript. …","images":"","videos":"","hasPublished":true},{"id":"1746812172901011498","name":"李老师不是你老师","createdDate":"2024-01-15 16:30:50","content":"On January 14, at an animation exhibition in Hangzhou, Zhejiang, several girls were sprayed with fire extinguishers by a man while lighting fairy sticks to take photos. The man then left the fire extinguisher and walked away.\nThe police at the scene said that they (park security) are responsible for safety management. We don’t care about how they handle it. They are also for everyone’s safety.\nOn the 15th, the organizer said that fireworks are prohibited in the park. The identity of the man is not clear yet, and the police have been called.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/15/1746812172901011498_0.jpg","hasPublished":true},{"id":"1746812537499222517","name":"李老师不是你老师","createdDate":"2024-01-15 16:32:17","content":"On January 13, Xichang, Sichuan. A bus was traveling from the urban area of Xichang City to Anning Town when it suddenly lost control and rushed towards the guardrail and villagers. The video showed that the guardrail was hit and someone fell to the ground.\nThe accident caused one death and four injuries.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/15/1746812537499222517_0.jpg","hasPublished":true},{"id":"1746813089498996787","name":"李老师不是你老师","createdDate":"2024-01-15 16:34:29","content":"On January 14, in Dongbei Village, Liangying Town, Shantou, villagers came to the Dongbei Village Party and Mass Service Center to defend their rights because the government’s ban on raising poultry caused dissatisfaction among residents.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/15/1746813089498996787_0.jpg","hasPublished":true},{"id":"1746815201310015902","name":"李老师不是你老师","createdDate":"2024-01-15 16:42:52","content":"On January 15, Chen Si refuted the rumor that the photo of him being beaten was a picture of him getting angry and bleeding from his nose. The restaurant owner gave him a bowl of water to wash it off on the roadside. It was not a recent incident, and it was not a case of being beaten.\nThe contributor said that it was true that he earned 1 million yuan. He drove 18 hours a day. In order to prevent the riders from being overworked, Meituan limited the number of hours to 12 a day, so he continued to drive for Ele.me. Now the Internet is questioning his income because it is 5 yuan per order, which is not enough. But in fact, in addition to the delivery fee for each order, the riders also receive bonuses for rushing orders and weather subsidies, which can exceed the delivery fee itself.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/15/1746815201310015902_0.jpg","hasPublished":true},{"id":"1746818257166700920","name":"李老师不是你老师","createdDate":"2024-01-15 16:55:01","content":"On January 15, the owner of Longhu Lake in Linyi, Shandong was arrested for defending his rights","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/15/1746818257166700920_0.jpg","hasPublished":true},{"id":"1746829877901226200","name":"李老师不是你老师","createdDate":"2024-01-15 17:41:12","content":"On January 15, the Supreme People's Court required that the judicial documents be put online in an increased effort. Documents that have the function of guiding the legal system, educating, and warning should all be put online.\nAfter the news was released, netizens left comments in the comment area mocking\n\"It has transformed into a 30-minute selection of news\"\n\"It is just a selection of comments, and the cases are carefully selected\"","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746829877901226200_0.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746829877901226200_1.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746829877901226200_2.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746829877901226200_3.jpg","videos":"","hasPublished":true},{"id":"1746829910922957056","name":"李老师不是你老师","createdDate":"2024-01-15 17:41:19","content":"https://t.co/GHEklkvh4O","images":"","videos":"","hasPublished":true},{"id":"1746831514128580931","name":"李老师不是你老师","createdDate":"2024-01-15 17:47:42","content":"On January 15, a blogger posted: Why can't the mafia manage high technology? The reason why the mafia can't manage high technology is that totalitarian politics is a very simple form of political organization. If a mafia enters the field of mechanical production, they will only have two results. One is that they can't do it at all and finally go bankrupt, and the other is to delegate power to professionals, and finally the actual power is controlled by professionals.\nIn complex industries, the reliance on knowledge will make the simple power operation of the mafia difficult, and it is too complicated to manage.\nAfter the blog post was published, it has been forwarded more than a thousand times, but there are only two messages in the comment area.","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746831514128580931_0.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746831514128580931_1.jpg","videos":"","hasPublished":true},{"id":"1746835908224000393","name":"李老师不是你老师","createdDate":"2024-01-15 18:05:09","content":"Netizens said that the death of detainees is not uncommon, and these are only those that have been reported and searchable.","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746835908224000393_0.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746835908224000393_1.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746835908224000393_2.jpg","videos":"","hasPublished":true},{"id":"1746840825026199659","name":"李老师不是你老师","createdDate":"2024-01-15 18:24:42","content":"Jiangsu Pension Fund Follow-up","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746840825026199659_0.jpg","videos":"","hasPublished":true},{"id":"1746848042156724552","name":"李老师不是你老师","createdDate":"2024-01-15 18:53:22","content":"On January 14, in Chengdu, Sichuan, a netizen posted a video saying that he was a third-year graduate student. When looking for a job, he accidentally found that he had 4 companies under his name. He suspected that the facial recognition video in 2019 was stolen by others. Several registered companies issued invoices of 5 million, which made it impossible to find a job and had a great impact on him.\nThe Industrial and Commercial Bureau said that the company could not be revoked.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/15/1746848042156724552_0.jpg","hasPublished":true},{"id":"1746867055121334659","name":"李老师不是你老师","createdDate":"2024-01-15 20:08:55","content":"On January 14, in the Shanghai Xiangyu Transportation Control Zhonghuan Yunyue Mansion community, owners gathered at the sales office and shouted for their houses to be moved out due to shoddy construction, cutting corners and poor housing quality.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/15/1746867055121334659_0.jpg","hasPublished":true},{"id":"1746873563926176073","name":"李老师不是你老师","createdDate":"2024-01-15 20:34:47","content":"Below a news report that the Tokyo stock market once broke through 36,000 points:","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746873563926176073_0.jpg","videos":"","hasPublished":true},{"id":"1746875566257537390","name":"李老师不是你老师","createdDate":"2024-01-15 20:42:45","content":"The delivery guy shared his views on \"making 1.02 million in three years delivering food\" and his own personal experience: Many people don't know much about the lower classes in the city. I hope my experience can help them understand more.\n\nMr. Li, hello, I saw your recent video of Chen Si refuting rumors. Let me explain to you and other friends what I know about food delivery.\n\nFirst, there are several delivery platforms:…","images":"","videos":"","hasPublished":true},{"id":"1746877495268286577","name":"李老师不是你老师","createdDate":"2024-01-15 20:50:24","content":"January 14, Tieling City, Liaoning Province. Hongye Yuefu project owes workers wages, and workers hold banners to demand wages","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/15/1746877495268286577_0.jpg","hasPublished":true},{"id":"1746879971434397983","name":"李老师不是你老师","createdDate":"2024-01-15 21:00:15","content":"Netizens added follow-up: Today, I went to the place where the old man rode an electric tricycle to Tiananmen Square to rush the tower. I briefly visited and investigated, and consulted the elderly living nearby. According to the local elderly, the police began to set up checkpoints at major intersections in early January, and also went into the alleys to confiscate the elderly's unlicensed mobility scooters. They were all forcibly recovered and were given a few hundred yuan afterwards. As of now, the elderly mobility scooters running on the streets and parked in the alleys are basically elderly mobility scooters with disabled motorcycle license plates. Unlicensed elderly mobility scooters are almost extinct.\nIn fact, the one rushing Tiananmen Square seemed to be photographed in the video. A white disabled motorcycle was placed on the side of the front windshield for photos, but Chang'an Avenue originally did not allow tricycles to drive, so it should have entered by mistake, not deliberately rushing the tower.\nThe elderly mobility scooter in the video drove from East Chang'an Avenue to the east side of the square on the east side of Tiananmen Square and drove towards the front gate.\nMany express delivery and take-out delivery services will avoid inspection by passing quickly when they find that they have violated the rules.\nAt present, except for a few unlicensed old scooters in the alleys, the rest are almost all old scooters who ride disabled motorcycles to take pictures. At present, the police and urban management in the area around Tiananmen Square have not strengthened the control of the registered old scooters. Basically, that's it.","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746879971434397983_0.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746879971434397983_1.jpg","videos":"","hasPublished":true},{"id":"1746881090734678193","name":"李老师不是你老师","createdDate":"2024-01-15 21:04:42","content":"On January 15, a netizen visited the site and found that the Beijing Xiaoqing River Bridge, which was destroyed by the flood during the Beijing rainstorm on July 31 last year, has not yet been repaired.","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746881090734678193_0.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746881090734678193_1.jpg","videos":"","hasPublished":true},{"id":"1746892780402561101","name":"李老师不是你老师","createdDate":"2024-01-15 21:51:09","content":"On January 14, a huge black smoke ring appeared and floated in the air above Xingshuping Village, Yaoqu Town, Tongchuan City, Shaanxi Province.\nThe Tongchuan Yaozhou District Emergency Management Bureau said that the cause of the smoke ring is not clear at present and no accident report has been received. The staff said they will conduct further verification.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/15/1746892780402561101_0.jpg","hasPublished":true},{"id":"1746906193514422598","name":"李老师不是你老师","createdDate":"2024-01-15 22:44:27","content":"On January 14, many media outlets published an article titled \"Hide in the library, they \"pretend\" to go to work\"\nIt tells the story of how, in the current economic downturn, many people who have suffered salary cuts and layoffs, or who have voluntarily \"quit\" their jobs, in order to hide their unemployment dilemma from their families, leave home at work every morning, carrying briefcases or backpacks and computers, driving or squeezing into the subway as usual, but their destination is not the company where they work, but staying in the library.","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746906193514422598_1.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746906193514422598_2.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746906193514422598_3.jpg","videos":"","hasPublished":true},{"id":"1746920239760044505","name":"李老师不是你老师","createdDate":"2024-01-15 23:40:16","content":"Netizens added","images":"/tweet/image/whyyoutouzhele/2024/01/15/1746920239760044505_0.jpg,/tweet/image/whyyoutouzhele/2024/01/15/1746920239760044505_1.jpg","videos":"","hasPublished":true}]