[{"id":"1864703036355989746","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-06 00:07:03","content":"On December 4, Shangqiu, Henan. The owners of Greenland International Exhibition City Phase 5 gathered at the gate to defend their rights. That night, the property management guarded the gate and did not allow the owners' cars to enter or leave. The gate of the community was full of cars. It is understood that the project had illegally misappropriated the owners' maintenance fund and forced the owners to buy parking spaces even when the garage was sealed by the court. The garage was not cleaned and there was a water seepage problem. There were even multiple cases where the security guards deliberately used the gate to smash the owners' cars.","images":"/tweet/image/whyyoutouzhele/2024/12/06/1864703036355989746_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/12/06/1864703036355989746_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864707376592666773","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-06 00:24:17","content":"December 4 (Release), Nanchang, Jiangxi. A family member posted a video saying that his son Gan Huitao had a craniotomy at the Second Affiliated Hospital of Nanchang University. The doctor privately processed the cut skull and sold it to a pharmaceutical company for use as transplant material. \"Some pharmaceutical companies even steal corpses to get skulls.\"","images":"/tweet/image/whyyoutouzhele/2024/12/06/1864707376592666773_0.jpg,/tweet/image/whyyoutouzhele/2024/12/06/1864707376592666773_1.jpg,/tweet/image/whyyoutouzhele/2024/12/06/1864707376592666773_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864719482083537209","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-06 01:12:23","content":"The French political arena was shaken, and the extreme left and extreme right united to defect. On December 4, the French National Assembly voted on a motion of no confidence in Prime Minister Barnier's government. The result was 331 votes in favor, exceeding the absolute majority of the National Assembly required for the motion, which was 289 votes. Barnier's government was overthrown. Two hours later, Macron will deliver a national speech.","images":"/tweet/image/whyyoutouzhele/2024/12/06/1864719482083537209_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1864721789949014505","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-06 01:21:34","content":"The French political arena was shaken, with the extreme left and extreme right joining forces to overthrow the government. On December 4, the French National Assembly voted on a motion of no confidence in Prime Minister Barnier's government, with 331 votes in favor, exceeding the absolute majority of the National Assembly required for the motion, which is 289 votes. Barnier's government was overthrown. Two hours later, Macron will deliver a national speech.","images":"/tweet/image/whyyoutouzhele/2024/12/06/1864721789949014505_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1864730936182440365","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-06 01:57:54","content":"The latest news is that French President Macron will not announce the next prime minister in his televised speech tonight.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":false}]