[
  {
    "id": "1861452550408687717",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 01:01:23",
    "content": "Recently, in Zhengzhou, Henan, villagers in Zhangzhuang Village knelt and kowtowed outside the village party and mass service center to defend their rights because they were dissatisfied with the demolition compensation given by the government.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861436361389355198",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 24:00:31",
    "content": "On November 25, the Global Times published an article: Sino-Japanese relations can only improve if we take action. A big V blogger replied with an \"oh\" and the system showed: This content contains illegal information and is currently not publicly visible. Netizens responded: It is a crime to applaud without enthusiasm.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861441267579920632",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 24:15:44",
    "content": "On November 25, in Guangzhou, Guangdong, Zheng Yanxiong, director of the Liaison Office of the Central People's Government in Hong Kong, said at a cooperation and exchange meeting: Under the leadership of Xi Jinping and the Party Central Committee, Hong Kong, which has suffered so much, has finally taken on the appearance of \"Hong Kong, China\".",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861446256993935722",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 24:30:57",
    "content": "On November 26, Tencent announced that the Nintendo Switch in China will gradually stop the Nintendo e-store and other network-related operating services from March 31, 2026 to May 15, 2026. It is reported that the Chinese version of Switch was officially released in 2019.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861449905300234422",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 24:46:10",
    "content": "November 25, Zhengzhou, Henan. Gongzhai Village in Huiji District was demolished, and the authorities compensated the villagers with housing coupons worth 6,000 yuan per square meter, but the local housing price is more than 12,000 yuan. The compensation the villagers received was not enough to buy a new house, and they had to pay out of pocket. Dissatisfied villagers gathered in front of the district government to defend their rights.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861477487202509156",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 02:32:14",
    "content": "RT @whyyoutouzhele: Netizen submission \"Chengdu Wangping Street 20221127\" An eyewitness to the white paper movement on Chengdu Wangping Street on the night of November 27 last year witnessed the whole process of people mourning the Urumqi fire from gathering around, shouting slogans together to being violently cleared out. He made this video and hopes that more people can see it. https://t.c…",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861734255858213278",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 20:51:21",
    "content": "An email from BYD to its suppliers was circulated online, in which the email stated that market competition will become more intense in the next 25 years and asked suppliers to reduce prices by 10%. Subsequently, some suppliers responded and expressed strong dissatisfaction and protest, saying that BYD was exploiting suppliers and turning the value created by the Chinese people into cheap benefits for developed countries, and called on BYD to stop relying on exploitation to gain profits.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861736531410726979",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 20:51:26",
    "content": "November 27 (Release) Some netizens found that after the third child policy was relaxed, the content of the textbooks was also changed. 14-year textbook: Implementing family planning, controlling population size, and improving population quality is a long-term basic national policy of China. 24-year textbook: The country advocates childbearing at the right age and eugenics, and a couple can have three children.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861740693619917000",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 20:51:32",
    "content": "November 26 (Released) Two North Korean People's Army soldiers stationed in Kursk were wanted by Russian police for wanting to chat naked with minors. They asked a 15-year-old girl to show them her breasts while chatting online.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861752174969225470",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 20:51:37",
    "content": "November 26 (Released) Zhengzhou, Henan. At the second phase construction site of the Dongzhaohe Village and Chengcheng resettlement area, a team leader was killed with a knife by a worker who was asking for wages. The deceased, Li Xin, was 39 years old this year. In 2019, he undertook the steel bar production and other projects at a resettlement housing construction site in Huiji District. Because Zhengzhou No. 1 Construction Company owed wages, six workers in the team went to Li Xin, the head of the steel bar team, to ask for wages. Li Xin was unable to pay, and finally a worker killed the team leader Li Xin with a knife.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861758228012609696",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 21:06:51",
    "content": "November 27 (Released) Yuxinzhuang Village in Changping District, Beijing will demolish illegal apartments. Some residents said, \"If you don't give me money, I will exchange my life for yours\" and \"It's worth it even if 10 children are crushed on the road.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861761905112871070",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 21:22:04",
    "content": "Two years ago today, on November 27, 2022, an old man in Baoding, Hebei, who was confined at home due to the epidemic, roared: \"When the epidemic is over, you will all be judged by history!\" A blogger \"maliciously recalled\" this incident, and the Weibo post was subsequently deleted by the platform.",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1861762891327877439",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 21:37:17",
    "content": "Two years ago today, on November 27, 2022, an old man in Baoding, Hebei, who was confined at home due to the epidemic, roared: \"When the epidemic is over, you will all be judged by history!\" A blogger \"maliciously recalled\" this incident, and the Weibo post was subsequently deleted by the platform.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861765079651508486",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 21:37:22",
    "content": "Recently, Russian state television showed which European countries would be hit by nuclear weapons if the war between Russia and Ukraine intensified: Britain is at its most vulnerable period, and only a few missiles will cause the collapse of British civilization.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861771385795956882",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 22:07:43",
    "content": "On November 26, CCTV reporter Xu Dezhi released a video to refute the rumor, saying that \"there are no Chinese people being held hostage in Gaza at all.\" This statement caused dissatisfaction among netizens. Netizens responded: \"So as long as Hamas kills all the Chinese hostages, there will be no more hostages.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861777663591174470",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 22:22:56",
    "content": "On November 27, in Xingtai, Hebei, a woman posted a video saying that she went to the Industrial and Commercial Bank of China to withdraw 25,000 yuan because her husband was hospitalized. As a result, the bank kept verifying and asked which department her husband was hospitalized in. The woman said, \"It's hard to catch a fraudster, and ordinary people have to verify this and that when they withdraw money.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861782424470040977",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 22:53:16",
    "content": "Recently, in Jiangsu, the Internet exposed that Sinochem Fourteenth Construction Co., Ltd. owed workers wages. A woman hugged her leader's legs and begged: \"I beg you, please give us the wages. My family can't afford it. I'm not in good health and I have children at home.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861789031186808896",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 23:08:29",
    "content": "November 26, Shaanxi. A man posted a video saying that his child was bullied by his classmates and was beaten into a semi-vegetative state. He spent all his money to treat his child. The court ordered the other party to pay more than 1.64 million yuan in compensation, but the other party refused to pay. He applied to the court for compulsory execution but failed. He asked the foundation for help and asked for a certificate from the court, but the court refused to issue a certificate. The man said, \"This is obviously to force me to a dead end. Please bear witness to the netizens that I was forced to go to a dead end.\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861791678652420368",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 23:23:42",
    "content": "On November 26, a technology blogger complained about Huawei's newly released Hongmeng Next system: Bilibili crashed after about an hour of viewing, the photo album was stuck like a PPT, the system animation was full of loopholes, there were multiple BUGs, etc. \"I don't know what's so good about this system.\" At present, the video has been deleted.",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1861797440396882030",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-11-27 23:54:03",
    "content": "RT @whyyoutouzhele: Netizens contributed their own videos - \"The Lone Hero\"",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]