[{"id":"1861452550408687717","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-27 01:01:23","content":"Recently, in Zhengzhou, Henan, villagers in Zhangzhuang Village knelt and kowtowed outside the village party and mass service center to defend their rights because they were dissatisfied with the demolition compensation given by the government.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861436361389355198","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-27 24:00:31","content":"On November 25, the Global Times published an article: Sino-Japanese relations can only improve if we take action. A big V blogger replied with an \"oh\" and the system showed: This content contains illegal information and is currently not publicly visible. Netizens responded: It is a crime to applaud without enthusiasm.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861441267579920632","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-27 24:15:44","content":"On November 25, in Guangzhou, Guangdong, Zheng Yanxiong, director of the Liaison Office of the Central People's Government in Hong Kong, said at a cooperation and exchange meeting: Under the leadership of Xi Jinping and the Party Central Committee, Hong Kong, which has suffered so much, has finally taken on the appearance of \"Hong Kong, China\".","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861446256993935722","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-27 24:30:57","content":"On November 26, Tencent announced that the Nintendo Switch in China will gradually stop the Nintendo e-store and other network-related operating services from March 31, 2026 to May 15, 2026. It is reported that the Chinese version of Switch was officially released in 2019.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1861449905300234422","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-27 24:46:10","content":"November 25, Zhengzhou, Henan. Gongzhai Village in Huiji District was demolished, and the authorities compensated the villagers with housing coupons worth 6,000 yuan per square meter, but the local housing price is more than 12,000 yuan. The compensation the villagers received was not enough to buy a new house, and they had to pay out of pocket. Dissatisfied villagers gathered in front of the district government to defend their rights.","hasFullContentTranslated":true,"hasPublished":true}]