[{"id":"1734481014427185370","name":"李老师不是你老师","createdDate":"2023-12-12 15:51:13","content":"Shantou","images":"/tweet/image/whyyoutouzhele/2023/12/12/1734481014427185370_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/bULm52MC8H","accountId":"whyyoutouzhele"},{"id":"1734483999332946135","name":"李老师不是你老师","createdDate":"2023-12-12 16:03:05","content":"On December 12, every year when it snows, people often say \"Beijing turns into Beiping in seconds after the snow\", which inexplicably caused strong dissatisfaction among patriots, criticizing this as nostalgia for the Republic of China. As a result, the topic has been banned.","images":"/tweet/image/whyyoutouzhele/2023/12/12/1734483999332946135_0.jpg,/tweet/image/whyyoutouzhele/2023/12/12/1734483999332946135_1.jpg,/tweet/image/whyyoutouzhele/2023/12/12/1734483999332946135_2.jpg,/tweet/image/whyyoutouzhele/2023/12/12/1734483999332946135_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/W5NLPt8Pg4","accountId":"whyyoutouzhele"},{"id":"1734489449763942875","name":"李老师不是你老师","createdDate":"2023-12-12 16:24:44","content":"On December 12, the China Internet Information Office announced a one-month \"Clear and Bright\" campaign to rectify short videos.\nIt emphasizes rectifying rumors related to people's livelihood, fabricating plots to help vulnerable groups in society, spreading wrong ideas, inciting ethnic hatred or regional discrimination. Spreading wrong views on marriage and love, deliberately creating gender confrontation. Conveying wrong values, spreading wrong career views, advocating unscrupulous means and negative world-weariness, etc.\nAt the same time, it emphasizes optimizing the traffic mechanism, and cannot unilaterally use likes and forwarding rates as the basis for traffic distribution.","images":"/tweet/image/whyyoutouzhele/2023/12/12/1734489449763942875_0.jpg,/tweet/image/whyyoutouzhele/2023/12/12/1734489449763942875_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1734513108582818007","name":"李老师不是你老师","createdDate":"2023-12-12 17:58:45","content":"December 11, Shenzhen Longhua Bus Station.\nLocal law enforcement agencies began to clear out those gods sleeping on the streets.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/12/1734513108582818007_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/IDpMwfETGJ","accountId":"whyyoutouzhele"},{"id":"1734513487819198822","name":"李老师不是你老师","createdDate":"2023-12-12 18:00:15","content":"December 11, Shanghai. Police drive away homeless people living under bridges.\nThe person who posted the video claimed to be a patient with depression. He has been sleeping under the bridge for two years. His wife and children have passed away.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/12/1734513487819198822_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/IxvsEKlrjU","accountId":"whyyoutouzhele"},{"id":"1734513674784539124","name":"李老师不是你老师","createdDate":"2023-12-12 18:01:00","content":"Recently, many netizens posted videos saying that bus drivers in Liaoyang City have been owed wages for 9 months and have difficulty making ends meet. A reporter called the local Municipal Party Committee Propaganda Department, and the staff who answered the phone said: We will investigate and verify.\nOn December 11, many bus drivers told reporters that they had just been paid for February, but they were still owed several months' wages.","images":"/tweet/image/whyyoutouzhele/2023/12/12/1734513674784539124_0.jpg,/tweet/image/whyyoutouzhele/2023/12/12/1734513674784539124_1.jpg,/tweet/image/whyyoutouzhele/2023/12/12/1734513674784539124_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/k5JyOowvMe","accountId":"whyyoutouzhele"},{"id":"1734515479614542178","name":"李老师不是你老师","createdDate":"2023-12-12 18:08:10","content":"On December 11, in Dongguan, Guangdong, an eight-month pregnant woman traveled all the way from Jiangxi to Guangdong to ask for her salary. She confronted her boss for five hours, but in the end she did not get a single cent back.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/12/1734515479614542178_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/IQCuMEr6lX","accountId":"whyyoutouzhele"},{"id":"1734557038129172939","name":"李老师不是你老师","createdDate":"2023-12-12 20:53:19","content":"On December 12, the verdict of the Chengdu subway sneak shooting incident was announced.\nThe court ruled that the two women did not infringe the general personality rights of the man in question. The appeal of the man in question, He Moumou, was rejected.\nIn June 2023, Luo Moumou and Zeng Moumou mistakenly thought that He Moumou's \"shoe flash\" was a bright light from the camera on the subway, which then caused a dispute.\nAfter trial, the court held that, first of all, when the dispute occurred, Luo Moumou and Zeng Moumou mistakenly thought that the \"shoe flash\" was a bright light from the camera, and raised questions based on the maintenance of public interests and their own rights and interests, which was legitimate, but their behavior was inappropriate. At the same time, because the dispute occurred at night, there were not many pedestrians, and it did not attract the attention and discussion of passengers on the bus and pedestrians at the station. Although the misunderstanding incident had an impact on He Moumou, the scope of the impact was small. In view of the fact that after the police were called, Luo Moumou and Zeng Moumou had apologized on the spot in time, accepted the criticism and education of the police, and took the initiative to offer to bear the transportation expenses for remedy, the way of apology of the two was equivalent to the scope and degree of the misunderstanding.\n\nSecondly, after the dispute, Luo, Zeng, passengers on the bus, and pedestrians at the station did not spread the information on the Internet, media, or other social levels. The misunderstanding was known to the public and the media because He posted information on the Internet, which means that the subsequent impact of the behavior was caused by the information posted on the Internet by He. Therefore, the impact of the incident on the social public level should not be attributed to Luo and Zeng. Therefore, Luo and Zeng did not infringe on He's general personality rights.","images":"/tweet/image/whyyoutouzhele/2023/12/12/1734557038129172939_0.jpg,/tweet/image/whyyoutouzhele/2023/12/12/1734557038129172939_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1734575063158903273","name":"李老师不是你老师","createdDate":"2023-12-12 22:04:56","content":"On December 11, in Hangu Management District, Tangshan, Hebei, owners of Times Phase II and Phase III had not had property deeds after purchasing their homes for ten years. A large number of owners gathered in front of the government building and held banners to defend their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/12/1734575063158903273_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/SqY2VpsZF1","accountId":"whyyoutouzhele"}]