[
  {
    "id": "1641540932519460872",
    "name": "李老师不是你老师",
    "createdDate": "2023-03-31 04:40:31",
    "content": "Netizen contribution\nThere is a road in my hometown that has been dilapidated for decades. Recently, because Ma Ying-jeou was going back to his hometown to worship his ancestors, it was renovated in ten days. The locals are very grateful for Ma Ying-jeou's visit.",
    "images": "/tweet/image/whyyoutouzhele/2023/03/31/1641540932519460872_0.jpg,/tweet/image/whyyoutouzhele/2023/03/31/1641540932519460872_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Svbr2WsFaj",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1641561105867714562",
    "name": "李老师不是你老师",
    "createdDate": "2023-03-31 06:00:41",
    "content": "Forbes China reported that South Korean President Yoon Seok-yeol announced his assets, totaling about 7.7 billion won, equivalent to 40 million yuan. \nOf this, 7.16 billion won is in the name of his wife Kim Gun-hee, including deposits, residences, forest land, etc.",
    "images": "/tweet/image/whyyoutouzhele/2023/03/31/1641561105867714562_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/weI3IGGsXn",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1641616779372908544",
    "name": "李老师不是你老师",
    "createdDate": "2023-03-31 09:41:54",
    "content": "Subsequently, it was found that the possible reason was that a word was missing in the fifth edition of the article \"Unity and struggle are the only way for the Chinese people to create historic achievements\" that day.",
    "images": "/tweet/image/whyyoutouzhele/2023/03/31/1641616779372908544_0.jpg,/tweet/image/whyyoutouzhele/2023/03/31/1641616779372908544_1.jpg,/tweet/image/whyyoutouzhele/2023/03/31/1641616779372908544_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Gq036iB5sK",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1641817625570295812",
    "name": "李老师不是你老师",
    "createdDate": "2023-03-31 23:00:00",
    "content": "On March 31, China's Cybersecurity Review Office issued an announcement to conduct a cybersecurity review of Micron's products sold in China.",
    "images": "/tweet/image/whyyoutouzhele/2023/03/31/1641817625570295812_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/dJMsy0Nr7o",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1641826062144266240",
    "name": "李老师不是你老师",
    "createdDate": "2023-03-31 23:33:31",
    "content": "On March 31, Quan Woo-won, the grandson of former South Korean President Chun Doo-hwan, met with the families of the victims of the 1980 \"Gwangju Incident\" and knelt down to apologize on behalf of his grandfather.\nIt is reported that Quan Yuyuan has been making comments on social platforms in recent days, condemning his grandfather Quan Douhuan as a butcher and a criminal instead of a hero who protects the country.\nThe family's secret financial status was even disclosed, as well as family members suspected of corruption and bribery and other crimes. He also mentioned that he was able to study and work in the United States only because of his family's huge funds from unknown sources. In addition, he admitted that he had a history of drug abuse.\n\nThe \"Gwangju Incident\" was a democratic movement spontaneously organized by local citizens in Gwangju and Jeollanam-do, South Korea, from May 18 to 27, 1980. Army Lieutenant General Chun Doohuan, who held military power at the time, ordered the use of force to suppress the movement, resulting in a large number of casualties among civilians and students.\nDuring Chun Doo-hwan's presidential term, authorities framed the incident as an insurrection instigated by Communist sympathizers and thugs. However, with the development of Korean politics, this incident was vindicated in the 1990s.",
    "images": "/tweet/image/whyyoutouzhele/2023/03/31/1641826062144266240_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  }
]