[
  {
    "id": "1778492666419835116",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 02:37:49",
    "content": "In order to oppose the measures issued by Xiamen University on April 10 to ban food delivery riders from entering the campus and control electric vehicles on campus, on April 11, Xiamen University students issued a rights protection initiative online, calling on the whole school to jointly safeguard the interests of students. The article stated that if you want to truly safeguard the interests of students and make the school cancel unreasonable policies, you can't just pray. Students must take positive action and say \"no\" to unreasonable policies, so that leaders realize that harming the interests of the student group also has a price, so that it is possible to promote policies that are truly beneficial to students. As long as everyone makes a contribution, even if it is just to like and forward the voices and actions of other people's protests, it can promote students to safeguard their own rights.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778492666419835116_0.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778492666419835116_1.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778492666419835116_2.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778492724808745424",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 02:38:03",
    "content": "https://t.co/nGbQbsQlF7",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778492724808745424_0.jpg,",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1778503907091546153",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 03:22:29",
    "content": "On the 11th, Zhiji Auto sent an open letter of complaint to relevant national departments, saying that it had been subjected to organized cyberbullying.\nAnother screenshot of an employee circulated online said that the company did not force overtime, and accusing the company of exploiting employees was an insult to every employee.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778503907091546153_0.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778503907091546153_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778525231709388800",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 04:47:13",
    "content": "On the afternoon of April 11, a man in Pingyang, Zhejiang Province, attacked a traffic policeman with a hammer on the street. The video showed that a policeman's head was covered in blood.\nPingyang County Traffic Police said that the local police station is currently handling the incident. As for the traffic policeman's injuries and the cause of the incident, the relevant staff did not disclose.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778525231709388800_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778749091503030600",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 19:36:45",
    "content": "April 12, Qiaogang Town, Beihai, Guangxi. Some houses bought by returned overseas Chinese were demolished a few years ago. The government promised to give them rent or resettlement housing but has not yet fulfilled its promise. On that day, some overseas Chinese went to the door of the local government department to defend their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778749091503030600_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778750673011523680",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 19:43:02",
    "content": "On April 9, the XEV Youyao Automobile official account suddenly published a \"Letter to Shareholders\", which detailed several major crimes of the management. Including the management's sales fraud, chaotic management, and the company's insolvency, etc., and attached the signatures and handprints of all employees at the end.\nOn April 11, \"XEV Youyao Automobile\" issued an official statement saying that the official account was hacked, the information in the article was seriously inconsistent, and a report had been filed.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778750673011523680_0.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778750673011523680_1.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778750673011523680_2.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778760071192699295",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 20:20:23",
    "content": "On April 12, the Hangzhou police reported that the \"Qin Lang lost homework\" incident that had previously caused heated discussions was planned and fabricated by the Internet celebrity \"Mao Yibei\" and his colleagues, and administrative penalties have been imposed on the companies where the two work. During the Chinese New Year this year, the famous Internet celebrity \"Mao Yibei\" released a video saying that he picked up a primary school student's winter vacation homework discarded in the toilet on the streets of Paris. The incident caused heated discussions, but then many netizens questioned the authenticity of the incident, and many primary schools with the same name also stated that there was no student named \"Qin Lang\" in the school. But then she released another video saying that she had contacted the other party's mother and the matter was over. On April 12, after the police report, Mao Yibei released an apology video. He said that his legal awareness was weak and the incident was beyond his expectations. He would not create such eye-catching works in the future, and hoped that his peers would take it as a warning.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778760071192699295_0.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778760071192699295_1.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778760071192699295_0.jpg,/tweet/video/whyyoutouzhele/2024/04/12/1778760071192699295_1.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778763199266869275",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 20:32:49",
    "content": "On April 12, Sohu News published a commentary, denouncing various pseudo-inspirational stories about earning X million per month as insulting the readers' intelligence.\n\"This kind of pseudo-inspirational entrepreneurial news is not the so-called positive energy, nor can it inspire the people's entrepreneurial passion. On the contrary, it allows the public to see the absurdity of entrepreneurial propaganda and creates a crisis of trust.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778763199266869275_0.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778763199266869275_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778765632386847001",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 20:42:29",
    "content": "On April 12, Didi drivers in Shandong held banners on the roadside to protest against the platform's price cuts.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778765632386847001_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778765927749730377",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 20:43:39",
    "content": "On April 11, a message was widely circulated on Douyin that Didi drivers in Wuhan were calling for a general strike from April 26 to 28 to protest against the price cuts by the company and the platform.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778765927749730377_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778767828306329782",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 20:51:12",
    "content": "April 12, Tianjin. The 12-year school in the northern part of the Eco-City is unfinished. It is understood that most of the owners of the surrounding communities bought school district houses for their children to go to school. However, the project has been suspended for three years. It was originally scheduled to be put into use in September 2025, but it has not yet started. On the same day, the owners of the nearby communities came to the district government to defend their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778767828306329782_0.jpg,/tweet/video/whyyoutouzhele/2024/04/12/1778767828306329782_1.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778785282948465092",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 22:00:34",
    "content": "On April 12, the Zhengzhou Cyberspace Administration announced that it would hold talks with and criticize the self-media outlets that published articles that were pessimistic about the Zhengzhou property market.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778785282948465092_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778787994322764047",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 22:11:20",
    "content": "On April 12, a fire broke out in the distribution box of Building 6 of the male dormitory of Qingdao Huanghai College.\nAccording to students, at the time of the incident, student union members blocked the door and prevented them from leaving, and the fire escape was locked. Then the students kicked the door open to escape. The video shows that some students gathered on the eaves of the door and tried to jump down. A fire brigade set up a ladder to rescue the students.\nThat afternoon, the school issued a notice saying that it was not a fire, but a simulated fire drill, and prohibited students from spreading it on social media.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778787994322764047_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778788268294705248",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 22:12:26",
    "content": "https://t.co/sGqIJGsLqI",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778788268294705248_0.jpg,",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1778789101229002963",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 22:15:44",
    "content": "April 12, Yan'an, Shaanxi. Yi Music Fire Bar Restaurant owed workers wages, and workers gathered outside the store to demand their wages.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778789101229002963_0.jpg,/tweet/video/whyyoutouzhele/2024/04/12/1778789101229002963_1.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778790820415742000",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 22:22:34",
    "content": "On April 10, a man suddenly pulled out a knife and slit the throat of a passerby on the street in Ji'an, Jiangxi, injuring two people.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778790820415742000_0.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778790820415742000_1.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778790820415742000_2.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778790820415742000_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778791525373169837",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 22:25:22",
    "content": "On the evening of April 11, several people chased and hacked a man in white with knives and beat up a woman on the streets of Xinyang, Henan.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778791525373169837_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778796372692496473",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 22:44:38",
    "content": "April 11, Wuhan, Hubei. A netizen posted a video saying that the black sewage discharged by Changsheng Soda Factory all year round flowed into the residential area, causing a large number of villagers in Huangtupo Village to suffer from cancer.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778796372692496473_0.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778796372692496473_1.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778796372692496473_2.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778796372692496473_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778798307285860847",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 22:52:19",
    "content": "April 11, Beijing. A woman reported Bu Junpeng, chairman of Guochou Data Technology Co., Ltd., for sexually harassing her in the name of work. The woman said that since she started working, Bu Junpeng had repeatedly hinted that she was a mistress and even touched her thigh. After she refused, she was slandered by Bu Junpeng. This caused her to have a mental breakdown.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/12/1778798307285860847_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1778801605757866029",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 23:05:26",
    "content": "Recently, the blogger \"Dad Talks Science\" published an article saying that a reader reported to him that he was hospitalized for mercury poisoning after taking Tong Ren Tang's product \"Rendan\".\nAfter testing in a German laboratory, the reader found that the mercury content of Rendan reached 97,000 times the maximum limit of the European Union! The blogger also posted photos of the batch of products involved in Beijing Tong Ren Tang on his WeChat public account.\nOn the 12th, the blogger posted that the exposing article had been deleted, and revealed that there were more detailed data in hand, which would be released one after another.\nAnother medical blogger \"Dr. Kaixi\" also posted on the same day that after testing another batch of Rendan products in China, it was found that the mercury content was not low. It is recommended that everyone should not buy and take it without authorization.\nIt is understood that Rendan's main effect is to clear away heat and open the mind. It is made of thirteen medicinal materials such as cinnabar. Among them, cinnabar contains mercury. The Chinese Pharmacopoeia states that cinnabar is toxic and should not be taken in large quantities or in small quantities for a long time. It is forbidden for pregnant women and people with liver and kidney dysfunction. However, Beijing Tong...",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778801605757866029_0.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778801605757866029_1.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778801605757866029_2.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778801605757866029_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": false,
    "fullContent": "近日，博主“老爸讲科学”发文章称，有读者向他反映因服用同仁堂旗下产品“仁丹”后导致汞中毒入院。\n这名读者通过德国实验室检测后发现，仁丹的汞含量居然达到了欧盟最大限制的9.7万倍！博主还在其微信公众号上发布了北京同仁堂涉事批次产品照片。\n12日，该博主发文称，曝料文章已被删除，并透露手里还有更详细的数据，会陆续发出来。\n另一位医学博主“凯喜博士”当天也发文称，在国内检测另一批次的仁丹产品后，发现汞含量也不低。建议大家不要擅自购买服用。\n 据了解，仁丹功效主要为清暑开窍，由朱砂等十三味药材制成。其中朱砂含汞。中华药典中写明，朱砂有毒，不宜大量服用，也不宜少量久服，孕妇及肝肾功能不全禁用。不过北京同仁堂仁丹说明书中，并未特别提醒朱砂有毒。",
    "hasPublished": true
  },
  {
    "id": "1778805325992276344",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-12 23:20:12",
    "content": "On April 11, Chongqing's government affairs platform \"Yu Kuai Zheng\" announced that it would cancel its support for the iOS system. Chongqing's system employees will be forced to replace their Apple phones.\nThe incident triggered a lot of complaints from system employees on social platforms.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/12/1778805325992276344_0.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778805325992276344_1.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778805325992276344_2.jpg,/tweet/image/whyyoutouzhele/2024/04/12/1778805325992276344_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]