[
  {
    "id": "1739318936334713323",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 00:15:24",
    "content": "Some self-media reported that Qingdao Airlines suffered serious losses, and some internal employees said that they could no longer pay their salaries on time.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739318936334713323_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/TeYMuNeGvO",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739334885800595862",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 01:18:46",
    "content": "According to the Internet, on the evening of December 25, at the Mao Zedong Statue Square in Shaoshan, Hunan, some young people held up photos of Mao Zedong and red flags and shouted: \"We want socialism, we want real public ownership, we want Mao Zedong Thought, we don't want capitalism, we don't want big bureaucratic ownership, we don't want private ownership under the banner of Marxism-Leninism.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739334885800595862_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/4NDg7OpHii",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739592017850593441",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 18:20:31",
    "content": "On December 25, the victims of Changchun Guanqun went to the Changchun Nanguan District People's Procuratorate to defend their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739592017850593441_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Hj6KAdznKY",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739592370163703905",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 18:21:55",
    "content": "Contributed by netizens from Mayang Miao Autonomous County, Huaihua, Hunan",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739592370163703905_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/EW14NbECQM",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739612721581088788",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 19:42:47",
    "content": "On December 26, the owners of the unfinished building of Xi'an Fengdong New Town Greenland Lanting Mansion went to Minsheng Bank to defend their rights. They covered the door with A4 papers printed with insulting remarks, accusing Minsheng Bank of illegal lending and that 657 projects with a total of 558 million yuan in project funds had not been deposited into the supervision account.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739612721581088788_0.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739612721581088788_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/b0z59IPR7I",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739616517296140437",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 19:57:52",
    "content": "Royole Technology, the originator of foldable screen mobile phones, has owed wages for a year, with a total amount of more than 40 million yuan. Employees went on strike to demand wages. On December 25, at the Royole International Display Base in Longgang District, Shenzhen, about 50 Royole Technology employees gathered at the door of the base to strike for rights and demanded that the company pay wages. According to a Royole employee at the scene, the company currently has only about 200-300 employees, most of whom are engineers who maintain production line equipment, and the business is only basic screen assembly business, \"income is only enough to pay social security.\" Royole Technology is a fully flexible screen manufacturer. It claims that the innovative ultra-low temperature non-silicon process integration technology is the \"domestic light\" that breaks Samsung's monopoly.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739616517296140437_0.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739616517296140437_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739617262804271168",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:00:50",
    "content": "On December 25, the retrial of the \"case of a family of 18 villagers who privately built a floating bridge and was sentenced\" was pronounced. The Intermediate People's Court of Baicheng City, Jilin Province, publicly pronounced the retrial of the case of Huang Deyi and 18 others for provoking troubles, and upheld the conviction and sentencing of Huang Deyi and He Shuchun in accordance with the law. Huang Song, Huang Qiang, Huang Dejun, Huang Deyou, and Liu Yanhui were exempted from criminal punishment. Huang Yong, Huang Gang, Huang Wei, Liu Yanjie, He Shuyun, Zuo Qingzhi, Wu Fengqing, Long Li, Liu Haibo, Li Li, and Bian Guang were declared not guilty.\nOn December 31, 2019, the People's Court of Taonan City, Jilin Province sentenced Huang Deyi to two years in prison for the crime of provoking troubles, suspended for two years, and sentenced He Shuchun and 17 others to one year in prison, six months of detention, and three months of imprisonment, and announced suspended sentences at the same time.\nThe court found out after retrial that Huang Deyi and others illegally occupied the river without approval from the administrative authorities and built a bridge. In order to obtain illegal profits, they blocked and destroyed the access road and the old road in the river, causing some vehicles to fall into the pit and suffer property losses, making other vehicles unable or afraid to pass through the old road and forced to cross the river from the bridge involved in the case.\nHuang Deyi and others set up iron chains and ropes at the bridge head and took shifts all day to intercept passing vehicles and forcibly collect bridge tolls, which caused disputes and disputes many times. Huang Deyi and others built the bridge privately and refused to correct it after multiple administrative penalties. They continued to implement the above behavior knowing that it was illegal, ignored national laws and regulations and administrative penalties, and forcibly took other people's property many times, which seriously disrupted the social management order. This behavior has constituted the crime of provoking trouble. Huang Deyi played a major role in the joint crime and was the principal offender. The original judgment sentenced him appropriately and should be upheld. He Shuchun participated deeply and played a greater role. The original judgment sentenced him appropriately and should be upheld.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739617262804271168_0.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739617262804271168_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739618946750263388",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:07:32",
    "content": "On December 25, some netizens found that the B station and Douyin accounts of the recently popular \"Ding Pangzi Gold Medal Lecturer\" were both unavailable for follow, and it was suspected that they were soft-banned.\nThe main content of this blogger is to share the daily life of a homeless person in the United States and record the life of the lower class in the United States. Because of his humorous words and outstanding program effects, he has become popular in recent days and has sparked public discussion",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739618946750263388_1.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739618946750263388_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/0MHyTBm0cd",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739622039487463793",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:19:49",
    "content": "[There are about 964 million people in China with a monthly income of less than 2,000 yuan]\nOn December 26, well-known scholar Li Xunlei published an article in \"First Financial Weekly\" titled \"Is it easy to go up the mountain but difficult to go down? Looking at the economy from the demand side.\"\nThe topic once topped the hot search list, which mentioned: According to the survey data published by the Institute of China Income Distribution of Beijing Normal University in 2021, there are about 964 million people in my country with a monthly income of less than 2,000 yuan.\nAt present, the article has been deleted",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739622039487463793_0.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739622039487463793_1.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739622039487463793_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/07Ss8DTNoj",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739622172895719811",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:20:21",
    "content": "The full text can be found in the 404 Library:\n",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/CR0McddnLw",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739626512901460322",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:37:36",
    "content": "On December 25, in Handan, Hebei, the fire protection facilities in the Jindicheng community did not meet the standards, the pipes were broken, and there was no heating. A large number of owners held up banners to protect their rights. The staff who arrived later tore down the banners, which caused dissatisfaction among the owners. Fierce conflicts and shoving broke out between the owners and the staff.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739626512901460322_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/1EEI9xnliV",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739626581008466154",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:37:52",
    "content": "December 25, Shanxi: The photovoltaic industry of Erjian Group owed wages to migrant workers, and the workers held banners outside the company to protest their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739626581008466154_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/KokKZ20eGM",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739626704476201441",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:38:21",
    "content": "December 26, Nanning, Guangxi. Guangxi Construction Group Second Construction Engineering Co., Ltd. owed wages to migrant workers. Workers held banners to protest their rights and begged the government to take action for them.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739626704476201441_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/doek3KsF1E",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739627586076979218",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:41:51",
    "content": "December 26, Tangshan, Hebei. Hongkun Ideal City overdue delivery of houses, owners put up banners to protest their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739627586076979218_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/nw0FEsynRr",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739627965812494600",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:43:22",
    "content": "On the evening of December 25, in Ulanqab, Inner Mongolia, a road collapsed on the Ulanqab section of the Erguang Expressway, trapping several vehicles. That night, a total of six injured were transferred to the hospital, of which two were confirmed dead, another was transferred to the orthopedic department, and another was receiving treatment in the emergency department.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739627965812494600_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/I1ElhRLcYn",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739629893128777843",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:51:01",
    "content": "December 24, Hangzhou, Zhejiang. A man took a taxi and insulted the driver because the driver did not turn on the air conditioner, saying \"I just look down on outsiders like you\", \"I just have a sense of superiority\", \"You just don't work hard, why do you come to Hangzhou to drive?\" After the police arrived, the passenger cursed for a few more minutes and left without apologizing. The next day, the police were called again, and the passenger came to apologize, and then both parties signed a mediation agreement.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739629893128777843_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/gyJhSQ5bnn",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739630385451966581",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:52:59",
    "content": "Some netizens discovered that Tencent Sports changed the NBA's \"Christmas Battle\" to the \"Year-End Battle\"",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739630385451966581_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/jhKvGyAh9B",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739631162216042940",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:56:04",
    "content": "On December 26, at the gate of Hainan Sanya College, a parent held a sign at the gate for several days to look for her child who had been missing for three years.\nThe parent said that she said the local public security bureau had not filed a case, so she could not go through legal procedures. They had gone to various departments in the past three years but there was no way",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739631162216042940_0.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739631162216042940_1.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739631162216042940_2.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739631162216042940_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/UPtQDeFXoO",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739631460577865789",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 20:57:15",
    "content": "https://t.co/J9dKIEF0be",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739631460577865789_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/J9dKIEF0be",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739632283307364391",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:00:31",
    "content": "User contributions",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739632283307364391_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/lsdDFczjh4",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739632594155704553",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:01:45",
    "content": "At 11:56 on December 26, 2023, the driver of No. 368 bus on Beijing Third Ring Road suddenly fainted and rushed to the opposite lane. The crew immediately braked and stopped the vehicle after discovering it. The bus scraped against a private vehicle in the opposite lane. Two people on the bus were slightly injured, and no one on the private vehicle was found to be injured.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739632594155704553_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/MC0rLPOqrT",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739634214897664429",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:08:12",
    "content": "On December 25, a slogan was put up at the entrance of Pizhou Mingde Experimental Middle School: \"In China, today, there is no more 'Christmas'! Only 'Changjin Lake'\".\nIn today's era of comprehensive decoupling, with the state advancing and the private sector retreating, this sentence is about to become a symbol of the next era.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739634214897664429_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/xwJoKDh4tu",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739634855548199222",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:10:45",
    "content": "On December 26, Guangdong University of Foreign Studies\nA masked man stood at the second floor connection of the dormitory building, waving a banner that read \"Long Live Mao Zedong Thought\".",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739634855548199222_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/3ZaG38359V",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739636195842306434",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:16:04",
    "content": "Suining City Traditional Chinese Medicine Hospital in Sichuan Province: Doctors and nurses collectively jumped off a building to demand their wages because the hospital withheld their wages",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739636195842306434_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/BWb7dimDPL",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739637200394875075",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:20:04",
    "content": "On the afternoon of the 26th, the reporter contacted Suining Traditional Chinese Medicine Hospital to learn about the situation. An office staff member denied the online rumors of \"collective jumping off the building\" and \"wage arrears\", saying that these people were not jumping off the building and the hospital did not owe wages. However, as to why many medical staff sat by the window, she said that the hospital leaders were handling the matter and she was not clear about the specific situation. The hospital will explain the matter and the reporter can pay attention to the official response. …",
    "images": "",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739637985165910171",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:23:11",
    "content": "In-car footage\nIn the video, the driver tried his best to save the vehicle before passing out",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739637985165910171_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/DHG9n77zrP",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739638273318748667",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:24:19",
    "content": "The security guard then tore off the paper.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739638273318748667_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/qOFtH1BFw3",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739640088613540332",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:31:32",
    "content": "\"The real insult is still on CCTV\"\nOn December 26, CCTV-1's News 30-minute column, after reporting on the commemorative stamps commemorating the 130th anniversary of Comrade Mao Zedong's birth, immediately broadcast a special report on \"bacon\", using a long section to broadcast a news report about farmers making bacon to get rich, which is suspected of \"insulting Mao\".\nCurrently, CCTV has deleted the relevant video clips, but it has sparked discussion among Maoist groups.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739640088613540332_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/cTiLEr4Hk8",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739640147547734481",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:31:46",
    "content": "https://t.co/clT6lWWQin",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739640147547734481_0.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739640147547734481_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/clT6lWWQin",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739643102070018256",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 21:43:31",
    "content": "According to a 2019 survey of 70,000 representative samples randomly drawn linearly by Beijing Normal University, about 5.46 million people in the country have zero monthly income; 220 million people have a monthly income of less than 500 yuan; 420 million people have a monthly income of less than 800 yuan; 550 million people have a monthly income of less than 1,000 yuan; and 600 million people have a monthly income of less than 1,090 yuan.\nAmong them, the proportion of rural areas is as high as 75.6%, concentrated in the central and western regions\n, which is consistent with what Li Keqiang said before that 600 million people have a monthly income of 1,000 yuan.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739643102070018256_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/N3DsR81oC0",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739665108647780805",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 23:10:57",
    "content": "On December 26, a netizen broke the news that he applied for a job at a company and was offered \"points\" instead of wages. He said that if he accumulated \"3,000 points\" each month, he could exchange for one month's salary. Points that were not exchanged that month could be exchanged for multiples later, up to 2.5 times in the 36th month. The company responded that we are a startup company and will pay back wages after financing is in place.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739665108647780805_0.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739665108647780805_1.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739665108647780805_2.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739665108647780805_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Tcg3HkBrhS",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739669174622761386",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 23:27:07",
    "content": "On December 26, the debris of a rocket booster fell into Baise City, Guangxi. The picture shows that the debris fell very close to residential houses and power lines. Previously, the surrounding counties and towns issued a safety evacuation notice.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/26/1739669174622761386_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/luC19xglT2",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739669564005199905",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 23:28:40",
    "content": "https://t.co/g6F651fA1G",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739669564005199905_0.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739669564005199905_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/g6F651fA1G",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739672947936174188",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-26 23:42:07",
    "content": "At present, the old and new patriotic big Vs on Weibo have a big debate of \"Christmas VS Changjin Lake\".\nThe old generation of patriotic big Vs are gradually being driven out of the historical stage by the extreme patriotic big Vs of the new era because they are not extreme enough.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/26/1739672947936174188_0.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739672947936174188_1.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739672947936174188_2.jpg,/tweet/image/whyyoutouzhele/2023/12/26/1739672947936174188_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/e4WqyNHu9N",
    "accountId": "whyyoutouzhele"
  }
]