[{"id":"1812901403406274851","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-16 01:25:51","content":"On July 15, the Chinese Embassy in Tajikistan issued a statement denying that China has built a military base in Tajikistan.","images":"/tweet/image/whyyoutouzhele/2024/07/16/1812901403406274851_0.jpg,","videos":"","hasPublished":true},{"id":"1812944015626514458","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-16 04:15:10","content":"July 15, Zhejiang. A woman posted a video saying that on July 3, a business contacted her to cooperate in shooting a short video advertisement. On July 9, when the woman arrived at the agreed location, she was taken away by several police officers. The woman questioned the police for not notifying her when summoning her, and the police said they would take a statement back to the station, but after she was searched in the station, she did not take a statement, but was detained in a room for 24 hours.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/07/16/1812944015626514458_0.jpg,","hasPublished":true},{"id":"1813006616964325411","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-07-16 08:23:56","content":"On July 15, the Shenyang City Public Security Bureau jointly issued a notice announcing that it would severely crack down on online rumors in accordance with the law.\nThe public is required to refrain from forwarding screenshots, videos, audios, text and other information disseminated by online platforms without authoritative and regular sources.\nPublishers, forwarders, website platform managers and other relevant personnel and units of rumor information will be dealt with in accordance with the law, and criminal liability will be pursued in serious cases. ","images":"/tweet/image/whyyoutouzhele/2024/07/16/1813006616964325411_0.jpg,/tweet/image/whyyoutouzhele/2024/07/16/1813006616964325411_1.jpg,/tweet/image/whyyoutouzhele/2024/07/16/1813006616964325411_2.jpg,","videos":"","hasPublished":true}]