[
  {
    "id": "1717812130886410643",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 15:55:02",
    "content": "https://t.co/g4zzR6Tjq8",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717812130886410643_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/g4zzR6Tjq8",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717814135344521274",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 16:02:59",
    "content": "https://t.co/XwOjofA2Yz",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717814135344521274_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/XwOjofA2Yz",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717816101784912179",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 16:10:48",
    "content": "https://t.co/t9oUDVu02Q",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717816101784912179_0.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717816101784912179_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/t9oUDVu02Q",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717816130474012840",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 16:10:55",
    "content": "https://t.co/gcBmM48oWs",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717816130474012840_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/gcBmM48oWs",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717817317562716295",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 16:15:38",
    "content": "https://t.co/2jrzZ29Mh0",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717817317562716295_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/2jrzZ29Mh0",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717817364824154253",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 16:15:49",
    "content": "https://t.co/Sclk6mDPdr",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717817364824154253_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Sclk6mDPdr",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717822506772389992",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 16:36:15",
    "content": "In Hefei, people went to Li Keqiang's former residence to lay flowers.",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717822506772389992_0.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717822506772389992_1.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717822506772389992_2.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2023/10/27/1717822506772389992_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/oFZd8zvuv5",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717828237059862826",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 16:59:02",
    "content": "Wu Zunyou passed away.",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717828237059862826_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/CWAKpgB8nA",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717838935173353503",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 17:41:32",
    "content": "Shanghai Jiaotong University ",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717838935173353503_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/wvL6iDz2vs",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717848802214789454",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 18:20:45",
    "content": "Many countries expressed condolences for Li Keqiang's death",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717848802214789454_0.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717848802214789454_1.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717848802214789454_2.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717848802214789454_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/ESMIrKLCci",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717848885324845310",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 18:21:05",
    "content": "https://t.co/UfybHQhmZM",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717848885324845310_0.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717848885324845310_1.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717848885324845310_2.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717848885324845310_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/UfybHQhmZM",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717856953190252631",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 18:53:08",
    "content": "As night falls, more and more flowers are presented at Li Keqiang's former residence",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717856953190252631_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/cHkhtknrhT",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717861924359090663",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 19:12:53",
    "content": "Guiyang Institute of Aeronautical Technology",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717861924359090663_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/J9dreXcSkN",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717863779218669680",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 19:20:15",
    "content": "Xinhua News Agency issued an obituary\n[CPC Central Committee, National People's Congress Standing Committee, State Council, CPPCC National Committee obituary Comrade Li Keqiang passed away] Xinhua News Agency, Beijing, October 27th. The Central Committee of the Communist Party of China, the Standing Committee of the National People's Congress of the People's Republic of China, the State Council of the People's Republic of China, and the National Committee of the Chinese People's Political Consultative Conference solemnly announced: Comrade Li Keqiang, an outstanding member of the Communist Party of China, a time-tested and loyal communist fighter, an outstanding proletarian revolutionary and politician, an outstanding leader of the Party and the country, a member of the Standing Committee of the Political Bureau of the 17th, 18th and 19th Central Committee of the Communist Party of China, and former Premier of the State Council, died in Shanghai at 0:10 on October 27, 2023 due to a sudden heart attack. After all efforts to rescue him failed, he died in Shanghai at the age of 68.\n\nComrade Li Keqiang was born in July 1955 in Dingyuan, Anhui. He loved the Party, the motherland, and the people since his youth, studied hard, and pursued progress. From March 1974, he worked in the Dongling Brigade of Damiao Commune, Fengyang County, Anhui Province. In May 1976, he joined the Communist Party of China. From November 1976 to March 1978, he served as the Party Branch Secretary of Damiao Brigade, Damiao Commune, Fengyang County, Anhui Province. From March 1978 to February 1982, he studied at the Law Department of Peking University and served as the head of the school student union. From February 1982, Comrade Li Keqiang served successively as Secretary of the Youth League Committee of Peking University, Member of the Standing Committee of the Central Committee of the Communist Youth League, Director of the School Department of the Central Committee of the Communist Youth League and Secretary-General of the All-China Students' Federation, Alternate Secretary of the Secretariat of the Central Committee of the Communist Youth League, Secretary of the Secretariat of the Central Committee of the Communist Youth League and Vice Chairman of the All-China Youth Federation, and Director of the National Committee of the Young Workers' Committee. From March 1993, he served as the First Secretary of the Secretariat of the Central Committee of the Communist Youth League and President of the China Youth University for Political Studies, and a member of the Standing Committee of the Eighth National People's Congress. He considered and arranged the work of the League closely around the central tasks of the Party and served the overall work of the Party and the country. Since June 1998, Comrade Li Keqiang has served successively as Deputy Secretary of the Henan Provincial Party Committee, Acting Governor, Governor, Secretary of the Henan Provincial Party Committee, Governor, Secretary of the Henan Provincial Party Committee, and Chairman of the Standing Committee of the Henan Provincial People's Congress. He proposed the goal of achieving the rise of the Central Plains, formed a development consensus throughout the province, and while vigorously promoting the process of industrialization and urbanization, accelerated the modernization of agriculture, and promoted the rapid development of various economic and social undertakings in Henan. Since December 2004, Comrade Li Keqiang has served successively as Secretary of the Liaoning Provincial Party Committee, Secretary of the Liaoning Provincial Party Committee, and Chairman of the Standing Committee of the Liaoning Provincial People's Congress. He firmly grasped the dual opportunities of the revitalization of the Northeast and the opening up of the coastal areas, focused on deepening the reform of state-owned enterprises, and built a \"five-point one-line\" coastal economic belt. He proposed and organized the implementation of concentrated and contiguous shantytown renovation, promoted employment for \"zero-employment families\" and other livelihood projects, and promoted the revitalization of Liaoning's old industrial base to achieve remarkable results. In October 2007, Comrade Li Keqiang was elected as a member of the Political Bureau of the CPC Central Committee and a member of the Standing Committee at the First Plenary Session of the 17th CPC Central Committee. In March 2008, he was appointed as Vice Premier and Deputy Secretary of the Party Group of the State Council, responsible for the routine work of the State Council, and responsible for development and reform, finance, land and resources, environmental protection, construction, and health. He assisted in responding to the international financial crisis, accelerating economic restructuring, deepening the implementation of the regional coordinated development strategy, promoting energy conservation and emission reduction and ecological environmental protection, and deepening the reform of the medical and health system. He took the protection of basic needs, strengthening the grassroots, and building mechanisms as the focus of medical reform, and promoted the \"three-wheel drive\" of medical insurance, medicine, and medical care. He focused on promoting affordable housing projects to promote the people's livelihood. He actively explored new ways of environmental protection and insisted on protecting in development and developing in protection. In November 2012, Comrade Li Keqiang was re-elected as a member and member of the Standing Committee of the Political Bureau of the CPC Central Committee at the First Plenary Session of the 18th CPC Central Committee. In March 2013, at the First Session of the 12th National People's Congress, he was appointed Premier of the State Council and Secretary of the Party Leadership Group of the State Council from the same month. Faced with the complex domestic and international situation, under the strong leadership of the Party Central Committee with Comrade Xi Jinping as the core, he adhered to the general tone of work of seeking progress while maintaining stability, maintained strategic determination, focused on improving macroeconomic regulation, paid attention to pre-adjustment and fine-tuning, and focused on directional regulation. He carried out the \"Internet +\" action in depth and accelerated the transformation of new and old kinetic energy. He adhered to the basic national policy of opening up to the outside world and solidly promoted the construction of the \"Belt and Road\". We will promote the full performance of government functions in accordance with the law, and strive to build a law-based, innovative, clean and service-oriented government that satisfies the people. In October 2017, Comrade Li Keqiang was once again elected as a member and member of the Standing Committee of the Political Bureau of the CPC Central Committee at the First Plenary Session of the 19th CPC Central Committee. In March 2018, at the First Session of the 13th National People's Congress, he was again appointed as Premier of the State Council and Secretary of the Leading Party Group of the State Council. Under the strong leadership of the CPC Central Committee with Comrade Xi Jinping as the core, facing multiple challenges such as the accelerated evolution of the world's changes, the impact of the COVID-19 pandemic, and the downward trend of the domestic economy, we will adhere to the general tone of work of seeking progress while maintaining stability, fully, accurately and comprehensively implement the new development concept, build a new development pattern, promote high-quality development, coordinate development and security, continue to do a good job in the \"six stability\" and \"six guarantees\" work, coordinate the promotion of stabilizing growth, promoting reform, adjusting structure, benefiting people's livelihood, preventing risks and maintaining stability, actively expand domestic effective demand, keep the economy running within a reasonable range, and promote the optimization and upgrading of the industrial structure by innovation-driven. We will implement the people-centered development philosophy, focus on ensuring basic needs, guaranteeing the bottom line, and promoting fairness, strengthen the policy orientation of employment priority, and expand the supply of affordable housing. Promote poverty alleviation, implement the rural revitalization strategy, and consolidate and expand the results of poverty alleviation. Implement the concept that green waters and green mountains are gold and silver mountains, and promote the construction of ecological civilization to achieve remarkable results.\n\nAfter serving as the Premier of the State Council, Comrade Li Keqiang also served as the leader of the State Council's Leading Group for Revitalizing Old Industrial Bases in Northeast China and Other Regions, the leader of the State Council's Leading Group for Western Region Development, the leader of the National Science and Technology Education Leading Group, and the leader of the National Leading Group for Climate Change and Energy Conservation and Emission Reduction, etc., and devoted a lot of effort in science and technology, education, ecological and environmental protection, and the comprehensive revitalization of Northeast China and the development of the western region. After the outbreak of the new crown epidemic, Comrade Li Keqiang served as the leader of the Central Leading Group for Response to the Epidemic, conscientiously implemented the decisions and arrangements of the Party Central Committee, adhered to the people first and life first, and promoted the coordinated prevention and control of the epidemic and economic and social development to achieve significant positive results. Comrade Li Keqiang insisted on starting from China's national conditions, adhering to and improving the socialist basic economic system, continuously promoting economic system reform, adhering to the direction of socialist market economic reform, handling the relationship between the government and the market, so that the market plays a decisive role in resource allocation, better play the role of the government, and promote a better combination of effective markets and effective governments. He continued to promote the transformation of government functions and administrative system reform, coordinated the reform of key areas such as finance, taxation, finance, investment, and science and technology, implemented a more proactive opening-up strategy, and implemented a larger scope, wider field, and deeper level of opening up. Comrade Li Keqiang is full of affection for the people, and strives to solve the outstanding difficulties of the people in employment, education, housing, medical care, and elderly care, to ensure the bottom line of people's livelihood, and continuously enhance the people's sense of gain, happiness, and security.\n\nIn March 2023, Comrade Li Keqiang will no longer serve as Premier of the State Council. After retiring from the leadership position, he firmly supported and supported the leadership of the Party Central Committee with Comrade Xi Jinping as the core, cared about the development of the cause of the Party and the country, and firmly supported the party's style and clean government construction and the fight against corruption.\n\nComrade Li Keqiang's life is a life of revolution, struggle, and glory. It is a life of serving the people wholeheartedly and a life dedicated to the cause of communism. His death is a great loss to the Party and the country. We must turn grief into strength, learn from his revolutionary spirit, noble character and fine style, unite more closely around the Party Central Committee with Comrade Xi Jinping at its core, hold high the great banner of socialism with Chinese characteristics, fully implement Xi Jinping Thought on Socialism with Chinese Characteristics for a New Era, deeply understand the decisive significance of the \"two establishments\", enhance the \"four consciousnesses\", strengthen the \"four self-confidences\", and achieve the \"two safeguards\". We must strengthen our confidence, be of one mind, work hard, and move forward courageously, so as to unite and strive for the great cause of comprehensively promoting the building of a strong country and national rejuvenation with Chinese-style modernization.",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717863779218669680_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717877630286942691",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 20:15:18",
    "content": "Hainan University Student Union Notice",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717877630286942691_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/fKlmz9vpUR",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717889588289528132",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 21:02:49",
    "content": "The convoy carrying Li Keqiang's body is heading to Beijing",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/10/27/1717889588289528132_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/NsaRV6H3CN",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717889763984716175",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 21:03:31",
    "content": "https://t.co/8M1NqqV3pw",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717889763984716175_0.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717889763984716175_1.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717889763984716175_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/8M1NqqV3pw",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717901174085505119",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 21:48:51",
    "content": "Li Keqiang's Former Residence, Hongxing Road, Hefei",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/10/27/1717901174085505119_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/LVYzGyKbhn",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717901203248472411",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 21:48:58",
    "content": "https://t.co/rF34RVlOhN",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717901203248472411_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/rF34RVlOhN",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717901722243170369",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 21:51:02",
    "content": "Hongxing Road, Hefei, Li Keqiang's former residence",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717901722243170369_0.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717901722243170369_1.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717901722243170369_2.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717901722243170369_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/8ihIGuYW85",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717903038252261783",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 21:56:16",
    "content": "https://t.co/J0uKOMEYDK",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717903038252261783_0.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717903038252261783_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/J0uKOMEYDK",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717903888601244041",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 21:59:38",
    "content": "https://t.co/DnT0Gtr2RS",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717903888601244041_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/DnT0Gtr2RS",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717908580559413361",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 22:18:17",
    "content": "Hongxing Road, Hefei, Li Keqiang's former residence",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/10/27/1717908580559413361_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/AqgSU6zFjW",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717908594421649840",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 22:18:20",
    "content": "Hongxing Road, Hefei, Li Keqiang's former residence",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717908594421649840_0.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717908594421649840_1.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717908594421649840_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/ZYHiNAND6K",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717909266219090128",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 22:21:00",
    "content": "Hefei Zhengda Plaza, \"Have a nice journey\"",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717909266219090128_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/I8raeqjscm",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717910501470941460",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 22:25:55",
    "content": "On October 27, a roller coaster rear-end collision occurred in Shenzhen Happy Valley. The number of casualties is currently unknown, and a hospital posted a notice saying that many people were being rescued.",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717910501470941460_0.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717910501470941460_1.jpg,/tweet/image/whyyoutouzhele/2023/10/27/1717910501470941460_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/R0wQDO4hTl",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717912975967715550",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 22:35:45",
    "content": "https://t.co/5rCcU1qoTH",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717912975967715550_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/5rCcU1qoTH",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717919054961197156",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 22:59:54",
    "content": "Hongxing Road, Hefei, Li Keqiang's former residence, a few minutes ago.\nThe flowers left by the people in mourning have spread into a flower path.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/10/27/1717919054961197156_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/j6l1HgWRal",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717919381005771113",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 23:01:12",
    "content": "https://t.co/qbpPn8BAwg",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/10/27/1717919381005771113_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/qbpPn8BAwg",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717921729643712562",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 23:10:32",
    "content": "https://t.co/2nWS8zVIdK",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717921729643712562_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/2nWS8zVIdK",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717925433700762022",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 23:25:15",
    "content": "https://t.co/Q0lgOrX028",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717925433700762022_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Q0lgOrX028",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717925446749196323",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 23:25:18",
    "content": "https://t.co/3DidixOBjV",
    "images": "/tweet/image/whyyoutouzhele/2023/10/27/1717925446749196323_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/3DidixOBjV",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1717934130653012045",
    "name": "李老师不是你老师",
    "createdDate": "2023-10-27 23:59:49",
    "content": "In front of Li Keqiang's former residence on Hongxing Road in Hefei, mourners still flocked to the place late at night",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/10/27/1717934130653012045_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/uDaszQsSsh",
    "accountId": "whyyoutouzhele"
  }
]