[{"id":"1863616435970523219","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 24:13:51","content":"At the invitation of the Ma Ying-jeou Foundation, a delegation of 40 Chinese university teachers and students spent nine days in Taiwan. A female Fudan University student blurted out during an interview: congratulations to the Chinese Taipei team, and she also said that she hoped that both sides of the Taiwan Strait would work together to help the \"motherland\" reach a higher level in the field of baseball.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863619748841640139","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 24:29:05","content":"December 2, Dongguan, Guangdong. A woman in a wheelchair struggles to find a trash can on the roadside. Netizen: \"In the context of the times, ordinary people are just a grain of sand\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863627682900320609","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 24:59:25","content":"December 2, Chengde, Hebei. Rongsheng Jinxiu Academy real estate delayed delivery, forcing the owner to jump off the building to defend his rights. December 2. Hengyang, Hunan. Sunset Red Apartment lured the elderly to invest with high interest rates and then collapsed. The elderly defended their rights at the Hengyang Municipal Government. December 2, Zhejiang. Kangfeisi Gym ran away, and employees held banners to demand wages.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863703906049507609","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 06:02:00","content":"On December 2, there was a rumor online that a stabbing incident occurred in a student dormitory at Huazhong Agricultural University. Some students said that someone was stabbed, while others said that two people fought with knives. Later that night, the school refuted the rumor, saying that a student took medicine due to emotional problems and called the police, and there was no student conflict. Students were asked not to believe or spread rumors.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863724772946829705","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 07:32:50","content":"December 2, Suzhou, Anhui. The legal representative of Hongyi Intellectual Property Co., Ltd. reported in real name that Li Xinwei, a prosecutor of the Suzhou People's Procuratorate of Anhui Province, and Xie from the Development Zone Branch of Suzhou Public Security Bureau were suspected of embezzlement and bribery, in order to reduce the already verified criminal facts for the criminal suspects.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863744443821518974","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 08:48:32","content":"User contribution: Beijing Xicheng","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863815007957352524","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 13:20:53","content":"On November 30, the Hong Kong people organized the \"Leeds Brothers and Sisters\" to protest silently in the center of Leeds to oppose the \"47 Persons Case\" ruling. A Chinese man who spoke Mandarin threw drinks and swore, and was chased and blocked by Hong Kong people. After he was separated from his companions, he allegedly called the Chinese Embassy for help but was rejected. He held the phone and asked himself helplessly: \"What role can the Chinese Embassy play? Please tell me. It is useless.\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863865804040896662","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 16:52:42","content":"December 2, Hubei. After a man donated to Ukraine, he received a call from a community police officer, who asked him to come to the police station for investigation. The police said, \"It involves political security, and this is an order from the Provincial Public Security Department, so we must meet in person.\" Netizens supported the man in the comment section.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863869202878406679","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 17:07:55","content":"Tong Xiangling, a famous Peking Opera actor, passed away on December 2. He was famous for playing Yang Zirong in the movie \"Taking Tiger Mountain by Strategy\". Tong Xiangling previously posted on Weibo that the Shanghai Theater's performance of \"Taking Tiger Mountain by Strategy\" removed the \"Chairman Mao\" in the line \"That is the loyalty to the Party and Chairman Mao\", and he was very upset about this. A netizen replied: Haven't you two been bullied enough during the Cultural Revolution? Tong Xiangling responded.","hasFullContentTranslated":true,"hasPublished":false}]