[{"id":"1863616435970523219","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 24:13:51","content":"At the invitation of the Ma Ying-jeou Foundation, a delegation of 40 Chinese university teachers and students spent nine days in Taiwan. A female Fudan University student blurted out during an interview: congratulations to the Chinese Taipei team, and she also said that she hoped that both sides of the Taiwan Strait would work together to help the \"motherland\" reach a higher level in the field of baseball.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863619748841640139","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 24:29:05","content":"December 2, Dongguan, Guangdong. A woman in a wheelchair struggles to find a trash can on the roadside. Netizen: \"In the context of the times, ordinary people are just a grain of sand\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863627682900320609","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 24:59:25","content":"December 2, Chengde, Hebei. Rongsheng Jinxiu Academy real estate delayed delivery, forcing the owner to jump off the building to defend his rights. December 2. Hengyang, Hunan. Sunset Red Apartment lured the elderly to invest with high interest rates and then collapsed. The elderly defended their rights at the Hengyang Municipal Government. December 2, Zhejiang. Kangfeisi Gym ran away, and employees held banners to demand wages.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863703906049507609","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 06:02:00","content":"On December 2, there was a rumor online that a stabbing incident occurred in a student dormitory at Huazhong Agricultural University. Some students said that someone was stabbed, while others said that two people fought with knives. Later that night, the school refuted the rumor, saying that a student took medicine due to emotional problems and called the police, and there was no student conflict. Students were asked not to believe or spread rumors.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863724772946829705","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 07:32:50","content":"December 2, Suzhou, Anhui. The legal representative of Hongyi Intellectual Property Co., Ltd. reported in real name that Li Xinwei, a prosecutor of the Suzhou People's Procuratorate of Anhui Province, and Xie from the Development Zone Branch of Suzhou Public Security Bureau were suspected of embezzlement and bribery, in order to reduce the already verified criminal facts for the criminal suspects.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863744443821518974","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 08:48:32","content":"User contribution: Beijing Xicheng","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863815007957352524","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 13:20:53","content":"On November 30, the Hong Kong people organized the \"Leeds Brothers and Sisters\" to protest silently in the center of Leeds to oppose the \"47 Persons Case\" ruling. A Chinese man who spoke Mandarin threw drinks and swore, and was chased and blocked by Hong Kong people. After he was separated from his companions, he allegedly called the Chinese Embassy for help but was rejected. He held the phone and asked himself helplessly: \"What role can the Chinese Embassy play? Please tell me. It is useless.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863865804040896662","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 16:52:42","content":"December 2, Hubei. After a man donated to Ukraine, he received a call from a community police officer, who asked him to come to the police station for investigation. The police said, \"It involves political security, and this is an order from the Provincial Public Security Department, so we must meet in person.\" Netizens supported the man in the comment section.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863869202878406679","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 17:07:55","content":"Tong Xiangling, a famous Peking Opera actor, passed away on December 2. He was famous for playing Yang Zirong in the movie \"Taking Tiger Mountain by Strategy\". Tong Xiangling previously posted on Weibo that the Shanghai Theater's performance of \"Taking Tiger Mountain by Strategy\" removed the \"Chairman Mao\" in the line \"That is the loyalty to the Party and Chairman Mao\", and he was very upset about this. A netizen replied: Haven't you two been bullied enough during the Cultural Revolution? Tong Xiangling responded.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863873007699276178","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 17:24:00","content":"December 2 report: Shan Jixiang, former director of the Palace Museum, said in an interview that in order to protect the integrity of the Forbidden City's floor tiles, he insisted on wearing cloth shoes in his daily life, and kept this habit, rain or shine, always consistent. But as early as 2018, a web celebrity posted: \"The first time I drove into the Forbidden City, the three of us were excited in the car\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863878098586055027","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 17:39:01","content":"Recently, schools and education departments in many places have issued documents, requiring the promotion of traditional Chinese culture and the rejection of \"foreign festivals\". On November 26, Liaoning Chaoyang Special Education Center issued an initiative to reject foreign festivals. On December 2, Shandong. A university issued a notice not to advocate the celebration of foreign festivals such as Christmas. A middle school in Jingmen, Hubei also received a similar notice. On November 28, Baotou Yangzheng Kindergarten organized an event to promote traditional culture and resist foreign festivals.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863879406353322049","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 17:39:07","content":"December 3, Anyang, Henan. Anyang Preschool Teachers College was exposed for withholding wages for its faculty and staff, and the staff held up banners to demand their salaries.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863884405389046140","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 17:54:20","content":"Recently, it was revealed online that Zhongrong Trust’s financial products could not be redeemed, and investors knelt down in front of the company to defend their rights. These investors include the elderly and the pillars of their families. They chose Zhongrong Trust because of their trust in the law, trust in the country, and their yearning for a better life. However, all of these were shattered by Zhongrong Trust’s unilateral breach of contract.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863889840326209907","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 18:24:41","content":"Table tennis player Ma Long and a delegation of mainland students came to visit the College of Social Sciences at NTU this morning. However, a few days ago, some students of NTU were dissatisfied because the delegation mentioned the word \"Chinese Taipei\". They came to the scene holding up simplified Chinese banners to protest. The school and police dispatched additional personnel to the scene, but fortunately only shouting occurred and no conflict occurred.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863892384272232591","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 18:39:54","content":"December 2 (published), Jilin. The woman posted that she could not stand the boring work day after day in the system, so she chose to resign. After her parents found out, they went to the unit leader to plead for mercy, which resulted in the failure of the resignation application, so the woman resubmitted the resignation application. As a result, her father beat her until she vomited blood after finding out. At present, the woman has successfully resigned.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863894889353941480","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 18:39:59","content":"November 30th, Zhengzhou, Henan, Sunac Yuhu Chenyuan Phase 3, owners protested against rushing the construction schedule and shoddy workmanship, and demanded that no rectification be made before they could receive the house. This community is a high-end low-rise project of Sunac. December 1st, Yunfu, Guangdong, Luoding Shuangdong Zhengsheng Plaza, owners put up banners to protest against the unfinished project. December 1st, Taiyuan, Shanxi, Taihe Jinzunfu was unfinished, and the owners demanded to see the leaders. December 1st, Shaanxi, a community owner put up banners to protest that the gas was not connected after two years of delivery and paying more than 10,000 yuan for gas connection fees.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863896973067358684","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 18:55:12","content":"Recently, in Zhejiang, a netizen posted a video showing that he has 4 daughters, and said: People who are poor cannot survive for more than three generations, and people who are poor must have more children, because there will always be one person who will change the family. Some netizens in the comment area expressed their support: \"If you don't have money, have more children. In the future, when you are old, the money raised by having a few children will definitely be enough for your retirement.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863898721567875378","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 18:55:18","content":"On December 3, the offshore RMB exchange rate fell below 7.30.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863902525335998772","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 19:10:31","content":"On December 3, economist Gao Shanwen pointed out at the SDIC Securities Strategy Conference: The more elderly people there are, the more prosperous the economy and consumption will be. The current environment is: vigorous elderly people, lifeless young people and middle-aged people who have no desire to live. The elderly can continue to dance in the square with pensions, while young people have cut back on their spending and eat instant noodles due to declining incomes and no jobs. Currently, this speech is being deleted from Weibo.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863906363711406317","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 19:25:44","content":"On December 2, in Dahua County, Guangxi, a man posted a video saying that his mother had undergone surgery in the orthopedic department of Dahua Hospital before her death. It was not until after the old woman passed away that it was discovered that the doctor had driven a thick nail through her bones. It was hard to imagine the pain she had to endure every time she moved. Some netizens suggested that the man sue the hospital, but the man said: His family was in financial difficulty and he could not afford to sue the hospital.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863910609068404924","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 19:40:57","content":"On December 3, China Population News: \"Colleges and Universities Should Play the Leading Role in Marriage and Love Education\" The article pointed out: Colleges and universities are an important place for college students to fall in love, so colleges and universities should give full play to the role of the bridgehead and main battlefield of marriage and love education, and assume the responsibility of providing marriage and love education to college students by offering marriage and love education courses.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863911256861901194","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 19:41:02","content":"On November 28, the Lietian Jade Academy in Wuming District, Nanning, Guangxi was left unfinished. Owners gathered outside the district government to protest their rights. On the 29th, owners gathered outside the sales center to protest their rights.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863911850523668818","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 19:56:16","content":"On December 1, in Liaoyang, Liaoning, bus drivers gathered in front of the bus company building to protest their rights and demand their wages. It was reported that the bus company had been in arrears of wages for 9 months, making it difficult for the bus drivers to make a living.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863912669646045555","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 19:56:21","content":"On December 1, the Ministry of National Security issued the following statement: Beware of open source information becoming a source of leaks. Open source information refers to publicly accessible legal information resources.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863913515343376684","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 19:56:27","content":"When Sun Yat-sen University student Zhao was interviewed by a Taiwanese reporter, he was asked if he felt that China and Taiwan had anything in common. Zhao said: Both sides of the Taiwan Strait share the same roots and origins. I think everyone’s customs and hobbies are similar. The FTV reporter asked in return: Does the same roots and origins include democracy and freedom? Zhao said: Uh…","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863916322306068820","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 20:11:40","content":"On December 2, the United States added more than 140 Chinese companies to the trade restriction list, involving multiple types of semiconductor products such as semiconductor manufacturing equipment and electronic design automation tools. In response, the China Semiconductor Association issued a statement: American chip products are no longer safe and reliable. Chinese related industries will have to purchase American chips with caution. The Automobile Industry Association, the Internet Association, and the Communications Enterprise Association also said that they will purchase American chips with caution.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863916723361173535","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-03 20:11:46","content":"On December 2, investors gathered in front of the Chongqing High People's Court and shouted slogans to protest against Article 88 of the new Company Law. Investors gathered in front of high courts across the country to protest.","hasFullContentTranslated":true,"hasPublished":true}]