[
  {
    "id": "1745163871965286883",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 03:21:05",
    "content": "Article deleted",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745163871965286883_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745360115467686109",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 16:20:53",
    "content": "On January 11, a car accident occurred on the campus of Nanjing Normal University.\nA female student was hit by a car while crossing the road.\nAfterwards, the school officials deleted a large number of posts and said that the injured students were not in danger, which aroused the dissatisfaction of students.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745360115467686109_0.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745360115467686109_1.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745360115467686109_2.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745360115467686109_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745364054313411053",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 16:36:32",
    "content": "On January 11, in response to the \"immigration situation of middle school students from Henan Province in Daqing City, Heilongjiang Province\", the Daqing Municipal Education Bureau issued a notice today, conducting a comprehensive investigation of students transferring from junior high schools in other provinces, and canceling the enrollment qualifications of students with problems such as separation of people and school registration, in order to effectively safeguard the legitimate rights and interests of local students.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745364054313411053_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745365362512630117",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 16:41:44",
    "content": "Later, the school directly closed the campus forum",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745365362512630117_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745369011905343518",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 16:56:14",
    "content": "January 11, Ningbo",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745369011905343518_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745373118225342766",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 17:12:33",
    "content": "A netizen from Puyang, Henan, submitted an article saying that advertisements for \"migration after high school entrance exam\" can be seen everywhere at the entrance of local high schools. This involves Tianjin, Heilongjiang, Hainan, Liaoning, Xi'an, Tibet, Ningxia, Hubei, Shaanxi and other provinces and cities.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745373118225342766_0.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745373118225342766_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745375543082529038",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 17:22:11",
    "content": "On January 7, the People's Daily published a commentary: Let the people live a better life.\nPeople: Shamelessness has reached the extreme, and the Chinese people have become accustomed to it.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745375543082529038_0.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745375543082529038_1.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745375543082529038_2.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745375543082529038_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745382297937891681",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 17:49:02",
    "content": "January 10, Yuncheng, Shanxi. Yuncheng North Suburb Happy Harbor Supermarket closed down less than 20 days after opening due to a lack of funds. Suppliers rushed into the supermarket and grabbed goods with sacks to stop losses.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/11/1745382297937891681_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745385996969988284",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 18:03:44",
    "content": "On January 10, on Shanghai Metro Line 2, a man complained on the phone that Shanghai Line 2 was full of migrant workers, which triggered a fight between the two sides after the surrounding passengers responded.\nThat night, the official account of the Shanghai Public Security Bureau Urban Rail and Public Transport Corps issued a police report saying that a 34-year-old man quarreled with a female passenger on Metro Line 2 because he thought she was talking too loudly on the phone. During the period, there were inappropriate remarks about migrant workers.\nAfter the 51-year-old man in the same car criticized his remarks, he punched him and the two sides had a physical conflict. After being persuaded by the surrounding passengers, the two sides fought again. At present, the police have imposed administrative detention penalties on the two people in accordance with the law.\nBoth parties are migrant workers from other places who came to Shanghai to work.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/11/1745385996969988284_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745387221866144046",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 18:08:36",
    "content": "https://t.co/KYMQdSN3V4",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745387221866144046_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745389169197621539",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 18:16:20",
    "content": "On January 8, a female college student in Jinan, Shandong Province, posted a video complaining about the high taxi fares in Jinan, which aroused strong dissatisfaction among local taxi drivers. On the day the video was released, someone offered a \"bounty\" to the girl in the taxi driver group, causing a large number of drivers to go to the school the next day to surround the girl and ask for an explanation.\nOn January 9, the taxi company said: \"The girl's behavior is slandering the entire industry. Our meters have been assessed by the Quality Supervision Bureau. Look at her language and her makeup. She is trying to attract traffic.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/11/1745389169197621539_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745396683029021141",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 18:46:11",
    "content": "On January 9, the President's Office of Haiyin Wealth issued a letter to all employees stating that due to objective factors such as the company's operating conditions, capital turnover has been affected, and the December salary payment has been postponed. Please plan your personal living expenses reasonably. We hope that all family members will understand the company's current difficulties and work together with the company to overcome the difficulties.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745396683029021141_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745398230907597170",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 18:52:20",
    "content": "\"East rises, West falls\"\nOn January 11, the Nikkei index broke 35,000 points, setting a new high in the Japanese stock market in 34 years.\nAt present, the Shanghai Composite Index is struggling to explore 2,900 points.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745398230907597170_0.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745398230907597170_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745399099216531506",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 18:55:47",
    "content": "On January 10, Panzhihua, Sichuan. A girl named Zhou Yan held up her ID card and reported in real name through a short video platform that she was molested by her stepfather Hu many times when she lived with her mother and stepfather Hu when she was a child, and was raped by her stepfather Hu when she was 13 years old.\nZhou Yan told reporters that she was too young and afraid to speak out at the time, but she never got over the shadow of the incident and dropped out of school in the second year of junior high school. In the years after the incident, she cut her wrists, hit her head against the wall, and took pills to commit suicide. She has reported to the police and the police have filed a case.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/11/1745399099216531506_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745401181541634405",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 19:04:04",
    "content": "Netizen submission\nA parent from Nanchong, Sichuan submitted his senior high school student’s Chinese test paper:",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745401181541634405_0.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745401181541634405_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745406400581292223",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 19:24:48",
    "content": "On January 10, Jerry Guo, who had not been seen for a long time, revealed in an exclusive interview with China Daily that one of the reasons he decided to stop updating was that three US government-funded institutions accused him of being a \"Chinese propaganda tool.\" He said that what he filmed were all facts and what he saw with his own eyes, nothing more. He also said that the three institutions were Radio Free Asia, Voice of America, and the Australian Strategic Policy Institute.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/11/1745406400581292223_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745409148542419199",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 19:35:43",
    "content": "Recently, as the A-share market has been falling for days, the anger of stockholders has reached a critical point. It was reported online that a bronze bull sculpture in front of the stock exchange was smashed.\nThe news has not been confirmed but it has triggered discussions among stockholders: 200 million stockholders have undergone a fundamental change in their beliefs as the stock market has fallen ruthlessly. If this continues, it will cause all kinds of social problems.\nMany people called for \"doing something\", and some said, \"I am heavily in debt from stock speculation. Do you really think I dare not die?\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745409148542419199_0.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745409148542419199_1.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745409148542419199_2.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745409148542419199_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745412730314502315",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 19:49:57",
    "content": "On January 10, Zhonglupu Town, Xiangtan, Hunan, was surrounded by garbage, and no one dealt with the garbage on the street for a week.\nGovernment staff said that the government's financial resources were no longer able to bear the garbage cleaning work, and hoped to negotiate with merchants to pay part of the sanitation fee, but some merchants refused to pay and said they would manage it themselves, so the town government no longer undertakes garbage removal services.\nSome citizens said: The government currently owes more than 3 million yuan to the outsourcing company.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/11/1745412730314502315_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1745422036522922080",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 20:26:56",
    "content": "On January 11, Ningbo announced an increase in the social security contribution base.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745422036522922080_0.jpg,/tweet/image/whyyoutouzhele/2024/01/11/1745422036522922080_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745433530165846085",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 21:12:36",
    "content": "On January 11, it was reported online that the Beijing Xicheng District primary school unified examination papers were leaked. Some parents got the third-grade math test papers in advance and showed off in their circle of friends that their children had done the test papers in advance.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/11/1745433530165846085_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1745433816515129571",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-11 21:13:45",
    "content": "January 11, Wuhan City, Hubei Province.\nAt the demolition site, a large number of workers dragged the owners out of their homes and demolished the houses in front of them.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/11/1745433816515129571_0.jpg",
    "hasPublished": true
  }
]