[{"id":"1834990133608923626","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 00:18:34","content":"On the occasion of the 70th anniversary of the founding of the National People's Congress, Xi Jinping said that the people's congress system is a great creation in the history of human political systems.","images":"/tweet/image/whyyoutouzhele/2024/09/15/1834990133608923626_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1834990133608923626_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1834996984312381802","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 00:45:48","content":"Recently, a Genshin Impact player reported that his game account was banned for 11 years just because he named a dragon companion in the game \"Ren Yiping\", and any appeal through any channel was invalid. Another player named his account \"Gu Ailing\" and was also banned for 11 years.","images":"/tweet/image/whyyoutouzhele/2024/09/15/1834996984312381802_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1834996984312381802_1.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1834996984312381802_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1834997051328708838","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 00:46:04","content":"Further reading: Why the People's Congress system is a great creation in the history of human political system\n","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835011287224664324","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 01:42:38","content":"Recently, the network security technology company \"Anbotong\" published an article on its official account, saying that by deploying the company's equipment, schools can accurately identify the firewall-circumvention software, and trace back the firewall-circumvention IP, identify the person with real name, and accurately locate and \"arrest\" the student's firewall-circumvention behavior. It can also generate customized reports on students' firewall-circumvention behavior, not only to view the firewall-circumvention trend, but also to view the application and user distribution, and record all firewall-circumvention behaviors, while assisting teachers in completing performance reports.","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835011287224664324_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835011287224664324_1.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835011287224664324_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835232540191268977","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 16:21:49","content":"Recently, some netizens reported that Huatu Education’s classroom showed inappropriate remarks: \"If you don’t work hard, your daughter may be hugged by her peers. If you work hard, you can hug the daughter of your peers.\"","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835232540191268977_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835233390028845111","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 16:25:11","content":"Recently, in Xiangyang, Hubei, a netizen posted a video saying that a first-grade teacher at Laohekou No. 4 Middle School required students to order milk, and if they did not order milk, they had to provide a medical certificate for milk allergy.","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835233390028845111_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835233390028845111_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835238109551951979","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 16:43:57","content":"According to recent media reports, starting from September 13, foreigners can use foreign bank cards to take the subway in Beijing. On September 9, the Beijing Restaurant Association issued an initiative that restaurant companies should standardize English signs and promote the use of Chinese and English menus.","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835238109551951979_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835238109551951979_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835242296503407029","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 17:00:35","content":"September 14 (Released) Xi'an, Shaanxi. During an outdoor performance, the band \"Nanmen Bus\" changed the lyrics of Hao Yun's \"To Live\" from \"They hold Apple phones\" to \"They hold Huawei phones\". Even so, they were still questioned by a man. The man stood with his hands behind his back and said to the fans at the scene, \"Huawei is our Chinese (pride)\". After the band members explained, the man left in disgrace.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/15/1835242296503407029_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835244975040168375","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 17:11:13","content":"Ma Yuqing, a former Chinese CIA agent, was sentenced to 10 years in prison for selling a large number of state secrets to China. He used his former CIA and FBI identities to steal sensitive intelligence and frequently contacted Chinese intelligence personnel. The reason was that he wanted to see the success of the \"motherland\".","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835244975040168375_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835244975040168375_1.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835244975040168375_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835250040404836357","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 17:31:21","content":"Recently, CCTV commentator Bai Mengchen caused controversy for saying \"we Japan\" three times in the program \"New Defense Observation\" and was questioned by a large number of netizens.","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835250040404836357_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835250040404836357_1.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835250040404836357_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/15/1835250040404836357_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835254185421394035","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 17:47:49","content":"Netizen contribution\nShanghai Laoximen old house renovation, the government made an \"art installation\" on the wall, passers-by can spell out patterns and words to respond \"I hope the future Laoximen will be...\"\nSome time ago, someone spelled out \"democracy and freedom\", and today I passed by and found that the installation had been removed","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835254185421394035_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835254185421394035_1.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835254185421394035_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835255130004017332","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 17:51:35","content":"The 11th Xiangshan Forum was held in Beijing from September 12 to 14. Zhang Weiwei attended the forum as a scholar representative. He said: Chinese young people are the most confident generation in China's modern history.","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835255130004017332_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835255130004017332_1.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835255130004017332_2.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835255130004017332_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835258781401551184","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 18:06:05","content":"On September 14, the National Bureau of Statistics released data showing that from January to August, real estate development investment fell by 10.2%. The sales area of newly built commercial housing nationwide fell by 18.0% year-on-year; the sales volume of newly built commercial housing fell by 23.6%. The National Bureau of Statistics: The current real estate market still has great potential and space in the future.","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835258781401551184_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835265187990917168","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 18:31:33","content":"September 15 (Release), on July 11, Meng Zhaojing, a teacher in Qi County, Henan, hit an old man and caused him to suffer a comminuted fracture (the traffic police determined that she was fully responsible), but she did not fulfill her obligation to compensate. The family members sought help from the traffic police, the Education Bureau, the Human Resources and Social Security Bureau, the Discipline Inspection Commission and other units to no avail. Now, because they are unable to afford the treatment costs, they seek help from the Internet.","images":"/tweet/image/whyyoutouzhele/2024/09/15/1835265187990917168_0.jpg,/tweet/image/whyyoutouzhele/2024/09/15/1835265187990917168_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/15/1835265187990917168_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835268038184350074","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 18:42:52","content":"September 15, Xi'an, Shaanxi. Zhang Ting, a doctoral student at Xi'an University of Architecture and Technology, posted a video about her experience of cyberbullying in recent years. Previously, when she was introducing a book by a Japanese writer in a live broadcast, she was cyberbullied and questioned just because she said \"we Japanese\" three times. As a result, she suffered great psychological pressure and eventually resigned.\n","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/15/1835268038184350074_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835271845265756438","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 18:58:00","content":"According to Xiaoxiang Morning News: On September 14, a netizen posted a video and broke the news that in the early morning of September 13, in the dormitory building of an art school in Fengcheng, Dandong, Liaoning, \"a bullied person took a knife to the bully's dormitory and stabbed the bully to death.\" This matter has attracted attention. The video shows that in the dormitory corridor, a man was lying on the ground with his upper body naked and covered in blood. There were long bloodstains on the floor of the corridor.\nOn September 14, a reporter from Xiaoxiang Morning News contacted a staff member of Fengcheng Vocational Education Center, who said, \"Such an incident happened in the school, but the specific situation, whether it was bullying, etc., is being investigated by the public security organs. The person who was stabbed was a student, and the person who stabbed was also a student.\"\nXiaoxiang Morning News reporter asked Fengcheng Education Bureau to verify the \"stabbing of the bully\", and the staff said that it was not bullying, and the specific situation was under investigation, and the final investigation results needed to be waited for.\nXiaoxiang Morning News reporter asked Fenghuangcheng Police Station and Fengcheng Public Security Bureau for confirmation but failed. Fengcheng Funeral...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/15/1835271845265756438_0.jpg,","hasFullContentTranslated":false,"fullContent":"据潇湘晨报报道：9月14日，有网友发布视频爆料称，9月13日凌晨，在辽宁丹东凤城市一艺校的宿舍楼， “有被霸凌者拿刀去霸凌者宿舍，将霸凌者捅死”。此事引发关注。视频显示，宿舍走廊里，一男子赤裸上身躺在地上，浑身是血。走廊地板上有长条血迹。\n9月14日，潇湘晨报记者联系到凤城市职业教育中心的一名工作人员，他表示，“学校有发生这样一件事，但是具体的情况，是不是遭遇霸凌等，公安机关正在调查。被捅的人是学生，捅人的也是学生。”\n潇湘晨报记者向凤城市教育局求证“捅死霸凌者”一事，工作人员表示，不是霸凌，具体情况正在调查，需要等待最后的调查结果。\n潇湘晨报记者向凤凰城派出所、凤城市公安局求证未果。凤城市殡仪馆的工作人员告诉记者，艺校身亡的学生被送到了该殡仪馆。“现在在火化班。”","hasPublished":true},{"id":"1835274091734994947","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 19:06:55","content":"On September 14, students at Shenzhen Senior High School Innovation Campus protested against the policy of “studying 13 days and resting 1 day”.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/15/1835274091734994947_0.jpg,/tweet/video/whyyoutouzhele/2024/09/15/1835274091734994947_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835276949801123885","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 19:18:17","content":"September 14, Shangqiu, Henan. A man claimed that he was a veteran and that someone had impersonated him in his job after his discharge. He called the Commission for Discipline Inspection, but the Commission said it could not handle the case and could only handle illegal acts of cadres at or above the department level.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/15/1835276949801123885_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1835279342127226967","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-15 19:27:47","content":"Recently, when Volkswagen executive Fu Qiang was demonstrating the Wenyan Yixin AI equipped in Passat por at the Passat 380TSI family launch conference, an incident occurred. The AI did not reply to the messages read by the readers or replied randomly after reading the messages, which caused heated discussion.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/15/1835279342127226967_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]