[{"id":"1748466606332616993","name":"李老师不是你老师","createdDate":"2024-01-20 06:04:58","content":"On the evening of January 19, on the streets of Xiamen","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748466606332616993_0.jpg","videos":"","hasPublished":true},{"id":"1748473163078336994","name":"李老师不是你老师","createdDate":"2024-01-20 06:31:01","content":"On December 9, an 18-year-old boy went missing in Lianyungang, Jiangsu. On January 14, the rescue team salvaged the boy's body. However, the boy's father questioned the incident and continued to speak out online. On January 19, the boy's father said in a live broadcast that his house was being knocked down, and then posted a video saying that his relative's mobile phone was robbed by a group of unidentified people. Some netizens said that there were traffic police guarding the village, and only people could enter but not leave. Review of the incident: On January 14, after 35 days of salvage and search by multiple rescue teams, Zhang Xinwei's body was finally found and salvaged ashore. According to a member of the rescue team at the scene, the body had been soaked and was not in good shape. On January 15, his father expressed doubts to reporters, believing that the child had been in the water for so many days, but there was no giant. At the same time, the rescue team received a banner just one hour after they had just fished the person out, but they did not send a banner. At the same time, they requested an autopsy in another place. If your child was bullied on campus before his death, you must also hold the school and the bully accountable.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748473163078336994_0.jpg","hasPublished":true},{"id":"1748473510169653721","name":"李老师不是你老师","createdDate":"2024-01-20 06:32:24","content":"Some netizens filmed that on the evening of the 19th, the intersection leading to Zhang Xinwei's home was guarded by several traffic police, allowing people to enter but not exit.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748473510169653721_0.jpg","hasPublished":true},{"id":"1748473811358371910","name":"李老师不是你老师","createdDate":"2024-01-20 06:33:36","content":"A netizen received a call from someone claiming to be from the local police after posting a video of an 18-year-old boy jumping into a river in Guanyun County.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748473811358371910_0.jpg","hasPublished":true},{"id":"1748473887388508553","name":"李老师不是你老师","createdDate":"2024-01-20 06:33:54","content":"https://t.co/polHSJiOvb","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748473887388508553_0.jpg","hasPublished":true},{"id":"1748477651256308159","name":"李老师不是你老师","createdDate":"2024-01-20 06:48:51","content":"At 9:30 pm on January 19, at the Dongfanghong Square in Jiaozuo City, Henan Province.\nThree young people were injured in an accident when they were igniting homemade firecrackers, and one of them had his hand blown off on the spot.\nSome people at the scene said that they did not have firecrackers in their hands, but saw them connecting wires, so they suspected that they were detonators.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748477651256308159_0.jpg","hasPublished":true},{"id":"1748534561422950435","name":"李老师不是你老师","createdDate":"2024-01-20 10:35:00","content":"Netizen contribution\nMathematics test papers for high school students in a certain school in Shanghai: There are several different ways to arrange the 1-4 volumes of \"Xi Jinping: The Governance of China\".","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748534561422950435_0.jpg","videos":"","hasPublished":true},{"id":"1748630168850075704","name":"李老师不是你老师","createdDate":"2024-01-20 16:54:54","content":"At 23:00 on January 19, a fire broke out in a dormitory of Yingcai School in Yanshanpu Village, Dushu Town, Fangcheng County, Nanyang City, Henan Province.\nThe accident caused 13 deaths and 1 injury. The injured is being treated in the hospital and his vital signs are currently stable.\nNearby merchants said that Yingcai School is mainly for primary schools and kindergartens. \"Some students who live more than ten miles away will also send their children here to study. The school is for boarding students, and parents usually take their children home once every two weeks.\"","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748630168850075704_0.jpg","videos":"","hasPublished":true},{"id":"1748630506609029329","name":"李老师不是你老师","createdDate":"2024-01-20 16:56:15","content":"Some netizens took photos of the road leading to Yingcai Primary School being blocked.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748630506609029329_0.jpg","hasPublished":true},{"id":"1748633025607336197","name":"李老师不是你老师","createdDate":"2024-01-20 17:06:15","content":"After the fire, on the morning of January 20, the Jinhua Traffic Police in Zhejiang posted a message on its official Weibo account, \"Good morning, have a nice weekend, I hope you will get up as usual with a good mood, and the troubles will be gone forever.\" At the end, it added a tag that a school fire in Xinyang, Henan, had killed 13 people.\nAfter the posting of this Weibo account, a large number of netizens were dissatisfied, and some netizens flocked to the comment area of its account to insult it. The Jinhua Traffic Police immediately opened a selection of comments.","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748633025607336197_0.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748633025607336197_1.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748633025607336197_2.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748633025607336197_3.jpg","videos":"","hasPublished":true},{"id":"1748633434786799767","name":"李老师不是你老师","createdDate":"2024-01-20 17:07:53","content":"At 3:38 am on January 20, a dust explosion occurred in the production workshop of Changzhou Shenrong Metal Technology Co., Ltd., killing 8 people and slightly injuring 8 people.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748633434786799767_0.jpg","hasPublished":true},{"id":"1748634865468055612","name":"李老师不是你老师","createdDate":"2024-01-20 17:13:34","content":"On January 19, Dong'an International (AXA Real Estate) in Chao'an District, Chaozhou City, Guangdong Province, made false propaganda and claimed that the houses had serious quality problems, deceiving the owners into handing over the houses. The owners collectively put up banners to defend their rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748634865468055612_0.jpg","hasPublished":true},{"id":"1748640310224179304","name":"李老师不是你老师","createdDate":"2024-01-20 17:35:12","content":"According to the Chinese government website on January 19, among the 2,099 road administration administrative penalty case files of the Shexian Transportation Bureau of Handan City, Hebei Province since 2023, the signatures and fingerprints of the parties in 1,964 case files were forged by staff, with the proportion of forgery as high as 93.6%.","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748640310224179304_0.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748640310224179304_1.jpg","videos":"","hasPublished":true},{"id":"1748645513988088128","name":"李老师不是你老师","createdDate":"2024-01-20 17:55:53","content":"Later, on January 20, the Wenzhou Red Cross Society responded that it was just some work-related issues. Young people nowadays are impulsive and should do whatever they want. She resigned and is no longer with us.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748645513988088128_0.jpg","hasPublished":true},{"id":"1748649466658189795","name":"李老师不是你老师","createdDate":"2024-01-20 18:11:35","content":"https://t.co/bSQQpvlnZr","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748649466658189795_0.jpg","videos":"","hasPublished":true},{"id":"1748658062498365778","name":"李老师不是你老师","createdDate":"2024-01-20 18:45:45","content":"On January 19, WeChat's \"blocking\" index soared 1647.92%\nCurrently, many users can be seen on Weibo @ Tencent Customer Service asking for unblocking.","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748658062498365778_0.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748658062498365778_1.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748658062498365778_2.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748658062498365778_3.jpg","videos":"","hasPublished":true},{"id":"1748658976068165699","name":"李老师不是你老师","createdDate":"2024-01-20 18:49:23","content":"Errata, Nanyang","images":"","videos":"","hasPublished":true},{"id":"1748670266975060084","name":"李老师不是你老师","createdDate":"2024-01-20 19:34:15","content":"User contributions","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748670266975060084_0.jpg","videos":"","hasPublished":true},{"id":"1748688169623589146","name":"李老师不是你老师","createdDate":"2024-01-20 20:45:23","content":"On the 16th, many people went to the Dongfanghong Bridge to present flowers to the boy.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748688169623589146_0.jpg","hasPublished":true},{"id":"1748688552685146572","name":"李老师不是你老师","createdDate":"2024-01-20 20:46:54","content":"Earlier, when the search and rescue team was searching for the boy's body, the boy's father was on the bridge and repeatedly called for his child to come home.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748688552685146572_0.jpg","hasPublished":true},{"id":"1748689874926833802","name":"李老师不是你老师","createdDate":"2024-01-20 20:52:09","content":"After an unknown person broke into the boy's home and broke the door to steal his phone on the evening of January 19, netizens filmed a large number of police guarding the entrance to the village on the morning of January 20. The police had to check the phone before entering the village. The boy's parents were not at home, only his grandmother was at home. At the same time, there was a police car stationed at every intersection along the road.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748689874926833802_0.jpg","hasPublished":true},{"id":"1748692988161618144","name":"李老师不是你老师","createdDate":"2024-01-20 21:04:32","content":"On January 19, Guanyun County police reported that the boy had committed suicide by jumping into the river due to personal emotional entanglements. Before committing suicide, he sent farewell messages to many classmates and posted \"suicide notes\" on QQ Space and WeChat Moments. He then jumped into the river from the Dongfanghong Bridge. Regarding the issue of whether Zhang was bullied in school, which was of concern to the boy's family and the majority of netizens, the public security organs did not find that he had ever suffered \"school bullying\" after in-depth and detailed investigations and visits.","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748692988161618144_0.jpg","videos":"","hasPublished":true},{"id":"1748696594877141281","name":"李老师不是你老师","createdDate":"2024-01-20 21:18:52","content":"On January 17, in Dapowai Town, Beiliu City, Guangxi, the local government expropriated the villagers' land and handed it over to developers to build shops and sell them to the villagers. However, after the villagers paid the money, the government did not allow them to build houses for ten years.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748696594877141281_0.jpg","hasPublished":true},{"id":"1748716555897045257","name":"李老师不是你老师","createdDate":"2024-01-20 22:38:11","content":"Breaking news\nOn the evening of January 20, an explosion occurred in the underground garage of Bailucheng, Wanyuan Road, Lucheng District, Wenzhou. A large number of special police rushed to the scene and set up a cordon.\nThe owner group said that two explosions occurred.","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748716555897045257_0.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748716555897045257_1.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748716555897045257_2.jpg,/tweet/image/whyyoutouzhele/2024/01/20/1748716555897045257_3.jpg","videos":"","hasPublished":true},{"id":"1748716795790291181","name":"李老师不是你老师","createdDate":"2024-01-20 22:39:08","content":"Explosion site reported online","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748716795790291181_0.jpg","videos":"","hasPublished":true},{"id":"1748719577888965119","name":"李老师不是你老师","createdDate":"2024-01-20 22:50:11","content":"Breaking news, on the evening of January 20, an explosion occurred in a factory near Da'an Town, Juancheng County, Heze City, Shandong Province. The scene showed that the factory had become a ruin. Some residents took photos of their homes that were severely damaged.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748719577888965119_0.jpg","hasPublished":true},{"id":"1748721807870382528","name":"李老师不是你老师","createdDate":"2024-01-20 22:59:03","content":"Some netizens said that the incident happened around 8 o'clock in the evening and the shock wave of the explosion was so strong that the local middle school building was shaking.","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748721807870382528_0.jpg","videos":"","hasPublished":true},{"id":"1748722056382808500","name":"李老师不是你老师","createdDate":"2024-01-20 23:00:02","content":"The video taken by nearby residents showed that the door was broken by the earthquake.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/20/1748722056382808500_0.jpg","hasPublished":false},{"id":"1748726356244873522","name":"李老师不是你老师","createdDate":"2024-01-20 23:17:07","content":"Some netizens said that the factory where the incident occurred was a chemical plant","images":"/tweet/image/whyyoutouzhele/2024/01/20/1748726356244873522_0.jpg","videos":"","hasPublished":false}]