[{"id":"1820492047134105769","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 00:08:21","content":"On August 5, the public account \"Ye Ping\" published an article titled \"Strongly Condemned: Lao Dongyan - Anti-traitor Behavior in the Name of Public Intellectuals\".\nThe article denounced Tsinghua University law professor Lao Dongyan as \"a weak public intellectual who has brought shame to Tsinghua University\" and \"confusing right and wrong and calling a black cat a white cat\".\nIt also said that her remarks \"attacking\" the online ID and online account were \"blinded by greed\" and \"essentially an anti-traitor\" who was \"selling out her country for glory\" in order to obtain a Canadian green card.","images":"/tweet/image/whyyoutouzhele/2024/08/06/1820492047134105769_0.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820492047134105769_1.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820492047134105769_2.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820492047134105769_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1820515716749017165","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 01:42:25","content":"A blogger summarized the recent drug testing incident of Chinese swimmers and questioned Russia's infiltration of public opinion in China. \nHe said that the reason why the Chinese swimming team had 2-3 more inspections than other national teams was because of the previous 23-person contamination incident of the Chinese swimming team, which led to other athletes' distrust of Chinese swimmers. Therefore, WADA's additional testing of the Chinese swimming team is actually to help Chinese athletes prove their innocence to everyone.\nThe focus of the whole thing is that the United States questioned WADA's shielding of China, but some public opinions on the Chinese Internet have obvious traces of \"helping Russia\" rather than \"helping China\". Many contents come from Russian media and Russian self-made false contents, pointing the finger at WADA and accusing WADA of attacking Chinese sports.\nHe said that Russians do hate WADA, but the relationship between China, Russia and WADA is two different things. WADA's executive vice president is actually Chinese, which is also the reason why the United States questioned...","images":"/tweet/image/whyyoutouzhele/2024/08/06/1820515716749017165_0.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820515716749017165_1.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820515716749017165_2.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820515716749017165_3.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"一位博主对近期中国游泳运动员药检事件做了总结，质疑俄罗斯对中国的舆论渗透。 \n他表示，中国游泳队比其他国家队伍多出2-3次检查的原因是因为此前中国游泳队的23人污染事件，导致其他运动员对中国游泳运动员的不信任。因此WADA对中国游泳队的额外检测实际上是帮助中国运动员向所有人证明清白。\n整个事情的焦点是美国质疑WADA包庇中国，但是中文网络上的一些舆论有明显的“帮俄国”而不是“帮中国”的痕迹，很多内容来自俄媒和俄罗斯自制的虚假内容，把矛头指向WADA，指责说WADA为了打击中国体育。\n他表示，俄国人确实恨 WADA，但中俄和WADA的关系是两回事。WADA的常务副主席其实是中国人，这也是美国质疑WADA偏袒中国的地方。","hasPublished":true},{"id":"1820517056988454916","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 01:47:44","content":"On August 4, Zhao Lijian's wife \"Da Cong and Chou Ya Tou\" posted a photo with Zhao, and wrote \"Escaped from death\", saying that Zhao Lijian is the best husband and the best Communist Party member. This Weibo post triggered speculation among netizens.\nThen on the 5th, \"Da Cong and Chou Ya Tou\" posted again, revealing that she had stage 5 breast cancer, but for the sake of the country and the company, she went to Pakistan during the operation to complete the signing with the Prime Minister.","images":"/tweet/image/whyyoutouzhele/2024/08/06/1820517056988454916_0.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820517056988454916_1.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820517056988454916_2.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820517056988454916_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1820553254012387733","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 04:11:34","content":"Some Bangladeshis have taken it upon themselves to guard the gates of Hindu temples and communities to prevent them from being vandalized by radical Muslims.\nAt the same time, all sectors of Bangladesh are calling for an end to hate crimes against religious minorities.","images":"/tweet/image/whyyoutouzhele/2024/08/06/1820553254012387733_0.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820553254012387733_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1820623654142583132","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 08:51:19","content":"On August 6, Tangshan City stated that the issues raised by Chen Zhiwei, the police officer who responded to the Tangshan barbecue restaurant beating case, in his real-name report were all untrue.","images":"/tweet/image/whyyoutouzhele/2024/08/06/1820623654142583132_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1820634285998567623","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 09:33:34","content":"Currently, some people in the system are asked to forward this article.\nSince 2019, the Chinese government has been mobilizing civil servants to forward this type of official account disguised as a personal account.\nCurrently, there is no information about which official media \"Ye Ping\" is under the skin, but people in the system are often asked to forward articles from this public account, including the previous \"Secret History of Tsai Ing-wen\" which came from this public account.\n","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1820640686602924472","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 09:59:00","content":"Bangladeshi people used excavators to demolish the statue of Sheikh Mujibur Rahman, the \"Father of the Nation\" of Bangladesh. People cheered and rushed to trample on the head of the statue. Sheikh Mujibur Rahman was also the father of former Prime Minister Sheikh Hasina.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/06/1820640686602924472_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1820701727966073129","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 14:01:33","content":"On August 5, Chen Zhiwei, the police officer who was seriously derelict in his duty in the \"Tangshan Beating Incident\", reported the case officers in Caofeidian District, Tangshan City, using his ID card and his real name, saying that he was \"taken the blame\" as a grassroots police officer in the case and was wrongfully imprisoned. The truth behind it was different from what netizens saw. On August 5, Tangshan reported the investigation: the problems it reported were not true.\nOn August 6, Chen Zhiwei spoke again, saying that the on-duty leader was leading the relevant police officers to leave their posts and drink outside at the time of the incident, which made it impossible to dispatch the police immediately. After several rounds of communication, he was notified to dispatch the police. Chen Zhiwei also published a work group chat record to confirm (as of the time of posting, the chat record has been deleted)","images":"/tweet/image/whyyoutouzhele/2024/08/06/1820701727966073129_0.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820701727966073129_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/08/06/1820701727966073129_0.jpg,/tweet/video/whyyoutouzhele/2024/08/06/1820701727966073129_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1820707118636577111","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 14:22:58","content":"Chen Zhiwei said that last night someone from Tangshan came to his residence in another province and knocked on the door several times, trying to persuade him to go back to Tangshan to deal with the matter, but he did not open the door for safety reasons. Chen Zhiwei said that he had read the official notice and \"the relevant department that dealt with me at the beginning not only acted as a referee, but also started to pass the buck.\" He also revealed that more information will be sorted out and released in succession.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/06/1820707118636577111_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1820737554901291066","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 16:23:55","content":"Sorting out:\nAccording to official reports and official media reports;\nAt 2:40, Chen Zhizhi and others harassed and beat the woman Wang and her companions in the restaurant\nAt 2:41, the masses called the police\nAt 2:55, the four victims were sent to the hospital by 120\nAt 3:09, the civilian police arrived at the scene (the map shows: the Airport Road Police Station arrived at the scene, and the navigation time takes about 7 minutes)\nIn an interview with the Central Radio and Television Station, Chen Zhiwei lied that he arrived at the scene at 2:46, but actually arrived at the scene at 3:09. Now he revealed in his report that he was blamed and was forced to read out the press release that did not match the actual police time.\nAccording to the work group chat records released by Chen Zhiwei, \"Screenshot 2\" shows that the police station received the notice at 2:45, and at 2:53 they were still discussing who would go out to the police. \"By the way, call Chen Zhiwei. Chen Zhiwei claimed that he \"received the police notice at nearly 3 a.m.\"\nAnd the police called the police at 2:41, and the police called the police at 2:53...","images":"/tweet/image/whyyoutouzhele/2024/08/06/1820737554901291066_0.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820737554901291066_1.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820737554901291066_2.jpg,/tweet/image/whyyoutouzhele/2024/08/06/1820737554901291066_3.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"梳理：\n 据官方通报和官媒报道；\n 2:40分，陈某志伙同他人在餐厅对女子王某和其同伴进行骚扰殴打\n 2:41分，群众报警\n 2:55分，4名被害人由120送医\n 3:09分，民辅警到达现场（地图显示：机场路派出所到达现场，导航时间需7分钟左右）\n 陈志伟在接受总台采访时，曾谎称2:46分就到达现场，实际是3:09分到达现场。如今他在举报中透露，自己是背了黑锅，当时被迫念出了实际出警时间不符的新闻稿。\n 据陈志伟公布的工作群聊记录，“截图二”说明，派出所民警2:45分接到通知，2:53分还在群内讨论谁出警，“顺道喊一下陈志伟，陈志伟自称“近凌晨3点接到出警通知”\n 而2:41分报警，2:53警察仍在群内讨论由谁出警的问题，解释了610案件当晚7分钟的距离，为何出警用了28分钟的原因。","hasPublished":true},{"id":"1820749650619764953","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-06 17:11:59","content":"News on August 5: The State Council: Stimulate consumption vitality in education and training.\nNetizens responded, \"It's really a hassle to cut it down and then put it back up again.\"","images":"/tweet/image/whyyoutouzhele/2024/08/06/1820749650619764953_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]