[{"id":"1844408566213447900","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 00:04:04","content":"On October 4, the European Court of Justice ruled that Afghan women are eligible for asylum.","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844408566213447900_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844408734082269424","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 00:04:44","content":"On October 5, at BYD's Jinan factory, a worker was suddenly crushed to death by a robot while working.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844408734082269424_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844412818323538261","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 00:20:58","content":"On the evening of October 10, some netizens took photos showing that there were still a large number of special police stationed in Jiefang Pavilion.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844412818323538261_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844415845696667715","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 00:32:59","content":"On October 10, Mr. Xu from Guangyuan, Sichuan Province, posted a video saying that when his mother was undergoing surgery at Guangyuan City Hospital of Traditional Chinese Medicine, Dr. An from the hospital's cardiovascular department asked the patient's family for a 3,000 yuan cash red envelope. One month later, Dr. An claimed that the money was \"expert fees\" and insulted Mr. Xu over the phone, calling him \"mentally ill.\" After the incident was exposed, the hospital's leaders called Mr. Xu and said they could return the 3,000 yuan, but he had to delete the online video, but Mr. Xu refused.","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844415845696667715_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844415845696667715_0.jpg,/tweet/video/whyyoutouzhele/2024/10/11/1844415845696667715_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844423067474248136","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 01:01:41","content":"On October 10, the Shenzhen Traffic Police Detachment summoned \"Lin Xiaoyu\" to be investigated for suspected provocation. Lin Xiaoyu is a motorcycle blogger who was recently subjected to irregular and fishing enforcement by the police. The traffic police arbitrarily seized Lin Xiaoyu's motorcycle without sufficient evidence, and tried to fill in Lin Xiaoyu's name by using tricks, which was suspected of fishing enforcement. It is reported that for a long time, many motorcycle fans, including Lin Xiaoyu, have been speaking out on the Internet, using the law to prove the unreasonableness of Shenzhen's ban on motorcycles.","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844423067474248136_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844423067474248136_0.jpg,/tweet/video/whyyoutouzhele/2024/10/11/1844423067474248136_1.jpg,/tweet/video/whyyoutouzhele/2024/10/11/1844423067474248136_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844424850259181647","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 01:08:46","content":"On October 9, a Douyin blogger posted a video about Xiaohongshu’s suspected theft of personal privacy. The blogger said that among the “people you may know” on Xiaohongshu registered with a foreign mobile phone number, there were actually WeChat friends.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844424850259181647_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844430202392199241","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 01:30:02","content":"On October 8, in Qitaihe City, Heilongjiang Province, a netizen posted a video saying that a citizen found a baby in a trash can. This matter has attracted attention. The video shows that in the trash can, a baby is lying in the garbage, without any clothes wrapped around her, kicking her legs from time to time, and there is a black garbage bag behind her. The video publisher said that it was a girl, who was probably born not long ago, and \"was taken away by the maternal and child health care center.\" The video location is Hudong Home in Qitaihe City.\nOn October 8, a reporter asked Qitaihe Maternal and Child Health Hospital to verify the matter. A staff member said that the baby girl was indeed sent to the hospital, and other circumstances were not clear for the time being. According to Elephant News, an insider said that the baby girl still had an umbilical cord. Qitaihe Maternal and Child Health Hospital staff said that the baby girl was in the intensive care unit and the child was fine.\nThe reporter learned from the local community staff that the incident occurred in Area A of Hudong Home. A staff member of the Hudong Sub-district Office told reporters that the public security organs have intervened in the investigation. \"Next...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844430202392199241_0.jpg,/tweet/video/whyyoutouzhele/2024/10/11/1844430202392199241_1.jpg,","hasFullContentTranslated":false,"fullContent":"10月8日，黑龙江七台河市，有网友发视频称，市民在垃圾桶里发现一个婴儿。此事引发关注。视频显示，垃圾桶里，一个婴儿躺在垃圾里，身上没有包裹衣物，不时蹬着腿，身后有一个黑色垃圾袋。视频发布者称，是个女孩，估计刚出生不久，“被妇幼抱走了”。视频定位是七台河市湖东家园。\n10月8日，有记者向七台河市妇幼保健院求证此事，一名工作人员表示，女婴的确被送到了该院，其他情况暂不清楚。据大象新闻，知情人称，女婴身上还有脐带。七台河市妇幼保健院工作人员称，女婴在重症监护室，孩子没事。\n记者从当地社区工作人员处了解到，事情发生地点在湖东家园A区。湖东街道办事处的一名工作人员告诉记者，目前公安机关已经介入调查。“下午在查看监控视频，找是谁丢的孩子。”之后，该工作人员告诉记者，此事属于刑事案件，目前刑警队已经介入。“丢弃孩子的人已经找到了，孩子已经被送到妇幼检查去了。目前案件正在侦办当中。”","hasPublished":true},{"id":"1844431816251371661","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 01:36:27","content":"On October 9, the Wall Street Journal published an article arguing that the current widespread stimulus measures may be constrained by a fundamental problem, that is, Xi Jinping's rejection of the Western model. The article said that we should stop blaming the COVID-19 pandemic, geopolitical tensions, or weak overseas demand. In the article, Rong Danie, founder of Rhodium Group, believes that \"many analysts dare not apply the logic that applies to everyone to the Chinese government,\" and \"without market reforms, growth will stagnate.\"","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844431816251371661_0.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844431816251371661_1.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844431816251371661_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844432801858568446","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 01:40:22","content":"On October 6, in Ningbo, Zhejiang, five passengers called an online car-hailing company and requested to overload the car. After being refused, they gave a bad review and threatened the driver: If you don’t leave now, your car will never leave again.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844432801858568446_0.jpg,/tweet/video/whyyoutouzhele/2024/10/11/1844432801858568446_1.jpg,/tweet/video/whyyoutouzhele/2024/10/11/1844432801858568446_2.jpg,/tweet/video/whyyoutouzhele/2024/10/11/1844432801858568446_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844434852168585259","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 01:48:31","content":"A woman in Guangzhou was arrested by the police in Yangxin County, Binzhou City, Shandong Province for reselling prescription painkillers, including tramadol hydrochloride sustained-release tablets and oxycodone acetaminophen tablets, for 260 yuan in a group of patients. She was suspected of drug trafficking.","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844434852168585259_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844483419033481641","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 05:01:30","content":"Inflation in the United States has fallen slower than expected, and the possibility of a rate cut by the Federal Reserve in November has increased. According to the U.S. Consumer Price Index (CPI) report released on the morning of October 10, Eastern Time, the U.S. CPI rose 2.4% year-on-year in September, higher than expected. It was 2.5% lower than the previous value, reaching the lowest level since the beginning of 2021, and the month-on-month growth rate was 0.2%, which was consistent with the previous value, but the month-on-month and year-on-year growth rates were 0.1 percentage points higher than expected. The number of applications for unemployment benefits increased significantly, reaching 258,000, far higher than the expected 230,000. The CME Fed Watch tool shows that the market currently expects the probability of the Federal Reserve not cutting interest rates in November to be 15%, and the probability of a 25 basis point cut to be 85%.","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844483419033481641_0.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844483419033481641_1.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844483419033481641_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844488187458224458","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 05:20:27","content":"Ma Ying-jeou, the former president of the Republic of China, temporarily announced his absence from the Double Tenth National Day celebrations. He said at a press conference that the reason for his absence was that the current president, Lai Ching-te,'s \"new two-state theory\" violated the constitution and would put the Taiwanese people in danger. He criticized Lai Ching-te for causing tension in the Taiwan Strait and calling him a \"troublemaker.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844488187458224458_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844507346048897184","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 06:36:35","content":"On October 10, The Economist published a cover article titled \"The Trumpification of American Policy\". The article stated that no matter who is elected in this election, the \"Trumpification\" of American policy is inevitable. The article mentioned that in this election, whether it is trade tariffs, energy policy, or diplomacy with China and the Middle East, Harris is moving closer to Trump's policies during his first term. The only big difference between the two sides may be support for Ukraine. The Economist analyzed that Harris's political theft has political significance, and quietly taking Trump's position may help her win.","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844507346048897184_0.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844507346048897184_1.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844507346048897184_2.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844507346048897184_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844510173726920882","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 06:47:49","content":"On October 8, in Leshan, Sichuan, a boy fought with his mother for a mobile phone at the school gate and dragged her to the ground. According to insiders, the incident originated from the boy's grandfather buying a mobile phone for his grandson without telling his mother. When the boy's mother found out, she wanted to confiscate it, which led to a dispute.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844510173726920882_0.jpg,/tweet/video/whyyoutouzhele/2024/10/11/1844510173726920882_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844511125360058809","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 06:51:36","content":"On October 2, 2024, a netizen said that more than 20 members of his family had diarrhea and other food poisoning symptoms after dining at the Xingfu Jiayan Chinese Restaurant in Mianzhu City, Deyang City, Sichuan Province on October 1, and said that other customers also suffered from food poisoning in the restaurant. Other netizens said that a woman in her 50s died after suffering from food poisoning. As of October 9, 2024, the restaurant involved has suspended business, and an investigation team jointly established by the Public Security Bureau, Disease Control Bureau, Street Office and Municipal Supervision Bureau has launched an investigation and verification.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/11/1844511125360058809_0.jpg,/tweet/video/whyyoutouzhele/2024/10/11/1844511125360058809_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844512709183930377","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 06:57:53","content":"On October 10, Lianhe Zaobao, Bloomberg and other media reported that four Taiwanese employees of Foxconn Zhengzhou Factory were arrested. It is reported that the four arrested Taiwanese employees belong to the A business group (Apple production line) of Foxconn Zhengzhou Factory and have been arrested by local police since January this year. They were accused of \"taking bribes outside of public service\", and two of them were also accused of misappropriating funds at will.","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844512709183930377_0.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844512709183930377_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1844622710426493347","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 14:15:00","content":"According to Caixin.com, on October 9, Indonesian President Joko Widodo pointed out at the 39th Indonesia Trade Expo that measures should be taken to protect the domestic market and prevent the impact of China's overcapacity on Indonesia, especially in the fields of science and technology and renewable energy.","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844622710426493347_0.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844622710426493347_1.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844622710426493347_2.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844622710426493347_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1844660249568895262","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-11 16:44:10","content":"On October 11, in Xinxiang, Henan, medical staff from the Fourth People's Hospital gathered at the gate of the hospital and held up a banner saying \"We want to live\" to demand their wages.\nIt is reported that the hospital has been in arrears with medical staff wages for nine months.","images":"/tweet/image/whyyoutouzhele/2024/10/11/1844660249568895262_0.jpg,/tweet/image/whyyoutouzhele/2024/10/11/1844660249568895262_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]