[{"id":"1762901895713059262","name":"李老师不是你老师","createdDate":"2024-02-29 02:05:39","content":"February 28, Xiangtan, Hunan. At Jinquan School in Lishan Town, Xiangxiang City, a female teacher beat and scolded a student because the student could not do the homework. The video shows that the teacher slapped the student's face with the homework book in her hand and pulled the student's ear.\nOn the same day, the staff of the People's Government of Lishan Town, Xiangxiang City responded: We attach great importance to it and have set up a special working group.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/29/1762901895713059262_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762903009778896949","name":"李老师不是你老师","createdDate":"2024-02-29 02:10:05","content":"The old man said that he was detained by the police for 15 days and his leg was injured for defending his rights. He now wants to go to the town government to petition.","images":"/tweet/image/whyyoutouzhele/2024/02/29/1762903009778896949_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1762903009778896949_1.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1762903009778896949_2.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1762903009778896949_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763146734560063711","name":"李老师不是你老师","createdDate":"2024-02-29 18:18:33","content":"Recently, a Russian soldier's \"customized shells\" business has appeared on Bilibili.\nA suspected Russian soldier named \"Grisha Grisha Putin\" posted a video collection on Bilibili, showing the \"two-dimensional shells\" customized for Chinese netizens in recent times. The shells have the sponsor's ID and avatar written on them.\nAccording to the introduction in the comment area, the price is 15 euros for mortars, 30 euros for 122mm howitzers, and 300 euros for shooting videos of these shells being fired.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/29/1763146734560063711_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763149250735612177","name":"李老师不是你老师","createdDate":"2024-02-29 18:28:33","content":"According to information provided by netizens, Grisha Grisha Putin @ZShakerCentral was previously a game anchor and had participated in competitive games of \"Hearts of Iron 4\". He once had 32,000 followers on Twitch.\nOn February 4, 2023, Grisha Grisha first live-streamed the game \"Hearts of Iron 4\" on PMC Wagner Center, and performed \"How Russia defeated NATO in a short time\" through the game, which caused quite a controversy.\nOn the cover of his homepage, there is a photo of him and Prigozhin, the leader of Wagner who died in a plane crash.","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763149250735612177_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763149250735612177_1.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763149250735612177_2.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763149250735612177_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763153745041293343","name":"李老师不是你老师","createdDate":"2024-02-29 18:46:25","content":"It is reported that he started this \"custom shell\" business a few months ago. At first, he simply wrote the sponsor's ID. Recently, he was asked to draw Japanese two-dimensional patterns on the shells. He began to accept more two-dimensional orders from all over the world.\nSome netizens asked why he drew these anime characters on the shells.\nGrisha Grisha Putin replied, \"I will draw if they pay me.\"","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763153745041293343_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763153745041293343_1.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763153745041293343_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763155254240063890","name":"李老师不是你老师","createdDate":"2024-02-29 18:52:25","content":"His \"two-dimensional bombs\" quickly gained popularity on Chinese social networks. He then opened accounts on multiple Chinese social platforms and expanded this business to China.\nHe uploaded his first work on the B station platform on February 25, and as of February 29, the work had been played 836,000 times.\nTo thank Chinese fans, Grisha Grisha Putin also took photos holding the five-star red flag in front of the Lenin statue and the trench, which received a lot of praise.\nBut some netizens questioned why his IP was displayed in Shanghai and Malaysia. In response, Grisha Grisha Putin explained that the content posted on Chinese social platforms was produced by his Chinese friends.\nSome netizens asked in the comment area how to customize this business, and his account replied that they could go to X (Twitter) or send him a private message.","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763155254240063890_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763155254240063890_1.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763155254240063890_2.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763155254240063890_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763156030676988097","name":"李老师不是你老师","createdDate":"2024-02-29 18:55:30","content":"In fact, since the war between Russia and Ukraine began, both sides have provided \"customized shells\" services worldwide.\nThe blogger @NiKiTa_32156, who has been reporting on the war between Russia and Ukraine for a long time, also provided \"customized shells\" services to the Ukrainian army.\nI myself have also been given one.","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763156030676988097_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763169056180322437","name":"李老师不是你老师","createdDate":"2024-02-29 19:47:15","content":"On February 28, the second floor of Building 15 of Tianma Apartment of Hunan Normal University was full of signs, accusing Jiang Hongxin, secretary of the Party Committee of Hunan Normal University, of inaction, profit transfer, retaliation and destruction of the production and operation environment.\nAccording to the report letter, the reporter He Huili contracted the restaurant on the second floor of Building 15 of Tianma Apartment. In mid-December 2022, she found that there were serious cracks on the roof, cracks in the beams, water leakage and other safety hazards.\nAfter inspection by two units, the third floor of Building 15 was a dangerous building and no longer had the building conditions for a gym. However, because the owner of the gym on the third floor was the nephew of Jiang Changzhong, the former director of the Hunan Education Department, the school turned a blind eye to the dangerous building and did not do any reinforcement for more than a year. As a result, the first and second floors could not apply for fire inspection permits.\nAt the same time, the school was arrogant and tried to use means to drive away the cafeteria on the second floor. So there was a scene in the picture.\nAt the same time, the flyer stated that students could come to the restaurant for free for three days with this report letter flyer.","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763169056180322437_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763169056180322437_1.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763169056180322437_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763179282271027563","name":"李老师不是你老师","createdDate":"2024-02-29 20:27:53","content":"From February 20 to 27, a factory shed collapsed due to rain, snow and freezing weather in an e-commerce town in northern Jiangsu.","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763179282271027563_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763179282271027563_1.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763179282271027563_2.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763179282271027563_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763181137763987678","name":"李老师不是你老师","createdDate":"2024-02-29 20:35:16","content":"At present, the slogan has been cleared away. There is a notice posted on the site that the entire building 15 will be closed for rectification.","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763181137763987678_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763181137763987678_1.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763181137763987678_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763185756862865705","name":"李老师不是你老师","createdDate":"2024-02-29 20:53:37","content":"February 29, Jieyang, Guangdong. A lawyer exposed the land occupation by the village party secretary of Pi Lao Village, Jieyang.\nIn the video, the villa of the village party secretary is magnificent, with red walls and green tiles, like an imperial palace. It is said that the village party secretary owns 60 mu of land in the local area, with a residential land of nearly 7 mu, of which 40 mu has been built with high-rise buildings, villas and factories.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/29/1763185756862865705_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763187578847608960","name":"李老师不是你老师","createdDate":"2024-02-29 21:00:51","content":"Some netizens began to count and question why the mainstream media in China did not report the news that the US military set itself on fire in front of the Israeli embassy.","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763187578847608960_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763187578847608960_1.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763202037334888555","name":"李老师不是你老师","createdDate":"2024-02-29 21:58:19","content":"On the 28th, the Qingcheng District People's Government issued a notice stating that after investigation by the public security organs, it was confirmed that the student left home at 18:53 that night and walked alone from the school gate to the fifth floor stairwell of the school teaching building, climbed over the corridor guardrail of the school teaching building and fell to his death. He did not come into contact with other people during the period, and homicide was ruled out. \nOn the same day, the family members posted a video saying that they watched the edited surveillance at the police station and refused to sign, questioning why the government issued a notice immediately.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/29/1763202037334888555_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763202363005755479","name":"李老师不是你老师","createdDate":"2024-02-29 21:59:36","content":"https://t.co/LZAIsfx7tu","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763202363005755479_0.jpg","videos":"","hasPublished":false},{"id":"1763204764353925222","name":"李老师不是你老师","createdDate":"2024-02-29 22:09:09","content":"On February 29 (released), some parents of Wenchang Middle School held a banner printed with \"Wenchang Middle School, give my son an explanation\" and defended their rights outside the school.\nAccording to a screenshot of a group chat of \"Wenchang Middle School Elite Students\" circulating online, the parents of the student who fell from the building had a bad relationship and had been getting divorced. His father could not afford to pay 300,000 yuan, which resulted in his child not being able to enter the school's top class. The child fell to his death due to excessive pressure.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/29/1763204764353925222_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763204840795103239","name":"李老师不是你老师","createdDate":"2024-02-29 22:09:27","content":"https://t.co/JAOSDT91MH","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763204840795103239_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763204840795103239_1.jpg","videos":"","hasPublished":false},{"id":"1763211100961587669","name":"李老师不是你老师","createdDate":"2024-02-29 22:34:20","content":"On February 28, Xi'an Olympic Sports Kindergarten announced that the Xi'an Shooting and Archery Sports Management Center had cut off the supply to the kindergarten, causing the kindergarten to temporarily close.\nIn the early morning of the 29th, parents were still in the kindergarten to deal with relevant transfer or withdrawal matters.\nIt is reported that the power outage was caused by the complex economic disputes and lawsuits between the Xi'an Shooting and Archery Sports Management Center, the owner of the house where the kindergarten is located, and the Minnesota company that rented the house to the kindergarten.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/29/1763211100961587669_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763211370508571003","name":"李老师不是你老师","createdDate":"2024-02-29 22:35:24","content":"https://t.co/jbrYBH4DAt","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763211370508571003_0.jpg","videos":"","hasPublished":false},{"id":"1763223124974227851","name":"李老师不是你老师","createdDate":"2024-02-29 23:22:06","content":"The \"low-end population\" remaining in the corners of Beijing\nRecently, a blogger visited the living conditions of the lower-class people in Beijing. In the blogger's lens, some people live in cars to save rent, some people have lived in abandoned boats for more than a year, some people lie on the table in the library overnight, and some workers even sleep on the floor.\nThe blogger found a local professional homeless man \"Li Bangzhu\" and followed Li Bangzhu's daily life. Li Bangzhu said that in order to save rent, he spent 25,000 yuan to buy a second-hand car, and now he has lived in the car for two or three years. Usually, Li Bangzhu will do odd jobs in Majuqiao to make a living. When asked why he didn't find a long-term job, Li Bangzhu said that long-term workers may encounter the situation of less wages from the boss, and daily workers are relatively more stable. Even if they are cheated, they only lose one day's wages.\nThe blogger thinks that Li Bangzhu's life is completely flat, but Li Bangzhu doesn't think so. He thinks he is...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/29/1763223124974227851_0.jpg","hasFullContentTranslated":false,"fullContent":"残存在北京角落里的“低端人口”们\n近日，一位博主实地探访了北京底层人的生存现状。在博主的镜头里，有人为了省房租住在车里，有的人在废弃的船里住了一年多，有的人趴在图书馆的桌上过夜，还有的工人甚至席地而睡。\n博主找到当地一位职业流浪汉“李帮主”并跟拍了李帮主的一天的生活。李帮主称，他为了节省房租，便花费25000元买了辆二手车，如今已车里住了两三年。平时，李帮主会在马驹桥打零工维持生计。当被问道什么不去找个长期的工作时，李帮主称长期工可能会遇到老板少发工资的情况，而日结工相对而言更加稳定，即使被骗了，也只是损失一天的工钱。\n 博主认为李帮主这样的生活算是彻底躺平了，但李帮主不这么认为，他觉得自己是彻底觉醒了，他很享受当下无拘无束的生活，他不想随波逐流，过着被安排的人生，不仅如此，无拘无束的流浪生活还让他告别了复杂的人际关系。\n 视频的最后，深夜的公交车里，李帮主坐在前排，朗读着他最爱的书籍，到此，影片结束。","hasPublished":false},{"id":"1763224342328901714","name":"李老师不是你老师","createdDate":"2024-02-29 23:26:56","content":"By the way, this video has been removed.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763229327892635858","name":"李老师不是你老师","createdDate":"2024-02-29 23:46:45","content":"On February 26, a murder occurred in Fengze District, Quanzhou, Fujian. The video circulating online showed that the suspected criminal suspect had posted a circle of friends holding a bloody machete during the crime, saying: \"My beloved, my beloved, goodbye forever.\"\nAnother video showed that the police and Quanzhou emergency personnel were handling the scene, an emergency stretcher was pushed into the scene, and some people were escorted out.\nThe chat screenshots circulating online said that the suspected murderer committed the crime due to an emotional dispute, and there was more than one person who died. The woman worked in a kindergarten, and the murderer tried to enter the kindergarten to commit the crime, but was blocked by the security guard, who was then stabbed to death. Then the murderer stabbed the woman and then drove to stab the nursery teacher's new boyfriend.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/29/1763229327892635858_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1763229585699655850","name":"李老师不是你老师","createdDate":"2024-02-29 23:47:47","content":"https://t.co/TazX1sAecm","images":"/tweet/image/whyyoutouzhele/2024/02/29/1763229585699655850_0.jpg,/tweet/image/whyyoutouzhele/2024/02/29/1763229585699655850_1.jpg","videos":"","hasPublished":false}]