[{"id":"1800593470119371030","name":"李老师不是你老师","createdDate":"2024-06-12 02:18:31","content":"June 11, Dasi Town, Tianjin. The man's farm and house were demolished, and he had no choice but to kneel in front of the local government to defend his rights. \"Please leave us a way out, I beg you.\" It is understood that the man and his wife are both disabled, and the man is also suffering from cancer.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/12/1800593470119371030_0.jpg,/tweet/video/whyyoutouzhele/2024/06/12/1800593470119371030_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800594193141915754","name":"李老师不是你老师","createdDate":"2024-06-12 02:21:23","content":"June 11, Hengshui, Hebei. The Huizhong Yanyuan real estate project was left unfinished, and the owners protested their rights in front of the Raoyang County Government.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/12/1800594193141915754_0.jpg,/tweet/video/whyyoutouzhele/2024/06/12/1800594193141915754_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800595109714563105","name":"李老师不是你老师","createdDate":"2024-06-12 02:25:02","content":"On June 10, in Zhoukou, Henan, a gray sedan ran amok on the street, ramming directly into a police car that came to intercept it and then fled. It is reported that the driver has been detained by the police.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/12/1800595109714563105_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800651492409377170","name":"李老师不是你老师","createdDate":"2024-06-12 06:09:04","content":"June 10, Xinjiang. It was reported online that Xinjiang Goens Silicon Technology Co., Ltd. owed hundreds of truck drivers more than 3 million yuan in freight, and the drivers went to Xinjiang to claim the freight.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/12/1800651492409377170_0.jpg,/tweet/video/whyyoutouzhele/2024/06/12/1800651492409377170_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800653057174225062","name":"李老师不是你老师","createdDate":"2024-06-12 06:15:18","content":"On June 11, a blogger exposed the sale of female aphrodisiac drugs on Pinduoduo. Searching for keywords such as \"breakup water, rice medicine, let her take the initiative\" will reveal related products, with product covers or descriptions usually containing words such as \"easy to use\", \"urgently needed for nightclubs\" or \"can be mixed with alcohol\".","images":"/tweet/image/whyyoutouzhele/2024/06/12/1800653057174225062_0.jpg,/tweet/image/whyyoutouzhele/2024/06/12/1800653057174225062_1.jpg,/tweet/image/whyyoutouzhele/2024/06/12/1800653057174225062_2.jpg,/tweet/image/whyyoutouzhele/2024/06/12/1800653057174225062_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800654553219543327","name":"李老师不是你老师","createdDate":"2024-06-12 06:21:14","content":"On June 11, the State Administration for Market Regulation issued the \"Guiding Opinions on Strengthening Party Building Work among Online Delivery Workers\", proposing to strengthen grassroots party building work among online delivery workers and guide them to \"be grateful to the Party, listen to the Party, and follow the Party.\"","images":"/tweet/image/whyyoutouzhele/2024/06/12/1800654553219543327_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800705579138285965","name":"李老师不是你老师","createdDate":"2024-06-12 09:44:00","content":"On June 11, the internet celebrity \"Tie Tou\" responded to the graffiti and urination incident at the Yasukuni Shrine during a live broadcast, saying that he felt a little regretful and that if he followed the opinions of netizens now, he should be more \"appropriate\" and it would be great if he could cause irreversible damage to the words on the stone tablet.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/12/1800705579138285965_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800788000156033502","name":"李老师不是你老师","createdDate":"2024-06-12 15:11:30","content":"A victim of the attack in Jilin Beishan Park described the scene at that time","images":"/tweet/image/whyyoutouzhele/2024/06/12/1800788000156033502_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800821161548497208","name":"李老师不是你老师","createdDate":"2024-06-12 17:23:17","content":"On June 12, the Taiwan Affairs Office of the State Council responded to Nvidia CEO Huang Renxun's statement that \"Taiwan is one of the most important countries in the world\" at a regular press conference, saying that he hoped he would learn more.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/12/1800821161548497208_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800862156633846068","name":"李老师不是你老师","createdDate":"2024-06-12 20:06:11","content":"Recently, a netizen on Zhihu asked, \"Friends who are currently working at China Railway, is the situation serious?\" Some netizens who work at China Railway said that the situation is very serious, not only have their salaries been cut, but they have also been in arrears of wages.","images":"/tweet/image/whyyoutouzhele/2024/06/12/1800862156633846068_0.jpg,/tweet/image/whyyoutouzhele/2024/06/12/1800862156633846068_1.jpg,/tweet/image/whyyoutouzhele/2024/06/12/1800862156633846068_2.jpg,/tweet/image/whyyoutouzhele/2024/06/12/1800862156633846068_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800862605994787291","name":"李老师不是你老师","createdDate":"2024-06-12 20:07:58","content":"June 11, Changchun, Jilin. A netizen reported that his mother withdrew money from the Zunyi Road Branch of Jilin Bank, with a total amount of less than 100,000 yuan, and was told that she needed the approval of the local police station.\nOn the 12th, the bank responded that this move was to prevent telecommunications fraud.","images":"/tweet/image/whyyoutouzhele/2024/06/12/1800862605994787291_0.jpg,/tweet/image/whyyoutouzhele/2024/06/12/1800862605994787291_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800864980746621246","name":"李老师不是你老师","createdDate":"2024-06-12 20:17:24","content":"On June 11, China Business News reported that recently, economist Zhu Changzheng wrote an article stating that the starting point of farmers' pension benefits is very low. When the basic pension insurance systems for urban and rural residents were merged ten years ago, the basic pension standard started at only 55 yuan per person per month. After several increases, it will be 103 yuan by 2023.","images":"/tweet/image/whyyoutouzhele/2024/06/12/1800864980746621246_0.jpg,/tweet/image/whyyoutouzhele/2024/06/12/1800864980746621246_1.jpg,/tweet/image/whyyoutouzhele/2024/06/12/1800864980746621246_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800865602191638711","name":"李老师不是你老师","createdDate":"2024-06-12 20:19:52","content":"On June 11, Tianjin. Workers of Xuhong Construction Engineering Co., Ltd. knelt in front of the project manager to demand their wages. The workers said: \"We were not emotional at first, but then the project manager said, 'You did the work yourself, you deserve it.' I was owed more than 20,000 yuan, and more than 40 of us workers were owed about 600,000 to 700,000 yuan.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/12/1800865602191638711_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800868292854444099","name":"李老师不是你老师","createdDate":"2024-06-12 20:30:34","content":"Recently, in Xi'an, Shaanxi, a Tesla was scratched with the words \"Is it shameful to drive a domestic car?\"","images":"/tweet/image/whyyoutouzhele/2024/06/12/1800868292854444099_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800873009336500449","name":"李老师不是你老师","createdDate":"2024-06-12 20:49:18","content":"Recently, the teenager \"Little Brother\" continued to post videos saying that because of the quality of the canteen food, he went to the school gate to give a speech. The school ridiculed him for his behavior of smearing the school and denying the labor of the canteen aunt. At the same time, the school put pressure on his father to delete the video. Afterwards, the teenager posted a video to respond that the school would only hold meetings and talk nonsense, but would not solve the problem. But he said he would not stop there \"because I can't tolerate myself living in such a garbage environment\" Although the teenager is young, his behavior of not fearing power and daring to speak for the interests of his classmates has won the support and touching of the majority of netizens. Netizens have called for: \"Protect our little brother\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/12/1800873009336500449_0.jpg,/tweet/video/whyyoutouzhele/2024/06/12/1800873009336500449_1.jpg,/tweet/video/whyyoutouzhele/2024/06/12/1800873009336500449_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800880841184186737","name":"李老师不是你老师","createdDate":"2024-06-12 21:20:25","content":"Today in History\nOn June 12, 2016, the People's Daily published an article stating that China is expected to enter the high-income stage from 2024.\nThe article stated that after decades of sustained and rapid development, China is full of confidence in the future: as long as there are no subversive mistakes in politics, no devastating blows in the economy, and no fault-like fluctuations in the system, in another six or seven years, China will successfully cross the \"middle-income trap\" without suspense. By then, the first centenary goal will have been achieved and a well-off society in all respects will have been built.","images":"/tweet/image/whyyoutouzhele/2024/06/12/1800880841184186737_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800882328341999779","name":"李老师不是你老师","createdDate":"2024-06-12 21:26:20","content":"What do you think of the Taiwan Affairs Office of the State Council's hope that Nvidia CEO Huang Renxun will make up for the Taiwan issue?\nNetizen: Isn't making up for the Taiwan issue prohibited?","images":"/tweet/image/whyyoutouzhele/2024/06/12/1800882328341999779_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1800904847270769082","name":"李老师不是你老师","createdDate":"2024-06-12 22:55:49","content":"On June 12, a class majoring in drama and film performance at Anhui University of the Arts showed the Palestinian flag to the audience after the school's final performance.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/12/1800904847270769082_0.jpg,/tweet/video/whyyoutouzhele/2024/06/12/1800904847270769082_1.jpg,/tweet/video/whyyoutouzhele/2024/06/12/1800904847270769082_2.jpg,","hasFullContentTranslated":true,"hasPublished":true}]