[{"id":"1854200635660653051","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 00:34:15","content":"Correction: the location is Huiyang District Government","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854225695641141327","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 02:13:50","content":"November 2, Xiamen, Fujian. On the day of delivery, the owners of Jianfa Manyue Changtan Community protested against the developer's reduction of specifications. The houses in the community have a lot of quality problems and safety hazards. It is understood that the opening price of the property was 42,000 yuan per square meter, and some of the houses on sale have fallen below 30,000 yuan per square meter.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854225695641141327_0.jpg,/tweet/video/whyyoutouzhele/2024/11/07/1854225695641141327_1.jpg,/tweet/video/whyyoutouzhele/2024/11/07/1854225695641141327_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854233877109227992","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 02:46:20","content":"On November 1, in Leshan, Sichuan, the owners of the Laifushi community protested against the collusion between the property management company and the property management committee to increase the property management fee. It is understood that the property management company of Laifushi community plans to increase the property management fee from 1.1 yuan per square meter to 1.3 yuan during the contract period. The owners believe that this price increase violates the contract agreement and the \"spirit of the contract\" and questioned the fact that the property management committee did not hold an owners' meeting before soliciting votes at their homes. They believe that there is a lack of supervision mechanism and that many owners are completely unaware of the price increase.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854233877109227992_0.jpg,/tweet/video/whyyoutouzhele/2024/11/07/1854233877109227992_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854261084821356919","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 04:34:27","content":"Recently, a certain anti-counterfeiting blogger released a video of anti-counterfeiting at the headquarters of Bestore. The blogger pointed out that the ingredient lists of many Bestore products were fake, lotus root powder was mixed with cassava starch, and no \"powder\" was detected in the hot and sour noodles. According to the video released by the blogger, during the suspected communication with Bestore, the team members were locked by the neck by security guards and their filming equipment was snatched away. At present, Bestore has been filed for investigation.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854261084821356919_0.jpg,/tweet/video/whyyoutouzhele/2024/11/07/1854261084821356919_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854282673692524758","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:00:14","content":"On November 6, US Vice President Kamala Harris gave a concession speech, admitting that she had lost the US election.\n\"My heart is filled with gratitude for your trust. The result is not what we wanted, but the light of America will always shine.\" \"I am very proud of this campaign.... I admit defeat, but I will not give up the fight.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854282673692524758_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854282944715587677","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:01:19","content":"On the evening of November 6, Germany's \"traffic light\" coalition government was facing disintegration. After German Chancellor Scholz fired his Finance Minister Lindner due to political differences, the FDP announced its withdrawal from the government. German Chancellor Scholz made a speech, saying that a vote of confidence in his government would be held on January 15, 2025. According to the German Constitution, if the vote of confidence fails, a general election will be held in advance.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854282944715587677_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854285221799026970","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:10:22","content":"Before the crisis, Lindner, chairman of the neoliberal Free Democratic Party (FDP), wrote a document proposing \"economic recovery through partial fundamental revision of key political decisions\" - by cutting corporate taxes, rolling back climate regulations and reducing welfare. These proposals were seen as provocative and irreconcilable with the proposals of his coalition partners, Chancellor Schulz's center-left Social Democratic Party (SPD) and the environmentalist Green Party.\nGerman Chancellor Olaf Scholz explained why he fired Finance Minister Lindner tonight: \"He was too selfish and betrayed my trust too much\", \"He refused too many compromises and sometimes even exceeded my political beliefs\", \"Too focused on his own political interests and party\", \"Irresponsible\".","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854285221799026970_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854290414460649480","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:31:00","content":"November 5, Fukang, Xinjiang. A man who worked outside Xinjiang was owed 20,000 yuan in wages. He went to the local labor bureau to negotiate, but the bureau staff replied that they \"could not control private bosses\" and told him to sue in court. The man said: \"I don't understand what the point of setting up this agency is if the state cannot control the wage arrears issue.\"","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854290414460649480_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854295018434879981","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:49:18","content":"On November 4, the owners of Tianyue Fenghua Community went to the sales office to defend their rights. It is understood that the community was built by the central enterprise COFCO Group, and there were many problems such as delayed delivery, unauthorized reduction of standards, and inconsistent goods.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854295018434879981_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854295018434879981_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854393855417917746","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 13:22:02","content":"On November 7, Xi Jinping sent a congratulatory message to US President-elect Trump.\nXi Jinping pointed out that China and the United States will benefit from peace and both will suffer from conflict. A stable, healthy and sustainable development of China-US relations is in the common interests of both countries...","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854393855417917746_0.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854393855417917746_1.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854393855417917746_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854449679075029390","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 17:03:52","content":"November 5, Dalian, Liaoning. A netizen posted a video saying that his relative was hit by a Japanese ship in the waters near Dalian Wafangdian when he was out to sea, and many people on the ship lost contact.\nThe Maritime Safety Administration responded: Search and rescue are in progress, and the specific number of people missing has not yet been determined.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854449679075029390_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854449679075029390_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]