[{"id":"1854200635660653051","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 00:34:15","content":"Correction: the location is Huiyang District Government","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854225695641141327","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 02:13:50","content":"November 2, Xiamen, Fujian. On the day of delivery, the owners of Jianfa Manyue Changtan Community protested against the developer's reduction of specifications. The houses in the community have a lot of quality problems and safety hazards. It is understood that the opening price of the property was 42,000 yuan per square meter, and some of the houses on sale have fallen below 30,000 yuan per square meter.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854225695641141327_0.jpg,/tweet/video/whyyoutouzhele/2024/11/07/1854225695641141327_1.jpg,/tweet/video/whyyoutouzhele/2024/11/07/1854225695641141327_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854233877109227992","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 02:46:20","content":"On November 1, in Leshan, Sichuan, the owners of the Laifushi community protested against the collusion between the property management company and the property management committee to increase the property management fee. It is understood that the property management company of Laifushi community plans to increase the property management fee from 1.1 yuan per square meter to 1.3 yuan during the contract period. The owners believe that this price increase violates the contract agreement and the \"spirit of the contract\" and questioned the fact that the property management committee did not hold an owners' meeting before soliciting votes at their homes. They believe that there is a lack of supervision mechanism and that many owners are completely unaware of the price increase.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854233877109227992_0.jpg,/tweet/video/whyyoutouzhele/2024/11/07/1854233877109227992_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854261084821356919","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 04:34:27","content":"Recently, a certain anti-counterfeiting blogger released a video of anti-counterfeiting at the headquarters of Bestore. The blogger pointed out that the ingredient lists of many Bestore products were fake, lotus root powder was mixed with cassava starch, and no \"powder\" was detected in the hot and sour noodles. According to the video released by the blogger, during the suspected communication with Bestore, the team members were locked by the neck by security guards and their filming equipment was snatched away. At present, Bestore has been filed for investigation.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854261084821356919_0.jpg,/tweet/video/whyyoutouzhele/2024/11/07/1854261084821356919_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854282673692524758","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:00:14","content":"On November 6, US Vice President Kamala Harris gave a concession speech, admitting that she had lost the US election.\n\"My heart is filled with gratitude for your trust. The result is not what we wanted, but the light of America will always shine.\" \"I am very proud of this campaign.... I admit defeat, but I will not give up the fight.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854282673692524758_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854282944715587677","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:01:19","content":"On the evening of November 6, Germany's \"traffic light\" coalition government was facing disintegration. After German Chancellor Scholz fired his Finance Minister Lindner due to political differences, the FDP announced its withdrawal from the government. German Chancellor Scholz made a speech, saying that a vote of confidence in his government would be held on January 15, 2025. According to the German Constitution, if the vote of confidence fails, a general election will be held in advance.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854282944715587677_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854285221799026970","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:10:22","content":"Before the crisis, Lindner, chairman of the neoliberal Free Democratic Party (FDP), wrote a document proposing \"economic recovery through partial fundamental revision of key political decisions\" - by cutting corporate taxes, rolling back climate regulations and reducing welfare. These proposals were seen as provocative and irreconcilable with the proposals of his coalition partners, Chancellor Schulz's center-left Social Democratic Party (SPD) and the environmentalist Green Party.\nGerman Chancellor Olaf Scholz explained why he fired Finance Minister Lindner tonight: \"He was too selfish and betrayed my trust too much\", \"He refused too many compromises and sometimes even exceeded my political beliefs\", \"Too focused on his own political interests and party\", \"Irresponsible\".","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854285221799026970_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854290414460649480","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:31:00","content":"November 5, Fukang, Xinjiang. A man who worked outside Xinjiang was owed 20,000 yuan in wages. He went to the local labor bureau to negotiate, but the bureau staff replied that they \"could not control private bosses\" and told him to sue in court. The man said: \"I don't understand what the point of setting up this agency is if the state cannot control the wage arrears issue.\"","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854290414460649480_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854295018434879981","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 06:49:18","content":"On November 4, the owners of Tianyue Fenghua Community went to the sales office to defend their rights. It is understood that the community was built by the central enterprise COFCO Group, and there were many problems such as delayed delivery, unauthorized reduction of standards, and inconsistent goods.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854295018434879981_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854295018434879981_0.jpg,","hasFullContentTranslated":true,"hasPublished":false},{"id":"1854393855417917746","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 13:22:02","content":"On November 7, Xi Jinping sent a congratulatory message to US President-elect Trump.\nXi Jinping pointed out that China and the United States will benefit from peace and both will suffer from conflict. A stable, healthy and sustainable development of China-US relations is in the common interests of both countries...","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854393855417917746_0.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854393855417917746_1.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854393855417917746_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854449679075029390","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 17:03:52","content":"November 5, Dalian, Liaoning. A netizen posted a video saying that his relative was hit by a Japanese ship in the waters near Dalian Wafangdian when he was out to sea, and many people on the ship lost contact.\nThe Maritime Safety Administration responded: Search and rescue are in progress, and the specific number of people missing has not yet been determined.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854449679075029390_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854449679075029390_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854456256376840695","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 17:30:00","content":"On November 7, workers from Hangang Group in Hanzhong City, Shaanxi Province continued to protest for their rights and wages in front of the Mian County Government.\nIt is reported that Hangang Group has owed workers nearly 500 million yuan in wages, social security and other funds.\nThe workers at the scene shouted in unison: \"Protect rights, unite, persist, and win. Socialism is good. Long live the Communist Party. Long live Xi Dada. Protect rights according to law. We want to eat!\"","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854456256376840695_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854456256376840695_0.jpg,/tweet/video/whyyoutouzhele/2024/11/07/1854456256376840695_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854456526225727788","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 17:31:04","content":"Netizens added:","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854456526225727788_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854460108647882984","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 17:45:18","content":"Recently, a pile of wreaths appeared downstairs of Beijing Times Junfeng (the entertainment company that cultivated TFBoys). The content of the wreaths included rights protection, accusing the company of being a fraudulent company, demanding that the company pay back the money, and that there were problems such as tax evasion. On November 6, the official issued a notice requiring fans to reasonably protect their rights. All illegal acts will leave a criminal record, which will affect future civil service examinations and job hunting.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854460108647882984_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854460108647882984_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854461686125609079","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 17:51:34","content":"On November 6, the media reported that Nezha Auto had been slow to announce its October sales data and had begun implementing a salary cut plan of up to 30% for its employees. At the same time, employees began to set up a wage-demanding group because they received mass text messages about delayed salary payment.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854461686125609079_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854465777874632777","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 18:07:50","content":"Correction: Reports that the Houthis announced a ceasefire after Trump’s election victory were false.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854465777874632777_0.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854465777874632777_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854467552103305686","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 18:14:53","content":"November 7 (Released) Liaoning Dandong. A man posted a video saying that he missed Hitler very much and hated Jews very much. He believed that the Israeli-Palestinian War and the Russian-Ukrainian War were instigated by Jews, and the entire United States was hollowed out by Jews.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854467552103305686_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854475373368811860","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 18:45:58","content":"According to a report on November 6, China's pension has doubled in 11 years, with the monthly pension of enterprise retirees rising from 1,686 yuan to 3,162 yuan, and the average monthly pension of urban and rural residents rising from 82 yuan to 214 yuan. However, many netizens in the comment area reported that their family's pension was only more than 100 yuan.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854475373368811860_0.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854475373368811860_1.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854475373368811860_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854475373368811860_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854480449281904774","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 19:06:08","content":"On November 7, China Business News reported that a survey showed that the average elderly person in China currently has a wealth reserve of 264,000 yuan, which was ridiculed by netizens.\nNetizens replied, \"How many people in rural areas can have this amount? Find one in the west and see.\"\n\"Jack Ma and I have an average of 100 billion yuan in assets.\"","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854480449281904774_0.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854480449281904774_1.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854480449281904774_2.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854480449281904774_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854486819423068664","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 19:31:27","content":"November 6 (Released) Russian troops photographed the North Korean soldiers' camp and lamented that the North Korean soldiers' dormitories had televisions and refrigerators and their living conditions were much better than theirs.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854486819423068664_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854489391214797178","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 19:41:40","content":"On November 7, the official account of the Political and Legal Affairs Commission, \"Youliyoumianer\", published an article saying that when seeing Hamas leader Sinwar, it reminded me of the revolutionary martyr Yang Jingyu.\nThe article said that Sinwar is a national hero, very similar to Yang Jingyu. As long as there are people like Sinwar, Palestine will not surrender to Israel and will not be destroyed.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854489391214797178_0.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854489391214797178_1.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854489391214797178_2.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854489391214797178_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854495463241822657","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 20:05:47","content":"November 6, Dongguan, Guangdong. A policeman stopped a foreigner on the roadside. Because the foreigner could not understand English, the traffic policeman waved and let him go, \"Put on your helmet and go.\" The foreigner immediately replied \"OK Thanks.\" Netizens thought that the police were pro-Western and expressed their dissatisfaction in the comment area. At present, the video has been deleted from the entire network.\nNetizens replied \"Foreigners are indeed superior to others\"\n\"I can't understand Chinese either, can I go?\"\n\"Don't you even need to see your driver's license?\"","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854495463241822657_0.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854495463241822657_1.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854495463241822657_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854495463241822657_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854500679865209065","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 20:26:31","content":"On November 7, the follow-up of \"Wannian County Township Party Secretary Li Peixia reported the sexual assault case of County Party Secretary Mao Qi\": Li Peixia was accused by the Hengfeng County People's Procuratorate of accepting bribes of 1.65 million yuan while serving as the Party Secretary of Shangfang Township, Wannnian County. Li Peixia pleaded guilty and repented in court.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/11/07/1854500679865209065_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854504416315138185","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 20:41:22","content":"November 6, Kunming, Yunnan. Many deliverymen and netizens reported that the positioning of Kunming Joy City, Second Ring South Road and other places was confused on that day, and many deliverymen were located in the river. Some netizens revealed that the positioning confusion was caused by the use of jammers when a big shot came to the meeting.\nAccording to local media reports, Li Qiang will attend a meeting in Kunming from the 6th to the 7th.","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854504416315138185_0.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854504416315138185_1.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854504416315138185_2.jpg,/tweet/image/whyyoutouzhele/2024/11/07/1854504416315138185_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1854507880445358381","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-07 20:55:08","content":"On November 7, DeepBlue Finance quoted NetEase data and reported: Since 2020, major universities in China have opened civil servant micro-majors.\nNetizens responded, \"If everyone takes the civil service exam, who will serve the people in the future?\"","images":"/tweet/image/whyyoutouzhele/2024/11/07/1854507880445358381_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]