[
  {
    "id": "1769425356627312742",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 02:07:34",
    "content": "The aunt of the victim of the Handan junior high school student murder case said that if there was any way, she would not speak out in this way. She said that the local public security department has been shirking the responsibility of conducting an autopsy on the child.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769425356627312742_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769545511466365178",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 10:05:01",
    "content": "\"I will forget myself and live up to the people\"\nPutin was elected Russian president for the fifth time",
    "images": "/tweet/image/whyyoutouzhele/2024/03/18/1769545511466365178_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769547182347096436",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 10:11:39",
    "content": "[Official report: 13-year-old boy in Meizhou molested a girl: Sent to a special school for admonition and education] On March 18, according to the joint working group of Wuhua County, Meizhou City, Guangdong Province, at 17:00 on March 12, Li (male, 13 years old), a student in Wuhua County, followed a girl to the bottom of a residential building and molested her. During this time, the girl struggled and shouted loudly. After being discovered by passers-by, Li stopped the indecent behavior. After the incident, the Wuhua County Public Security Bureau immediately organized police forces to conduct an investigation. Upon inspection, the girl was not physically injured. On March 14, Li was sent to a special school for admonition and education in accordance with the law. Subsequent processing is still in progress.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/18/1769547182347096436_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769682443097735314",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 19:09:08",
    "content": "On March 18, the Chinese Rocket Force's Bilibili account posted a video in which a female soldier showed her father's \"Capital Guardian\" medal. According to the information, the \"Capital Guardian\" medal was awarded by the Chinese People's Liberation Army to officers and soldiers of the capital's martial law troops after the June 4th Incident. This video was first discovered and discussed in the pink group, but the video has been deleted.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/18/1769682443097735314_0.jpg,/tweet/image/whyyoutouzhele/2024/03/18/1769682443097735314_1.jpg,/tweet/image/whyyoutouzhele/2024/03/18/1769682443097735314_2.jpg,/tweet/image/whyyoutouzhele/2024/03/18/1769682443097735314_3.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769685106275328395",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 19:19:43",
    "content": "In the early morning of the 18th, the Handan forensic doctor conducted an autopsy on the body of the victim of the Handan junior high school student murder case. The autopsy ended at 1:48 on the 18th. Wang Ziyao's family said that before the autopsy, Wang Ziyao's father checked the child's body and found obvious scars on the child's head and back.\nWang Ziyao's father posted a photo of Wang Ziyao as a child at 5:35 in the morning, with the caption \"Good boy, wait for your dad to avenge you\"",
    "images": "/tweet/image/whyyoutouzhele/2024/03/18/1769685106275328395_0.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769685106275328395_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769686786509287703",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 19:26:23",
    "content": "At the gate of Xiuzhou District Government, Jiaxing City, Zhejiang Province, people defended their rights and a conflict ensued. A property owner was dragged away by the police",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769686786509287703_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769687778789343620",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 19:30:20",
    "content": "On March 17, in Shantou, Guangdong, a woman posted a video saying that her barbecue restaurant was often complained about, but the relevant department hinted that the woman should \"give gifts\" to the complainants.\nAfterwards, the woman posted a video saying that she had no choice but to close the store and set up a street stall.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769687778789343620_0.jpg,/tweet/video/whyyoutouzhele/2024/03/18/1769687778789343620_1.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769688462813253923",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 19:33:03",
    "content": "Recently, at the No. 4 Middle School in Xiping County, Zhumadian City, Henan Province, a student stabbed his teacher and then jumped off the building.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769688462813253923_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769689739047690678",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 19:38:07",
    "content": "On March 16, at the gate of Xiangnan Experimental Middle School in Hengyang, Hunan, several men armed with sticks rushed into the school and beat people.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769689739047690678_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769689845012537394",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 19:38:32",
    "content": "On March 17, the Public Security Bureau of Changning City, Hunan Province, issued a police report: At 17:40 on March 16, 2024 (Saturday), the public reported that a fight occurred in front of the gate of Xiangnan Experimental Middle School. The public security organs quickly dispatched police to the scene to deal with it.\nAfter investigation, 7 college students, including Hong Mouwang (male, 22 years old) and Ma Mouchao (male, 22 years old), came to Xiangnan Experimental Middle School for enrollment promotion on the afternoon of March 16. During this period, they had a conflict with Zhang Mou (male, 15 years old), a student of the school, outside the school gate due to verbal trivia. Afterwards, Hong Mouwang, Ma Mouchao and others rushed into the school with thin iron rods to chase and beat Zhang Mou and others, causing Zhang Mou to suffer minor injuries.\nAt present, the public security organs have arrested all 7 persons involved in the case, including Hong Mouwang and Ma Mouchao. The case is under further investigation.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/18/1769689845012537394_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769692802395283540",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 19:50:18",
    "content": "On March 18, a blogger in Harbin, Heilongjiang said that he was banned for one month for \"violating laws and regulations\" because he promoted patriotism in front of the 731 Crime Evidence Exhibition Hall. \nDouyin customer service responded, \"I know you are very patriotic, but I don't recommend you to promote these things in the live broadcast room.\" \"Promoting culture requires practical actions, including true love, and there is no need to use this as live broadcast content.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769692802395283540_0.jpg,/tweet/video/whyyoutouzhele/2024/03/18/1769692802395283540_1.jpg,/tweet/video/whyyoutouzhele/2024/03/18/1769692802395283540_2.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769725633809051759",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 22:00:45",
    "content": "March 18, Shenyang, Liaoning. The state-owned Construction Engineering Group Co., Ltd. owed workers wages, and workers gathered outside the company to demand wages. ",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769725633809051759_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769725745541140731",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 22:01:12",
    "content": "March 18, Hengshui, Hebei. Binhu International forcibly occupied shops and refused to pay rent to the owners. A large number of owners gathered outside the Taocheng District People's Court and shouted \"I want to file a case.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769725745541140731_0.jpg,/tweet/video/whyyoutouzhele/2024/03/18/1769725745541140731_1.jpg,/tweet/video/whyyoutouzhele/2024/03/18/1769725745541140731_2.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769725950965567785",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 22:02:01",
    "content": "March 18. Xi'an, Shaanxi. An owner posted a video saying that \"Western Group and Binzhou Xinze Huafu developer cheated the people of their hard-earned money. It has been four years since the down payment, but the house has not been delivered yet.\" On that day, the owners gathered outside the Western Group and held banners to defend their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/18/1769725950965567785_0.jpg,/tweet/video/whyyoutouzhele/2024/03/18/1769725950965567785_1.jpg,/tweet/video/whyyoutouzhele/2024/03/18/1769725950965567785_2.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769747918385185149",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 23:29:18",
    "content": "On March 18, a community in Sanya, Hainan posted a notice: deliverymen and dogs are not allowed to enter.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/18/1769747918385185149_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769748039315447912",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-18 23:29:47",
    "content": "Later, the property customer service said they were investigating who posted it.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/18/1769748039315447912_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]