[
  {
    "id": "1749465242596225416",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 00:13:11",
    "content": "At present, the first press conference on the landslide in Zhenxiong, Yunnan was originally scheduled to be held at 22:00. After being changed to 23:00, it was postponed to 23:00, and then postponed to 0 o'clock. It has not started yet.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749465242596225416_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749489028611645836",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 01:47:43",
    "content": "The press conference reported that as of 22:00 on the 22nd, 11 missing persons had been rescued at the scene, but they had no vital signs. The remaining missing persons are being searched and rescued with all efforts.",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749496425459642833",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 02:17:06",
    "content": "On the evening of the 22nd, before the A-share market opened, stockholders all wrote in the comments \"US stocks will win\". After the words \"US stocks\" were blocked, they changed to \"Beauty will win\".",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/23/1749496425459642833_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1749499940898828603",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 02:31:04",
    "content": "Just now, the seismic network automatically determined that at 02:09 on January 23, an earthquake of magnitude 7.0 occurred near Wushi County, Aksu Prefecture, Xinjiang.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749499940898828603_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749550380399133074",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 05:51:30",
    "content": "Wenzhou Red Cross Society's statement on this video",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749550380399133074_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749580375729295793",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 07:50:41",
    "content": "\"Filial piety comes first among all virtues\"\nCaixin reported that in 2022, because of the frequent appearance of players and fans on the scene to support Ukraine in the Premier League, major Chinese websites were asked to stop broadcasting the Premier League at that time.\nBut the matter did not end there. Because he was dissatisfied with \"such a little happiness can be arbitrarily deprived for various high-sounding reasons\", Mr. Jin, a die-hard fan who felt humiliated, took iQiyi to court.\nOn December 29, 2023, the Beijing Internet Court ruled in the first instance that iQiyi Sports Operator and Beijing Xinai Sports Media Technology Co., Ltd. should refund 7.84 yuan corresponding to one round of Premier League matches that were not broadcast, and bear the case acceptance fee of 50 yuan.\nAfter the verdict, neither party appealed, and the verdict came into effect on January 16, 2024. Mr. Jin told Caixin that iQiyi Sports had fulfilled the judgment on January 17, and the legal department had transferred 57.84 yuan to him.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749580375729295793_0.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749580375729295793_1.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749580375729295793_2.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749582298306023782",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 07:58:20",
    "content": "On January 22, Sina published an article titled \"The Train Driver\", which tells the story of the sadness and difficulties of train drivers. The article said that a survey in Fujian Province showed that the positive rate of depression among train drivers reached 50%. A train driver told me in a private message: \"It is really touching for our group. No one understands the hardship and deprivation that this group has suffered.\" However, he just found that the article has been deleted from the entire network. The full text is as follows: On January 22, Sina Hotspot published an article about the sadness and difficulties of Chinese railway drivers. The Spring Festival travel rush is approaching, and there will be more than 1.09 million passenger and freight trains of various types running on the 155,000 kilometers of railway mileage across the country. Some of these vehicles have one driver, and some have two. They seem to be in a good position, but in fact they bear psychological pressure that ordinary people cannot imagine. A survey of 1,077 train drivers in Fujian Province showed that 50.3% of them have depression. Although train drivers are not machines, they have to operate like machines. In their lives, forced sleep has become a strict rule. In order to ensure that the driver has sufficient experience during driving, the driver must rest in the standby room for 4 hours before departure. During this period, he cannot do anything except sleep, otherwise he will be fined.\nUnlike our daily driving, first of all, the train has no steering wheel, only two levers, one brake, and one acceleration. There are not many things that the driver can operate, but this does not mean that their work is simple and easy. In fact, the driver cannot change the speed of the train at will. The cab is only 2-4 square meters, and the driver spends more than ten hours in this small space every day. They also need to repeat the same mechanical movements. They also have to pay full attention to all foreign things on the rails for safe driving. The driver's every move is closely recorded by the camera in the cab, even the driver's blinking frequency and pupil movement direction cannot escape the \"eyes\" of the camera. Once a violation occurs, he will be fined. In addition, there are video analysts who will review the video footage in the carriage to analyze whether the driver has violated the rules.\nIn addition to sleeping, physiological needs have also become a common problem for drivers. They cannot eat and go to the toilet normally like other people. Since high-speed rail drivers are single drivers and no one replaces them, many drivers will bring their own mineral water bottles or even diapers. But most of the time, drivers can endure it.\nIn the interview, train drivers shared their experiences of almost hitting people. Among them, Wang Lei, a train driver from Beijing, encountered a child on the railroad tracks when he ran his first train at the beginning of his work. Fortunately, he braked in time and the child ran away quickly when the train was about 100 meters away, thus avoiding this tragedy. And because of low visibility during night driving, you don’t even know there is an object in front of you, so you hit it. Sometimes railway patrol workers are tired and sit on the railroad tracks to rest. If they don’t pay attention to the speeding train, they will also be hit and killed. After experiencing death and fear, many drivers will suffer from post-traumatic stress disorder.\nThey are also the loneliest people. Because of the busy work, the rest time does not exceed 12 hours a day. Wang Lei, a freight train driver, said that he works 370-400 hours a month, which is far beyond the working hours stipulated in the Labor Law. He is usually separated from his family. And they have to be on call at any time like a machine.\nDrivers not only have to face busy work every day, but also have to deal with one-size-fits-all management policies. For example, if the driver is sleepy in winter, the unit asks the driver to open the window to blow cold air before departure to keep alert. If the water in the driver's water cup spills, the unit asks the driver not to open the bottle cap. These regulations not only fail to solve the problem, but also increase the burden on the drivers. In addition, the strict assessment also makes the drivers miserable. Deductions for being late, deductions for dragging socks while driving, and even deductions for chatting. But even so, when thinking of the stability of work, the drivers can only grit their teeth and bear it.\nWorking day and night under high intensity, drivers are generally in poor health. Lumbar disc herniation, high blood lipids, high blood pressure, high uric acid, gout, fatty liver, diabetes, stomach disease, cervical spondylosis, lumbar disc herniation account for an absolute proportion, and many people have multiple diseases combined, and even have complications. \"\nWhen train driver Zhang Guoping first joined the company, he was full of enthusiasm for his career, but the strict assessment system made him frequently punished, and even if he was late once, he was deducted money. These harsh policies frustrated him for a long time, and the leader explained to him that this was the management model of the railway. Since then, Zhang Guoping has been worried about making mistakes. Even if he didn't make a mistake, he felt uneasy when he saw others being punished. Over time, he became cautious, and he had to think carefully about trivial household chores, and he felt that he had become too cautious.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749582298306023782_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749612919174676755",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 10:00:00",
    "content": "Daily News January 23\nA-shares start the battle to defend 2700 points\nStockholders call on Xi Jinping to retire\nZhu Ling's parents hope to establish a foundation\n47 people buried in landslide in Zhenxiong, Yunnan\n",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749662283079258237",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 13:16:10",
    "content": "Today is the fourth anniversary of Wuhan's lockdown. On January 23, 2020, Wuhan announced a lockdown, all city buses, subways, ferries and long-distance passenger transport were suspended, and the airport and railway station access to Wuhan was temporarily closed.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749662283079258237_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749748252478439522",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 18:57:46",
    "content": "Netizens are getting bolder",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749748252478439522_0.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749748252478439522_1.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749748252478439522_2.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749748252478439522_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749750088103010455",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 19:05:04",
    "content": "On January 23, in Block A of Jiahe Huaqiang Building in Shenzhen, a security guard dragged and beat a food delivery boy",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/23/1749750088103010455_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1749753052507062484",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 19:16:51",
    "content": "At present, the incident has been reported by Japanese media",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749753052507062484_0.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749753052507062484_1.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749753052507062484_2.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749753052507062484_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749753388277833927",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 19:18:11",
    "content": "A Snowball comment",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749753388277833927_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749757022046753101",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 19:32:37",
    "content": "January 21, Handan, Hebei.\nA woman posted a video asking for help, saying that her child Xu Tianyi, 16 years old, left home on an electric bike at 19:00 on the evening of January 2 and has not returned since. His electric bike was found on the shore of Ming Lake. The child was wearing a school uniform on the day he disappeared. I hope kind people can pay attention to it.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/23/1749757022046753101_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1749757730598842375",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 19:35:26",
    "content": "On January 22, Wuhan, Hubei. A netizen posted a video saying that the owner of a barbecue restaurant in Wuhan first lured a puppy with food, and when the puppy approached, he poured boiling hot oil on it, causing the puppy to be severely burned. The video immediately caused an uproar on the Internet after it was released. The owner was criticized by a large number of netizens, and the barbecue restaurant was suspected to be temporarily closed.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/23/1749757730598842375_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1749762415720268178",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 19:54:03",
    "content": "At the regular press conference of the Ministry of Foreign Affairs on January 22, a reporter asked what the Ministry of Foreign Affairs had to say about the recent foreign media reports that there was a \"wave of international talent leaving Hong Kong\".\nSpokesperson Wang Wenbin said that the relevant remarks were groundless and misleading to the public and public opinion.\nNetizens commented: I really can't do this job.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749762415720268178_0.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749762415720268178_1.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749762415720268178_2.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749762415720268178_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749765550413111395",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 20:06:30",
    "content": "On January 16, the Graduate School of East China Normal University notified all graduate students to watch \"Artificial Intelligence, Quantum Thinking and Laozi Thinking\" online.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749765550413111395_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749778145824084460",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 20:56:33",
    "content": "On January 22, Cailian reported that Li Qiang presided over a State Council meeting, emphasizing the need to take more powerful and effective measures to stabilize the market and confidence, strengthen the consistency of macroeconomic policy orientation, strengthen policy tool innovation and coordination, consolidate and enhance the economic recovery and positive trend, and promote the stable and healthy development of the capital market.\nNetizens generally expressed disbelief.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/23/1749778145824084460_0.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749778145824084460_1.jpg,/tweet/image/whyyoutouzhele/2024/01/23/1749778145824084460_2.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1749785096465289530",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 21:24:11",
    "content": "January 22, Linyi, Shandong. Wenfeng No. 1 Middle School in Lanling County has been in arrears of wages for migrant workers for half a year. Workers gathered outside the school to demand their wages.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/23/1749785096465289530_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1749785428897534390",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 21:25:30",
    "content": "January 23, Lianyungang, Jiangsu.\nGood-hearted people from all over the country wanted to enter the village to visit Zhang Xinwei's father, but were blocked by the police stationed at the entrance of the village.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/23/1749785428897534390_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1749805860782776605",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 22:46:41",
    "content": "On the evening of the 23rd, Cristiano Ronaldo's game in Shenzhen was suddenly cancelled due to health reasons, and a large number of fans blocked the hotel entrance and shouted slogans to protest their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/23/1749805860782776605_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1749822128738717954",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-23 23:51:20",
    "content": "Later, the fans broke through the defense line and entered the hotel",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/23/1749822128738717954_0.jpg",
    "hasPublished": false
  }
]