[{"id":"1654341483581849600","name":"李老师不是你老师","createdDate":"2023-05-05 12:25:20","content":"Netizen contribution\nOn May 5, the Central Committee of the Communist Youth League published an article exposing that the US Central Intelligence Agency (CIA) used a non-traditional regime change technology called \"swarming\" to promote young people connected by the Internet to join the \"shoot and move to another place\" mobile protest activities and implement \"color revolutions.\"\nThe article pointed out that the CIA first provides encrypted network communication services. In order to help protesters in some countries in the Middle East keep in touch and avoid being tracked and arrested, an American company (allegedly with a US military background) has developed a TOR technology (\"Onion Router\" routing technology) that can access the international Internet but cannot be tracked. The relevant servers encrypt all information flowing through them, thereby helping specific users to surf the Internet anonymously. After the project was launched by American companies, it was immediately provided free of charge to anti-government personnel in Iran, Tunisia, Egypt and other countries to ensure that those \"dissident youth who want to shake the rule of their own government\" can avoid the censorship and surveillance of the local legitimate government when participating in activities.\n\nThe second is to provide offline communication services. In order to ensure that anti-government personnel in Tunisia, Egypt and other countries can still keep in touch with the outside world when the Internet is disconnected, Google and Twitter in the United States quickly launched a dedicated service called \"Speak2Tweet\", which allows users to dial and upload voice messages for free. These messages are automatically converted into tweets and then uploaded to the Internet, and publicly released through platforms such as Twitter to complete the \"real-time reporting\" of the scene of the incident.\n\nThe third is to provide on-site command tools for rallies and marches based on the Internet and wireless communications. The Rand Corporation of the United States has spent several years developing a non-traditional regime change technology called \"swarming\" to help a large number of young people connected through the Internet join the \"shoot one shot and change one place\" mobile protest activities, which greatly improves the efficiency of on-site command of the event.\n\nThe fourth is that a US company developed a software called \"riot\". The software supports 100% independent wireless broadband networks, provides variable WiFi networks, does not rely on any traditional physical access methods, does not require telephone, cable or satellite connections, and can easily avoid any form of government monitoring. With the help of the above powerful network technology and communication technology means, the CIA has planned, organized and implemented a large number of \"color revolution\" events around the world.\n\nFifth, the US State Department has made the development of an \"anti-censorship\" information system an important task and invested more than 30 million US dollars in the project.\n\nTherefore, it is particularly important for domestic government agencies, scientific research institutions, industrial enterprises and commercial institutions to quickly \"see\" and deal with the highly systematic, intelligent and covert cyber attacks launched by the CIA against China in the first place. The report recommends that in order to effectively respond to imminent network and real threats, China should organize self-inspection and self-examination of APT attacks as soon as possible while adopting independent and controllable domestic equipment, and gradually establish a long-term defense system to achieve comprehensive and systematic prevention and control to resist advanced threat attacks.","images":"/tweet/image/whyyoutouzhele/2023/05/05/1654341483581849600_0.jpg,/tweet/image/whyyoutouzhele/2023/05/05/1654341483581849600_1.jpg,/tweet/image/whyyoutouzhele/2023/05/05/1654341483581849600_2.jpg,/tweet/image/whyyoutouzhele/2023/05/05/1654341483581849600_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1654364105346613248","name":"李老师不是你老师","createdDate":"2023-05-05 13:55:13","content":"User contributions","images":"/tweet/image/whyyoutouzhele/2023/05/05/1654364105346613248_0.jpg","videos":"/tweet/video/whyyoutouzhele/2023/05/05/1654364105346613248_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/NeYiwtsijk","accountId":"whyyoutouzhele"},{"id":"1654368654140624897","name":"李老师不是你老师","createdDate":"2023-05-05 14:13:18","content":"@Eric812800 @Alisa666662 Thank you","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1654447922501623809","name":"李老师不是你老师","createdDate":"2023-05-05 19:28:17","content":"Netizen contribution\nA university in Guangdong prohibits holding banners when taking photos of graduation certificates","images":"/tweet/image/whyyoutouzhele/2023/05/05/1654447922501623809_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/4o2ROm2Yea","accountId":"whyyoutouzhele"},{"id":"1654461978704740352","name":"李老师不是你老师","createdDate":"2023-05-05 20:24:08","content":"Netizen contribution\nOn May 5, students from Jiangsu University of Science and Technology sought help at the campus market, saying that they were placed in a double isolation cabin and were worried about cross infection\nIt is reported that the isolation cabin of Jiangsu University of Science and Technology has three areas in total, and currently one quarter of the people live in the first area.","images":"/tweet/image/whyyoutouzhele/2023/05/05/1654461978704740352_0.jpg,/tweet/image/whyyoutouzhele/2023/05/05/1654461978704740352_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/c9wSRCltZx","accountId":"whyyoutouzhele"},{"id":"1654467276152643586","name":"李老师不是你老师","createdDate":"2023-05-05 20:45:11","content":"Netizen contribution\nThe current unreasonable charging phenomenon in vocational colleges.","images":"/tweet/image/whyyoutouzhele/2023/05/05/1654467276152643586_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/RmBymlp86L","accountId":"whyyoutouzhele"},{"id":"1654481384751153152","name":"李老师不是你老师","createdDate":"2023-05-05 21:41:15","content":"In response to a comment from a netizen who thought the information was from last year, I would like to confirm with the contributor that the information was from the campus bazaar today. In addition, some students from Beijing universities have started self-funded quarantine in the past two days, so I personally think the information is quite credible.","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1654484130288091138","name":"李老师不是你老师","createdDate":"2023-05-05 21:52:10","content":"Other students from Jiangsu University of Science and Technology sent additional evidence to confirm that the submission took place this afternoon","images":"/tweet/image/whyyoutouzhele/2023/05/05/1654484130288091138_0.jpg,/tweet/image/whyyoutouzhele/2023/05/05/1654484130288091138_1.jpg,/tweet/image/whyyoutouzhele/2023/05/05/1654484130288091138_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/1zi1o8ooET","accountId":"whyyoutouzhele"},{"id":"1654484339931992064","name":"李老师不是你老师","createdDate":"2023-05-05 21:53:00","content":"@Crishxl ","images":"/tweet/image/whyyoutouzhele/2023/05/05/1654484339931992064_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/oGK9wXpRKe","accountId":"whyyoutouzhele"},{"id":"1654485823394312196","name":"李老师不是你老师","createdDate":"2023-05-05 21:58:53","content":"@chongming8964 ？","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1654487747220979716","name":"李老师不是你老师","createdDate":"2023-05-05 22:06:32","content":"\"King of the Sky\" You...","images":"/tweet/image/whyyoutouzhele/2023/05/05/1654487747220979716_0.jpg,/tweet/image/whyyoutouzhele/2023/05/05/1654487747220979716_1.jpg,/tweet/image/whyyoutouzhele/2023/05/05/1654487747220979716_2.jpg,/tweet/image/whyyoutouzhele/2023/05/05/1654487747220979716_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/3Wpl38imdQ","accountId":"whyyoutouzhele"},{"id":"1654515908725862400","name":"李老师不是你老师","createdDate":"2023-05-05 23:58:26","content":"More students provided proof, and the post has been deleted.\nIt is said that this is not the first time that Jiangsu University of Science and Technology has taken unreasonable isolation measures.","images":"/tweet/image/whyyoutouzhele/2023/05/05/1654515908725862400_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/EfpPoDcBZ0","accountId":"whyyoutouzhele"}]