[{"id":"1783528022982688962","name":"李老师不是你老师","createdDate":"2024-04-26 00:06:31","content":"On April 22, Wei County, Hebei Province. Migrant workers were asking for their wages at Red Star Macalline. During this time, a group of policemen and men in black came from a distance, just like a gangster movie. The police on the scene even shouted, \"This is liberation. If it is not liberation, how many people will collapse you like this?\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783528022982688962_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783557014133551461","name":"李老师不是你老师","createdDate":"2024-04-26 02:01:43","content":"April 23, Hangzhou, Zhejiang. It was revealed online that students majoring in nursing at Ankang Yuying Secondary Vocational School were arranged to practice in a factory, with an hourly wage of 16 yuan and bed boards in the dormitory crawling with bugs. The school said: This is a process of adapting to the social environment in advance.","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783557014133551461_0.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783557014133551461_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783557014133551461_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783557278198583749","name":"李老师不是你老师","createdDate":"2024-04-26 02:02:46","content":"April 25 (Release), Lingshi County, Shanxi. A video of an old man kneeling and kowtowing to a leader has attracted attention. It is understood that the old man’s house in Leijiazhuang Village was demolished, but the village cadres have occupied the land compensation for 10 years, causing the old man to wander outside and unable to return home. At that time, the old man defended his rights at the local petition bureau and repeatedly begged the director to help connect with the town leaders, but he did not agree. The old man was forced to kneel down to the director.","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783557278198583749_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783557278198583749_0.jpg,/tweet/video/whyyoutouzhele/2024/04/26/1783557278198583749_1.jpg,/tweet/video/whyyoutouzhele/2024/04/26/1783557278198583749_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783558298983080127","name":"李老师不是你老师","createdDate":"2024-04-26 02:06:50","content":"On April 25, the Central Military Commission's subcutaneous account Jun Zhengping made a shocking statement on the US student protests: Is this external incitement? This is a deafening voice of opposition! \n\"What's ridiculous is that some officials dare not face the reason for people's anger, but instead claim that the protesting students are because of 'external instigators coming in to disrupt order'.\" \n\"Excuse me, in front of such a powerful military and police, what kind of 'external instigators' would make young people dare to face guns and batons?\"","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783558298983080127_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783558541032268156","name":"李老师不是你老师","createdDate":"2024-04-26 02:07:47","content":"I feel like this picture will be useful for a long time to come.","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783558541032268156_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783595064083513367","name":"李老师不是你老师","createdDate":"2024-04-26 04:32:55","content":"After the British Prime Minister listed China as an authoritarian country, on April 25, Baidu Encyclopedia urgently revised its interpretation of \"authoritarianism\".","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783595064083513367_0.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783595064083513367_1.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783595064083513367_2.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783595064083513367_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783633714020225067","name":"李老师不是你老师","createdDate":"2024-04-26 07:06:30","content":"Recently, a teacher in Shaanxi called out to Xi Jinping, hoping to borrow money from him to buy a house. He said that he and his relatives and friends around him became penniless because of buying a house, so he had the idea of borrowing money from Xi Jinping.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783633714020225067_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783634481867268398","name":"李老师不是你老师","createdDate":"2024-04-26 07:09:33","content":"https://t.co/svwIjcs9qV","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783634481867268398_0.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783634481867268398_1.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783634481867268398_2.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783634481867268398_3.jpg,","videos":"","hasPublished":true},{"id":"1783825941833379932","name":"李老师不是你老师","createdDate":"2024-04-26 19:50:21","content":"Tik Tok Encyclopedia has also been changed","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783825941833379932_0.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783825941833379932_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783827445889859825","name":"李老师不是你老师","createdDate":"2024-04-26 19:56:19","content":"On April 23, a netizen posted that the School of Literature of South China Normal University required students to hand-copy graduation papers after passing the defense, and assigned them the requirement of copying as many as several documents, but those with more than 30,000 words in the main text were exempted from copying.\nStudents are miserable because of this, and every year they resist but are suppressed.","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783827445889859825_0.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783827445889859825_1.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783827445889859825_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783827976788009091","name":"李老师不是你老师","createdDate":"2024-04-26 19:58:26","content":"On April 26, a vicious incident occurred in Fengkai County, Zhaoqing, Guangdong.\nAccording to local people, the driver stabbed two people with a knife, then hit someone with his car, and finally jumped off the bridge to commit suicide.\nAt the time of the incident, many parents were sending their children to school on the bridge.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783827976788009091_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783829540344910324","name":"李老师不是你老师","createdDate":"2024-04-26 20:04:39","content":"April 25 (Released) Beijing. A delivery guy was stopped by security guards when delivering food to Beijing Aidi International School, who kept swearing at him.\nIn the end, the guys had to take a taxi together to deliver the food to the school.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783829540344910324_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783830489754632629","name":"李老师不是你老师","createdDate":"2024-04-26 20:08:25","content":"On April 26, Wuxi, Jiangsu. A large-scale strike broke out at Suntech Solar Factory. Employees held up signs saying \"I want to eat\" to defend their rights and called on the leaders to come out. Hundreds of police officers were on the scene to maintain stability.\nThe strike lasted until the afternoon and the crowd still did not disperse, so a large number of police formed a human wall to restrict the movement of workers.\nAccording to a worker who participated in the strike, the factory has been giving holidays since November last year, and the factory cars and all benefits have been cancelled. Now it has announced a long holiday in an attempt to force employees to leave. The police also beat people.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783830489754632629_0.jpg,/tweet/video/whyyoutouzhele/2024/04/26/1783830489754632629_1.jpg,/tweet/video/whyyoutouzhele/2024/04/26/1783830489754632629_2.jpg,/tweet/video/whyyoutouzhele/2024/04/26/1783830489754632629_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783831481019945453","name":"李老师不是你老师","createdDate":"2024-04-26 20:12:21","content":"After Yun Hao stopped farming, on April 25, villagers in Rendezhuang Village, Dezhou, Shandong reported that the village party secretary arranged for people to discharge sewage into the wheat fields. The village party secretary even said shamelessly, \"I want to be famous too.\" On April 26, the village cadres of Dezhuang Village responded: I was just joking. That was not sewage. No sewage was discharged into the fields.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783831481019945453_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783831572917153961","name":"李老师不是你老师","createdDate":"2024-04-26 20:12:43","content":"On April 26, the U.S. Embassy in China released the content of the speech delivered by Blinken and Wang Yi before the meeting, in which the word \"can't hear clearly\" was mentioned many times.","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783831572917153961_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783834115659452522","name":"李老师不是你老师","createdDate":"2024-04-26 20:22:49","content":"On April 26, several users were banned for discussing the US Tiktok ban on the grounds of \"posting remarks to whitewash the US's forced acquisition of Chinese companies.\"","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783834115659452522_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783835846208111074","name":"李老师不是你老师","createdDate":"2024-04-26 20:29:42","content":"April 22-24, Fuzhou, Fujian. An owner of Shoukai Xiangsong Community said that the developer built a rockery in the community, occupying the connecting road between buildings 9 and 10 in the community, causing inconvenience to residents. On the evening of March 3, the developer arranged for cement mixers to enter the community to dump cement. From April 22 to 24, the developer organized security guards to violently attack the south gate and east gate of the community, violently dismantle iron gates and car lift railings, triggering anger and resistance from the community owners. The video shows that the owners and the security guards had fierce conflicts and shoving, and the security guards forcibly dragged the owner away.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783835846208111074_0.jpg,/tweet/video/whyyoutouzhele/2024/04/26/1783835846208111074_1.jpg,/tweet/video/whyyoutouzhele/2024/04/26/1783835846208111074_2.jpg,/tweet/video/whyyoutouzhele/2024/04/26/1783835846208111074_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783842590024151055","name":"李老师不是你老师","createdDate":"2024-04-26 20:56:30","content":"April 25 (Release), Quwo County, Shanxi. A woman reported that her 60-year-old father was abused in a nursing home in Lechang Town. Her father was tied to a pillar many times and was recently hospitalized and diagnosed with cerebral hemorrhage. The local police issued a notice, detaining the caregiver for 15 days and fined him 500 yuan.","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783842590024151055_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783842590024151055_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783846738689654885","name":"李老师不是你老师","createdDate":"2024-04-26 21:12:59","content":"On April 26, US Secretary of State Blinken said at a press conference in Beijing that China is the number one supplier of Russian military materials. \"Without China's support, Russia will find it difficult to sustain its attack on Ukraine.\" \nAt the same time, he urged China to persuade Iran and North Korea not to escalate pressure and stop dangerous behavior.\n","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783846738689654885_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783849263379738913","name":"李老师不是你老师","createdDate":"2024-04-26 21:23:01","content":"A woman said that because she posted a video about the incident, her family received a call from the police asking her to delete the video.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783849263379738913_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783849784236736567","name":"李老师不是你老师","createdDate":"2024-04-26 21:25:05","content":"April 25, Wuhan, Hubei. Villagers in Guangfeng Village, Donghu, resisted forced demolition and had a fierce melee with law enforcement officers.\nVideo shows that law enforcement officers sprayed villagers with fire extinguishers, and several law enforcement officers beat villagers with shields and steel forks. The villagers fought back with fists and shovels. The scene was in chaos.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/26/1783849784236736567_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783862404654243866","name":"李老师不是你老师","createdDate":"2024-04-26 22:15:14","content":"A unified reply:\nAmericans do not need to risk being caught by climbing over the firewall to China to send private messages to Jerry Guo. In a world with free press, news about American student protests can be found everywhere. Everyone can get information from major news media and bloggers. There is no need for me to post it specifically. …","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1783865931208274218","name":"李老师不是你老师","createdDate":"2024-04-26 22:29:15","content":"Recently, Chongqing Xinhu Pharmacy Chain Co., Ltd. issued a \"letter to customers\" stating that it would no longer be able to sell \"Taiji Huoxiang Zhengqi Oral Liquid\". The reason is that Taiji Group suggested that the retail price of the product be 13 yuan, but Xinhu wanted to price it at 9.3 yuan. After the disagreement on pricing, Taiji Group stopped cooperation.","images":"/tweet/image/whyyoutouzhele/2024/04/26/1783865931208274218_0.jpg,/tweet/image/whyyoutouzhele/2024/04/26/1783865931208274218_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]