[{"id":"1862904257147797929","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 01:13:19","content":"A literary case written by Hengshui Middle School was circulated online, in which it was mentioned that there are certain foreign forces that are still determined to destroy us, infiltrating malicious values on the cultural front and harming the souls of the Chinese people.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862891087813349782","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 24:12:32","content":"Recently, a picture of \"Anti-corruption training course for African countries held in a hotel in Quanzhou\" was circulated online, triggering ridicule and mockery from netizens. Netizens responded, \"It's like an alcoholic teaching me how to quit drinking\" and \"The Taliban also came here to learn about anti-terrorism experience some time ago.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862899445068865709","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 24:42:52","content":"Mexican authorities raided a large commercial complex in the city center that sold Chinese and other Asian counterfeit goods. The mall was once known as the \"Yiwu City\" of Mexico. Mexican authorities vowed on Friday (November 29) to crack down on the industry nationwide. More than 200 police officers and marines took part in the raid, seizing about 90,000 counterfeit items.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862901796039278780","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 24:58:06","content":"Following Wu Liufang and Qin Xue, Liu Xiang, an athlete of the Chinese national swimming team, was also criticized by netizens for sharing a photo of herself wearing a swimsuit on a social platform. Liu Xiang said: Do I have to wear cotton pants and a down jacket to swim?","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862928021818347577","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 02:44:09","content":"November 30, Shantou, Guangdong. A woman hung a banner on the bell tower of the Shantou Xiaogongyuan Department Store to protest her injustice. The video showed that the banner read: \"The Shantou government is the darkest, officials protect each other and force people to death. Some citizens were stopped by the police for taking photos.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1862998832541286569","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 07:16:29","content":"On November 30, a series of official media reports on Xinjiang cotton were criticized","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863008494343131363","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:01:57","content":"CATL issued a statement on its English official website: It does not use Xinjiang products. After the incident of Uniqlo not using Xinjiang cotton fermented, some netizens found that the domestic lithium battery giant CATL issued a statement on its English official website saying that they have nothing to do with forced labor in Xinjiang and do not use any suppliers from Xinjiang in their supply chain. However, a report shows that CATL actually holds shares in Xinjiang Zhite New Materials. In January this year, the company's lithium mine and Hotan base started construction.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863011665467597268","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:17:09","content":"OPPO has released a supplier code of conduct on its official English website, which states: the normal working hours per week shall not exceed 48 hours, and the total working hours shall not exceed 60 hours; at least one day off every seven days shall be guaranteed; employees shall not be discriminated against on the basis of sexual orientation, religious beliefs, ethnicity, gender, political affiliation, etc.; freedom of association shall be guaranteed, and employees' rights to join employee organizations shall be respected; no deduction or withholding of wages in any form shall be allowed. Has OPPO done all of this?","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863015501485805889","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:32:22","content":"BYD also mentioned in its anti-modern slavery report submitted to Australia that their suppliers and factories have measures to protect human rights.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863019908667445623","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:47:35","content":"On November 29, nursing graduates from Mianyang Shenghong Vocational Technical School went to the school to protest their rights because they had attended school for three years but received a diploma that was not related to their school. They were originally studying nursing (advanced class), but their diploma said: maternal and child care, which made it impossible for them to obtain a nursing certificate. The school pretended to be the Mianyang branch of Nanchong Medical School when recruiting students, but after enrollment, it became a private school and the tuition fees were paid into private accounts.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863020447526539474","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:47:41","content":"CATL issued a statement on its official English website saying that it does not use products from Xinjiang. After the incident of Uniqlo not using Xinjiang cotton fermented, some netizens discovered that the domestic lithium battery giant CATL issued a statement on its official English website saying that they have nothing to do with forced labor in Xinjiang and do not use any suppliers from Xinjiang in their supply chain.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863021074855969058","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:47:46","content":"As pointed out by netizens, CATL withdrew from Zhicun Lithium, which operated lithium mines in Xinjiang, in March 2023.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863027935428714668","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 09:18:07","content":"Stars from both sides of the Taiwan Strait sang the 2024 version of Tomorrow will be better, but netizens lamented in the comment area: Tomorrow will be worse, tomorrow is almost over, I will die today, it was better yesterday","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863031899066953843","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 09:33:20","content":"On November 29, seven days after the incident, the Fuyuan County government issued a notice stating that the student who was beaten was sent to the hospital by the school for diagnosis and treatment of skin abrasions on both knees and some soft tissue injuries, and no obvious abnormalities were found in other parts of the body. At present, the student has returned to school for classes. The relevant person in charge of the school has been suspended, and all the students involved (all minors) have been brought to justice for investigation, and the incident is under further investigation and processing.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863035343450333487","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 09:48:33","content":"Netizen contribution: In the early morning of November 29, a mobile phone store in Linhe District, Bayannur City, Inner Mongolia was broken into by three minors under the age of 16 with bricks and stole several mobile phones and cash. The store owner lost more than 100,000 yuan. It was reported online that the minors involved in the case later openly provoked on the short video platform to show off their stolen spoils.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863039027009745228","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 10:03:46","content":"Netizen contribution November 29th Wuhan \"Hanzheng Street\" business district, due to the industrial and commercial inspection of Feisi down jackets, merchants quickly pulled down the shutter doors and collectively closed their stalls. CCTV had exposed this month that illegal merchants \"replaced down with silk\", using \"flying silk\" to impersonate \"down\", and could provide a set of fake certificates, washing labels, down inflation labels, tags and other quality inspection procedures. \"Flying silk\" is \"down silk\", which refers to the single short silk that falls off the feathers during the down processing.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863040777385116015","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 10:03:52","content":"Recently, a notice was posted at the entrance of a supermarket in Jinhua, Zhejiang, requiring supermarkets to strictly prohibit the sale of knives to people who are emotionally agitated, have excessive words and deeds after drinking, have a tendency to cause trouble, or have a dull and dazed look, or have a tendency to cause trouble. It is also prohibited to sell knives during abnormal time periods (22:00-5:00). It also requires that abnormal people who want to buy knives be reported to the local police station.","hasFullContentTranslated":true,"hasPublished":false}]