[{"id":"1862904257147797929","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 01:13:19","content":"A literary case written by Hengshui Middle School was circulated online, in which it was mentioned that there are certain foreign forces that are still determined to destroy us, infiltrating malicious values on the cultural front and harming the souls of the Chinese people.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862891087813349782","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 24:12:32","content":"Recently, a picture of \"Anti-corruption training course for African countries held in a hotel in Quanzhou\" was circulated online, triggering ridicule and mockery from netizens. Netizens responded, \"It's like an alcoholic teaching me how to quit drinking\" and \"The Taliban also came here to learn about anti-terrorism experience some time ago.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862899445068865709","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 24:42:52","content":"Mexican authorities raided a large commercial complex in the city center that sold Chinese and other Asian counterfeit goods. The mall was once known as the \"Yiwu City\" of Mexico. Mexican authorities vowed on Friday (November 29) to crack down on the industry nationwide. More than 200 police officers and marines took part in the raid, seizing about 90,000 counterfeit items.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862901796039278780","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 24:58:06","content":"Following Wu Liufang and Qin Xue, Liu Xiang, an athlete of the Chinese national swimming team, was also criticized by netizens for sharing a photo of herself wearing a swimsuit on a social platform. Liu Xiang said: Do I have to wear cotton pants and a down jacket to swim?","hasFullContentTranslated":true,"hasPublished":true}]