[{"id":"1862904257147797929","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 01:13:19","content":"A literary case written by Hengshui Middle School was circulated online, in which it was mentioned that there are certain foreign forces that are still determined to destroy us, infiltrating malicious values on the cultural front and harming the souls of the Chinese people.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862891087813349782","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 24:12:32","content":"Recently, a picture of \"Anti-corruption training course for African countries held in a hotel in Quanzhou\" was circulated online, triggering ridicule and mockery from netizens. Netizens responded, \"It's like an alcoholic teaching me how to quit drinking\" and \"The Taliban also came here to learn about anti-terrorism experience some time ago.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862899445068865709","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 24:42:52","content":"Mexican authorities raided a large commercial complex in the city center that sold Chinese and other Asian counterfeit goods. The mall was once known as the \"Yiwu City\" of Mexico. Mexican authorities vowed on Friday (November 29) to crack down on the industry nationwide. More than 200 police officers and marines took part in the raid, seizing about 90,000 counterfeit items.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862901796039278780","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 24:58:06","content":"Following Wu Liufang and Qin Xue, Liu Xiang, an athlete of the Chinese national swimming team, was also criticized by netizens for sharing a photo of herself wearing a swimsuit on a social platform. Liu Xiang said: Do I have to wear cotton pants and a down jacket to swim?","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862928021818347577","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 02:44:09","content":"November 30, Shantou, Guangdong. A woman hung a banner on the bell tower of the Shantou Xiaogongyuan Department Store to protest her injustice. The video showed that the banner read: \"The Shantou government is the darkest, officials protect each other and force people to death. Some citizens were stopped by the police for taking photos.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1862998832541286569","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 07:16:29","content":"On November 30, a series of official media reports on Xinjiang cotton were criticized","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863008494343131363","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:01:57","content":"CATL issued a statement on its English official website: It does not use Xinjiang products. After the incident of Uniqlo not using Xinjiang cotton fermented, some netizens found that the domestic lithium battery giant CATL issued a statement on its English official website saying that they have nothing to do with forced labor in Xinjiang and do not use any suppliers from Xinjiang in their supply chain. However, a report shows that CATL actually holds shares in Xinjiang Zhite New Materials. In January this year, the company's lithium mine and Hotan base started construction.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1863011665467597268","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:17:09","content":"OPPO has released a supplier code of conduct on its official English website, which states: the normal working hours per week shall not exceed 48 hours, and the total working hours shall not exceed 60 hours; at least one day off every seven days shall be guaranteed; employees shall not be discriminated against on the basis of sexual orientation, religious beliefs, ethnicity, gender, political affiliation, etc.; freedom of association shall be guaranteed, and employees' rights to join employee organizations shall be respected; no deduction or withholding of wages in any form shall be allowed. Has OPPO done all of this?","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863015501485805889","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:32:22","content":"BYD also mentioned in its anti-modern slavery report submitted to Australia that their suppliers and factories have measures to protect human rights.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863019908667445623","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:47:35","content":"On November 29, nursing graduates from Mianyang Shenghong Vocational Technical School went to the school to protest their rights because they had attended school for three years but received a diploma that was not related to their school. They were originally studying nursing (advanced class), but their diploma said: maternal and child care, which made it impossible for them to obtain a nursing certificate. The school pretended to be the Mianyang branch of Nanchong Medical School when recruiting students, but after enrollment, it became a private school and the tuition fees were paid into private accounts.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863020447526539474","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:47:41","content":"CATL issued a statement on its official English website saying that it does not use products from Xinjiang. After the incident of Uniqlo not using Xinjiang cotton fermented, some netizens discovered that the domestic lithium battery giant CATL issued a statement on its official English website saying that they have nothing to do with forced labor in Xinjiang and do not use any suppliers from Xinjiang in their supply chain.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863021074855969058","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 08:47:46","content":"As pointed out by netizens, CATL withdrew from Zhicun Lithium, which operated lithium mines in Xinjiang, in March 2023.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863027935428714668","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 09:18:07","content":"Stars from both sides of the Taiwan Strait sang the 2024 version of Tomorrow will be better, but netizens lamented in the comment area: Tomorrow will be worse, tomorrow is almost over, I will die today, it was better yesterday","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863031899066953843","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 09:33:20","content":"On November 29, seven days after the incident, the Fuyuan County government issued a notice stating that the student who was beaten was sent to the hospital by the school for diagnosis and treatment of skin abrasions on both knees and some soft tissue injuries, and no obvious abnormalities were found in other parts of the body. At present, the student has returned to school for classes. The relevant person in charge of the school has been suspended, and all the students involved (all minors) have been brought to justice for investigation, and the incident is under further investigation and processing.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863035343450333487","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 09:48:33","content":"Netizen contribution: In the early morning of November 29, a mobile phone store in Linhe District, Bayannur City, Inner Mongolia was broken into by three minors under the age of 16 with bricks and stole several mobile phones and cash. The store owner lost more than 100,000 yuan. It was reported online that the minors involved in the case later openly provoked on the short video platform to show off their stolen spoils.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863039027009745228","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 10:03:46","content":"Netizen contribution November 29th Wuhan \"Hanzheng Street\" business district, due to the industrial and commercial inspection of Feisi down jackets, merchants quickly pulled down the shutter doors and collectively closed their stalls. CCTV had exposed this month that illegal merchants \"replaced down with silk\", using \"flying silk\" to impersonate \"down\", and could provide a set of fake certificates, washing labels, down inflation labels, tags and other quality inspection procedures. \"Flying silk\" is \"down silk\", which refers to the single short silk that falls off the feathers during the down processing.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863040777385116015","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 10:03:52","content":"Recently, a notice was posted at the entrance of a supermarket in Jinhua, Zhejiang, requiring supermarkets to strictly prohibit the sale of knives to people who are emotionally agitated, have excessive words and deeds after drinking, have a tendency to cause trouble, or have a dull and dazed look, or have a tendency to cause trouble. It is also prohibited to sell knives during abnormal time periods (22:00-5:00). It also requires that abnormal people who want to buy knives be reported to the local police station.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863090869060137005","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 13:35:42","content":"On November 30, a foreigner posted a video saying that the United States invented mobile phones, computers, and airplanes; Germany invented cars and bicycles; France invented cameras; Britain invented televisions; Japan invented instant noodles. Do you know what China invented? Netizens: \"China invented Confucianism\", \"Sodium benzoate, potassium sorbate, sodium cyclamate, acesulfame potassium\", \"Health code and travel code\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863140290519081383","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 16:52:24","content":"Recently, Xi Jinping's close confidant, Admiral Miao Hua, was suddenly dismissed. Someone on the Internet revealed that Miao Hua's mother was very domineering in the retirement home. She could not ride in the same elevator with other people. The nurses in the retirement home had to walk with her every day and measure her blood pressure at home. The home also provided her with a car to go to the hospital for medical treatment... \"Some time ago, Miao got into trouble and the Commission for Discipline Inspection came to his house to search. It is said that his mother was completely stunned and could no longer be arrogant.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863146132358193644","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 17:07:37","content":"On November 29, Hunan. A netizen posted a message asking everyone to report the Japanese manga \"The Daring Party\" because the 34th chapter of the manga was suspected of alluding to the leader. Some netizens said: Chapter 34 is too similar, the key is the center position. Another netizen said: If it is really insulting, I will take the lead in charging.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863147890480410749","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 17:07:43","content":"On November 30, People's Daily Online commented on the \"Uniqlo Xinjiang Cotton Incident: The Western media's forcing Yanai Tadashi to express his position is obviously ill-intentioned. We will not \"laugh when praised and jump when scolded.\" Today's China is more confident than ever before.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863152010511737100","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 17:38:03","content":"November 30, Kunming, Yunnan. A little girl was picking up trash in a garbage dump. The person who filmed the video went to the girl's home and bought her some food. The girl lived in a small, crowded rental house, and the rent was 260 yuan per month. The video has been deleted. Another blogger who forwarded the video said: The video address cannot be posted. If it is posted, someone will call and ask you to delete the Weibo.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863154183924568461","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 17:38:09","content":"On November 30, it was reported that Japan is considering simplifying the visa application procedures for Chinese citizens to visit Japan. Kyodo News quoted a diplomatic source in Beijing as saying that China had asked Japan to take measures that correspond to the restoration of visa exemption for Japan. The Yomiuri Shimbun reported that Japan is considering simplifying the application procedures for Chinese citizens to visit Japan.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863158224242770253","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 17:53:22","content":"On November 29, Xinyang, Henan. Netizens posted a video saying that the deputy mayor of Wanggang Town drove a car with a fake license plate, and after being discovered, he arrogantly beat and scolded the original owner. Officials: The deputy mayor was detained and fined, and 12 points were recorded on his driver's license.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863161784284442708","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 18:08:35","content":"November 30 (Release) Beijing. Netizens took photos of the non-staple food supply station of the Beijing Veteran Service and Management Bureau. The pictures show: On the wall of the supply station are the words \"You contribute to the motherland, I provide quality products for the leaders\", \"Internal supplies are not for sale\" and \"Military personnel voucher supply\".","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863165165572874300","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 18:23:48","content":"On November 30, People's Daily published an article: Why are supply and marketing cooperatives still so important today?","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863166197572989132","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 18:23:53","content":"Netizen contribution On the morning of December 1, a vicious murder occurred in Huzhou Changxing People's Hospital, with multiple casualties. The police dispatched a large number of police forces to arrest the murderer. The counselor of the murderer's class threatened to punish the \"rumor-spreading\" students. The murderer is a Filipino Hunanese, and he and the Hong Kong female victim are lovers. Both are students of Zhejiang University of Communication. On November 29, the two went to Huzhou for a trip. During the quarrel, the boy beat the girl. The girl was admitted to Changxing People's Hospital for treatment and then proposed to break up.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863169599241666935","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 18:39:07","content":"On December 1, the 2025 national civil service exam was launched. This national civil service exam plans to recruit 39,700 people. A total of 3.416 million people passed the qualification review, with an employment ratio of about 86:1, and the number of applicants hit a new record high. The number of postgraduate entrance exam candidates in 2024 dropped by 360,000 from the previous year, which was the first decline since 2015. Postgraduate entrance exam papers and academic qualifications may no longer be the first choice for young people, and more people choose to serve the people.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863174433269219373","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 18:54:20","content":"On November 28, the results of the 2024 medical insurance catalog adjustment were announced, 91 new drugs were included in the medical insurance, and the negotiation of drugs for rare diseases was full of bargaining. Netizens responded: \"Why are traditional Chinese medicines more expensive than Western medicines?\" \"A wasteful department is showing you how to save money\" \"Chinese patent medicines are pseudoscience and fraud\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863178507653923321","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 19:09:33","content":"Recently, Jin Xing said in an interview with foreign media, \"I don't understand why the Guangzhou government canceled my performance this year after I had performed for 40 years? I think there is only one reason, that is, at a performance in Taiyuan, Hebei at the beginning of the year, I raised the rainbow flag. Maybe this action brought me trouble. Until today, I have not received a response from the government, and other cities have also canceled my performances.\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863183740048228412","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 19:39:53","content":"Recently, it was revealed online that Xi'an's local aviation company \"Xingfu Airlines\" has long been in arrears of wages and social security for employees. Pilot Li Wei said that due to long-term wage arrears, many pilots, flight attendants, and ground staff have started to deliver food, drive Didi, and set up stalls to increase their income. Because he has not been able to fly for a long time, the aircraft model qualification has expired.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863190133442511160","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 20:10:14","content":"December 1, Sichuan. At 4am, when most people were still asleep, a labor market was already full of migrant workers looking for work. A van drove up and the workers immediately surrounded the van, everyone desperately trying to squeeze into the van. An auntie said that it was not easy to find a job this year, and another uncle said that he had elderly parents and young children to support, \"I am a migrant worker, how can I get a pension?\"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863199615799132357","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 21:10:49","content":"November 28, Beijing. A video from the \"China Cares for the Next Generation Working Committee\" sparked discussion among netizens:","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863202147720159586","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 21:10:55","content":"There are many rules in CPTT, one of which is \"the free flow of information and data\". On November 28, the General Office of the CPC Central Committee and the State Council announced: Promote orderly opening up in the fields of telecommunications, the Internet, culture, etc., and encourage foreign investors to expand investment in the digital field. However, the \"Opinions on the Reform, Innovation and Development of Digital Trade\" also pointed out: Innovation is the key, and security is the basis.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863210484725617057","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 22:11:30","content":"On November 29, Caixin reported that after their house was demolished, Zhang Xuejun and Bao Shifeng started petitioning from Dashiqiao to Yingkou, Shenyang, and Beijing in 2011. They registered more than 5,000 petitions and were eventually sentenced for picking quarrels and provoking trouble. Zhang Xuejun died of illness during the second trial of the case. After Bao Shifeng was released, he insisted on appealing.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863216919488405840","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 22:11:36","content":"Trump said in a post that if the BRICS countries seek to establish a non-dollar currency system, a 100% tariff will be imposed on them. Senior financial commentator Dong Shaopeng pointed out that Trump is a paper tiger.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863220237371687397","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 22:11:42","content":"The employee reported in detail: 1. CEO Liu Gang and President He Qing of Jihu Gitlab concealed their U.S. capital status. Jihu’s legal representative is an American, and more than 50% of the company’s shares are held by foreigners, which means Jihu is an American company.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863223568294932573","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 22:11:47","content":"Recently, on social platforms, more and more people have held up banners calling for attention to food safety issues and severe punishment of unscrupulous businesses.","hasFullContentTranslated":true,"hasPublished":true},{"id":"1863227906815897794","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-12-01 22:57:15","content":"A famous blogger posted a message asking: What is your Chinese character of the year 2024? Netizens responded one after another, with \"tired\", \"poor\" and \"crazy\" appearing the most in the comments section.","hasFullContentTranslated":true,"hasPublished":true}]