[{"id":"1842958113928016303","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-07 00:00:29","content":"Recently, in Beijing, a netizen named \"PZ气静心平\" has been posting posts for several days, saying that her husband worked for Xiaomi Auto. As Xiaomi has been laying off employees, her husband even had to take over the work of seven or eight people and was responsible for more than 100 stores at the same time. There were hundreds of work groups on his mobile phone. He worked overtime until the early morning every day before going home. Eventually, her husband was exhausted to death at the age of 34. Afterwards, these work groups kicked her husband out of the group. Xiaomi has not yet responded to this matter.","images":"/tweet/image/whyyoutouzhele/2024/10/07/1842958113928016303_0.jpg,/tweet/image/whyyoutouzhele/2024/10/07/1842958113928016303_1.jpg,/tweet/image/whyyoutouzhele/2024/10/07/1842958113928016303_2.jpg,/tweet/image/whyyoutouzhele/2024/10/07/1842958113928016303_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1842965999253106706","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-07 00:31:49","content":"On October 4, blogger Liu Daopu posted a video saying that the United Nations recently passed the \"Future Compact\" document, but Russia requested that a clause \"not to interfere in the internal affairs of other countries under any circumstances\" be added to the document. The blogger believes that Russia's intention is \"I will not interfere in your internal affairs, and you don't care what I do in Russia, even if it is something bad, you outsiders cannot interfere.\" The blogger said, \"If you are civilized and you respect human rights, then what are you afraid of?\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/07/1842965999253106706_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1842971471767036266","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-07 00:53:34","content":"October 6, Jinan. Following the street bombing in front of the Zhangqiu District Government last month, a large number of local \"spirited young men\" gathered in Kuanhouli to bomb the streets. Some people jumped onto the bus stop to dance, and some people set off fireworks in the crowd.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/10/07/1842971471767036266_0.jpg,/tweet/video/whyyoutouzhele/2024/10/07/1842971471767036266_1.jpg,/tweet/video/whyyoutouzhele/2024/10/07/1842971471767036266_2.jpg,/tweet/video/whyyoutouzhele/2024/10/07/1842971471767036266_3.jpg,","hasFullContentTranslated":true,"hasPublished":true}]