[
  {
    "id": "1842610103746478576",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 00:57:37",
    "content": "Historical Documents\nA netizen posted a photo of the Guangzhou Daily in 2004. The front page of that day read \"China never encourages the industrialization of education\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842610103746478576_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842610329244549415",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 00:58:31",
    "content": "October 5 (Released), Guangzhou. Another food delivery man collapsed while delivering an order.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842610329244549415_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842613248706928743",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 01:10:07",
    "content": "On October 5, another suspected third-generation red was exposed for showing off his wealth online.\nThe reason was that an account named \"Dong Dong An An\" said in a comment area that \"my grandmother gave me 180 million yuan for my 20th birthday.\" This aroused the curiosity of many netizens.\nNetizens tracked his multiple social media and found that he not only showed off luxury cars and huge deposits, but also the State Council appointment letters of his family members, his grandmother's collection, and several photos related to the founding marshal Zhu De.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842613248706928743_0.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842613248706928743_1.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842613248706928743_2.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842613248706928743_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842619251833925921",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 01:33:58",
    "content": "Recently, the foreign language learning website \"Preply\" announced the ranking list of \"The 20 Most Friendly Cities in Asia in 2024\". Taipei beat other major Asian cities and won the first place in the \"Friendliest City\". Singapore ranked second; Delhi in India ranked third; and Hong Kong ranked 16th.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842619251833925921_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842650403663487181",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 03:37:45",
    "content": "On October 3, a student reported to the Education Bureau of Suining County, Xuzhou, Jiangsu Province, that the school charged for extra classes. The student was repeatedly angrily criticized by the Education Bureau staff and was asked to recite the text, which attracted the attention of netizens. On the 4th, the Xuzhou Municipal Education Bureau responded to the reporter of Huashang Daily Dafeng News that it would strengthen the management of on-duty staff.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842650403663487181_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842685320674119926",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 05:56:30",
    "content": "October 4, Xinyang, Henan. In Gudui Township, Huaibin County, the groom had already paid 188,000 yuan for the betrothal gift. On the wedding day, the bride's brother and sister-in-law asked the groom for another 180,000 yuan for the betrothal gift. After a dispute between the two sides, the bride was forced to prepare to jump off the building twice. The groom had no choice but to take the bride away by force. The video shows that the bride and groom ran to the wedding car to leave, and a man lay on the front of the car to prevent them from leaving. Many people around tried to dissuade them. On October 5, the staff of the Gudui Township Police Station in the jurisdiction said that they knew about the incident and were handling it. The bride had been picked up by the groom.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842685320674119926_0.jpg,/tweet/video/whyyoutouzhele/2024/10/06/1842685320674119926_1.jpg,/tweet/video/whyyoutouzhele/2024/10/06/1842685320674119926_2.jpg,/tweet/video/whyyoutouzhele/2024/10/06/1842685320674119926_3.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842698519221534955",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 06:48:57",
    "content": "Recently, some netizens dug up an old news article that was published one month before the release of \"I Opened a Supermarket on the Long March\". The China Economic Net official account announced that \"I Opened a Supermarket in Ancient Times\" was removed from the entire network due to its vulgar and indecent content.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842698519221534955_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842704492032098528",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 07:12:41",
    "content": "Really Free Tea: On October 1, the Hongxing Street Service Station and the Xijie Community Service Station of the Public Security Bureau of Dazu District, Chongqing, were officially put into operation. In order to carry out anti-fraud publicity to citizens, the service stations provided free \"anti-fraud\" tea. There are a wide variety of tea drinks, including American, latte, cappuccino, Sterculia lychnophora chrysanthemum tea, red dates, longan and wolfberry tea, etc., which attracted a large number of citizens to line up to experience and participate.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842704492032098528_0.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842704492032098528_1.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842704492032098528_2.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842704492032098528_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842713362938941664",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 07:47:56",
    "content": "On October 4, EU member states voted to approve the imposition of tariffs on electric vehicles imported from China. Ten member states, including France and Italy, voted in favor, 12 member states abstained, and five member states (Germany, Hungary, Malta, Slovenia, and Slovakia) voted against.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842713362938941664_0.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842713362938941664_1.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842713362938941664_2.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842713362938941664_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842715466977980435",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 07:56:17",
    "content": "In response, the Chinese Ministry of Commerce stated on the same day that the EU's imposition of high tariffs on Chinese electric vehicles will shake and hinder the confidence and determination of Chinese companies to invest and cooperate in Europe; the new media \"Yuyuan Tantian\" under the Chinese official media also issued a warning that if EU member states support the imposition of taxation, they will lose Chinese investment.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842715466977980435_0.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842715466977980435_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842719452833497240",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 08:12:08",
    "content": "WuXi AppTec and WuXi Biologics are exploring the sale of some of their pharmaceutical businesses, according to a Financial Times report. The sale is said to be taking place against the backdrop of the upcoming US Biosafety Act, which would prohibit drugmakers contracted by the US government from using the services of the two companies after 2032.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842719452833497240_0.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842719452833497240_1.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842719452833497240_2.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842719452833497240_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842855059392188568",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 17:10:59",
    "content": "October 5, Changsha, Hunan. The urban management officers tried to detain the food cart of a street vendor, but the vendor resisted. Then several police officers ignored the vendor's cries, forcibly handcuffed him and carried him away. The onlookers said, \"This is Changsha's police urban management officers, arresting people at will; there are so many people watching, and even I, a soldier, can't stand it.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842855059392188568_0.jpg,/tweet/video/whyyoutouzhele/2024/10/06/1842855059392188568_1.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842858965178421426",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 17:26:30",
    "content": "On October 6, a famous blogger posted a comment on Weibo saying that he had posted a comment \"If Qingfu is not dead, the troubles in Lu will not end\" and it was blocked by the platform, and only he could see it. The meaning of this idiom is: it is used to illustrate that if the culprit who caused the civil unrest is not eliminated, the country will not be at peace. Netizens responded, \"Do you think we don't know who you are talking about?\"",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842858965178421426_0.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842858965178421426_1.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842858965178421426_2.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842864567124398488",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 17:48:46",
    "content": "Recently, many Chinese netizens sent red envelopes to the Douyin account of the Iranian Embassy in China to support Iran. The note on the red envelope read \"Please help launch this 100 yuan in the form of missiles to the Israeli mainland\" and the Iranian Embassy in China also accepted the red envelopes sent by netizens.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842864567124398488_0.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842864567124398488_1.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842864567124398488_2.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842864567124398488_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842868489050353672",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 18:04:21",
    "content": "On this day in history, on October 6, 1976, Hua Guofeng, Ye Jianying and others jointly directed the arrest of key members of the \"Gang of Four\", ending the Cultural Revolution.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842868489050353672_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842871667288338538",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 18:16:59",
    "content": "Amnesty International announced that it has designated Chinese human rights lawyer Ding Jiaxi, former vice-chairman of the Hong Kong Alliance in Support of Patriotic Democratic Movements of China Zou Xingtong, and founder of Apple Daily Jimmy Lai as \"prisoners of conscience\" and called on the Chinese and Hong Kong authorities to release them immediately. The Hong Kong SAR government expressed strong opposition and condemnation. The SAR government pointed out that the two were successively facing criminal prosecution for suspected crimes endangering national security, which has nothing to do with the pursuit of peace and human rights.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842871667288338538_0.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842871667288338538_1.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842871667288338538_2.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842871667288338538_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842879317665366074",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 18:47:23",
    "content": "October 5, Chongqing. A man bravely spoke out on a social platform: \"They immigrated their families abroad, they defrauded property and transferred it abroad, they fabricated charges to bully the people, they greedily occupied resources, and used charity funds to satisfy their personal desires. Who are the real traitors?\" Netizens replied, \"They are the biggest enemy.\"",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842879317665366074_0.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842879317665366074_1.jpg,/tweet/image/whyyoutouzhele/2024/10/06/1842879317665366074_2.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842879317665366074_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842882662538920391",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 19:00:40",
    "content": "Republican presidential candidate Trump returned to Butler County, Pennsylvania, where he was nearly shot in July, and held another rally. Musk went to the scene to help canvass for votes. On October 6, Musk changed his Twitter account profile picture to a personal photo with elements of the US election, with the US flag in the background, a personal photo of Musk as the main subject, and a black hat with the words \"MAKE AMERICA GREAT AGAIN\".",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842882662538920391_0.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842882662538920391_0.jpg,/tweet/video/whyyoutouzhele/2024/10/06/1842882662538920391_1.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842890888558915798",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 19:33:21",
    "content": "October 5, Nanjing, Jiangsu. Blogger \"He Shi Rui\" saw a woman sitting on the roadside with luggage while riding late at night. The woman said that she was fired by her boss because she was deaf and had nowhere to go. She could only sit on the roadside and wait until dawn to find a job. The kind blogger provided the woman with a place to stay and found her a job.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842890888558915798_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842922118671147040",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 21:37:27",
    "content": "On October 5, Lai Ching-te said in his speech at the 113th National Day Gala of the Republic of China that the PRC could never be the motherland of the Republic of China, but the Republic of China could be the motherland of the people over the age of 75 of the People's Republic of China. In response, former legislator Tsai Cheng-yuan said in a China Television program that Lai Ching-te's statement was stupid. The Republic of China was the previous dynasty, and the People's Republic of China was the later dynasty. So should we say that the Qing Empire was our motherland? This logic does not make sense.",
    "images": "/tweet/image/whyyoutouzhele/2024/10/06/1842922118671147040_0.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842922118671147040_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842925342098428371",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 21:50:16",
    "content": "On October 3, Douyin blogger \"You Zaichuan\" released a controversial short video. The blogger claimed that it is not a bad thing that China does not have freedom of speech. Freedom of speech is used by Western capital as a tool to control China's superstructure and public opinion. He believes that only regimes established through land revolution like China and resource-based countries like Venezuela can truly break free from Western control and realize the people's economic benefits.\nThe blogger also attributed many of the current economic and social problems facing China to the class differentiation after joining the WTO. He cited the Sanlu milk powder incident as an example, claiming that this was due to the lack of nutrition of imported genetically modified soybean meal after joining the WTO, forcing farmers to add melamine.\nAt the end of the video, \"You Zaichuan\" concluded that the lack of freedom of speech is actually necessary, which he described as \"creating a stable environment for buffers.\" He believes that ordinary people should not be allowed to express their opinions at will to maintain social stability...",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842925342098428371_0.jpg,",
    "hasFullContentTranslated": false,
    "fullContent": "10月3日，抖音博主\"犹在川\"发布了一则引发争议的短视频。该博主声称，不要认为中国没有言论自由是坏事，言论自由被西方资本用作控制中国上层建筑和舆论的工具。他认为，像中国这样通过土地革命建立的政权，以及像委内瑞拉这样的资源型国家，才能真正摆脱西方控制，实现了经济利益的民有民享。\n博主还将当前中国面临的诸多经济和社会问题归咎于加入WTO后的阶层分化。他以三鹿奶粉事件为例，声称这是由于加入世贸组织后，进口的转基因大豆豆粕营养不足，迫使农民添加三聚氰胺所致。\n在视频的结尾，\"犹在川\"总结道，言论不自由实际上是必要的，他将其描述为\"营造缓冲器的稳定环境\"。他认为不应允许普通民众随意发表意见，以维持社会稳定。",
    "hasPublished": true
  },
  {
    "id": "1842928618902835511",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 22:03:17",
    "content": "In the early morning of October 6, in Yulin, Shaanxi, a drunk driver had an argument with a roadside food stall owner, then drove away, but soon after turned around and rammed the food stall at a very high speed. Fortunately, the stall owners realized that something was wrong and left in advance, otherwise the consequences would be disastrous.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842928618902835511_0.jpg,/tweet/video/whyyoutouzhele/2024/10/06/1842928618902835511_1.jpg,/tweet/video/whyyoutouzhele/2024/10/06/1842928618902835511_2.jpg,/tweet/video/whyyoutouzhele/2024/10/06/1842928618902835511_3.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1842939867585765393",
    "name": "李老师不是你老师",
    "accountId": "whyyoutouzhele",
    "sensitive": false,
    "createdDate": "2024-10-06 22:47:59",
    "content": "On October 6, Zhengzhou, Henan. A delivery man went to a residential area to deliver food. When he came back, he found that his electric bike was suspected to have been confiscated by the property security guard. The delivery man knelt down outside the residential area and kowtowed repeatedly, \"I need to earn money to feed my children. Please give me the bike. Is that okay?\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/10/06/1842939867585765393_0.jpg,/tweet/video/whyyoutouzhele/2024/10/06/1842939867585765393_1.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]