[{"id":"1830999443447099604","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-04 00:01:00","content":"September 1, Zhengzhou, Henan. Homeowners of Yuhuacheng Community reported that they bought school district housing, but the primary school promised by the developer had not been built when the school was about to start, leaving their children without a school to go to. The owners had no choice but to kneel down and kowtow to the developer.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/04/1830999443447099604_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1831000670511468981","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-04 00:05:52","content":"On September 3, Bloomberg reported that Sun Wen, a former assistant to New York Governor Kathy Hochul, was arrested at her home in New York on Tuesday on charges of being an agent of the Chinese government.\nSun Wen reportedly worked in the New York State government for about 15 years and was fired last year by the Deputy Commissioner of Strategic Business Development of the New York State Department of Labor. The reason for her dismissal was that there was evidence of misconduct.","images":"/tweet/image/whyyoutouzhele/2024/09/04/1831000670511468981_0.jpg,/tweet/image/whyyoutouzhele/2024/09/04/1831000670511468981_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1831053188243599432","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-04 03:34:34","content":"@qiaohuanxin I knew that someone would come to \"refute the rumor\nThe picture has made it very clear, related topics are not displayed, only the search term content is displayed\nYou only display the search term results here, and the topic ban means that no matter how many people use this tag to discuss it fiercely, the system will no longer judge its popularity, so these topics will no longer appear on the hot search and will not be pushed to people. This is an insidious and covert way to reduce the popularity of news","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true}]