[
  {
    "id": "1759986544927027503",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 01:01:05",
    "content": "Netizens added",
    "images": "/tweet/image/whyyoutouzhele/2024/02/21/1759986544927027503_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760024926709527010",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 03:33:36",
    "content": "In the early morning of the 21st, it was reported online that the ceiling of the outpatient hall of Suqian First People's Hospital collapsed",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/21/1760024926709527010_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760243866148508103",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 18:03:36",
    "content": "On February 19, just two days after Shenzhen Fenda Technology started operations, it announced that due to market changes and the impact on order conditions, the Spring Festival holiday for employees in the company's manufacturing system would be extended by two months.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/21/1760243866148508103_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760244773875560704",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 18:07:12",
    "content": "The school was gone when I came back from vacation.\nOn February 20, Nanchang Gongchuang Technical School announced that due to the broken capital chain, the school applied to the higher authorities to stop running the school.\nCurrently, the school is actively dealing with the problem of unpaid wages for teachers and staff, and arranging teachers and staff to go to other schools for interviews.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/21/1760244773875560704_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760253804388245994",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 18:43:05",
    "content": "February 20, Ganzi, Sichuan\nAccording to online reports, monks and Tibetans at Yinnan Temple in Wangbuting Township, Dege County collectively knelt down and begged government workers not to demolish temples and villages.\nIt is reported that in order to build Gangtuo Hydropower Station, surrounding monasteries and villages need to be relocated. Previously, local monks and people went to the county government to ask the government to stop the construction of the hydropower station.\n",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/21/1760253804388245994_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760253825179406705",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 18:43:10",
    "content": "https://t.co/m68uWMDKiN",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1760257303586972145",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 18:56:59",
    "content": "Recently, in order to oppose the early opening of middle schools across the country during the winter vacation, a student mutual assistance movement has been launched in China. College students have become \"telephone heroes\" to help high school students across the country call the local education bureau to report schools that have opened early. At present, there are more than 120,000 comments in the comment area of the relevant video, and even a large number of international students have participated. College students said that participating in this matter is also for the cowardly self in high school.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/21/1760257303586972145_0.jpg,/tweet/image/whyyoutouzhele/2024/02/21/1760257303586972145_1.jpg,/tweet/image/whyyoutouzhele/2024/02/21/1760257303586972145_2.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/21/1760257303586972145_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760266567307198546",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 19:33:48",
    "content": "Follow-up\nThe person in charge of the website said that the Cyberspace Administration of China has completed negotiations with relevant agencies and the website can be temporarily retained.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/21/1760266567307198546_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760268557701480796",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 19:41:43",
    "content": "Recently, two tourists wearing Japanese kimonos appeared in the Dujiangyan Scenic Area in Sichuan. This caused dissatisfaction among the surrounding tourists. In the video, the man laughed and said, \"Catch those little Japanese women and put them in a cage.\" \"Two bastards.\" However, the scenic area responded that if they were not anti-China or insulting China, but just wearing ordinary kimonos, the scenic area would not be able to control it.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/21/1760268557701480796_0.jpg,/tweet/video/whyyoutouzhele/2024/02/21/1760268557701480796_1.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760276965938925710",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 20:15:07",
    "content": "After the State Council supervised the case for more than 4 months, the collapse of the gymnasium of Qiqihar No. 34 Middle School finally came to light:\nOn February 21, the China Emergency Management Bureau issued a document stating that the incident caused 11 deaths, 7 injuries, and direct economic losses of 12.541 million yuan.\nIn this accident, in addition to the 2 responsible persons who died of illness, another 51 responsible persons were held accountable.\nAmong them:\n6 people have been taken compulsory measures by the judicial authorities.\n5 people were recommended to be transferred to the judicial authorities for handling.\n33 public officials were recommended to be given different punishments such as serious warnings within the party, dismissal from government affairs, and demotion of professional and technical positions.\nAnother 7 people were recommended to be fined, revoked the safety production assessment certificate and other administrative penalties.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/21/1760276965938925710_0.jpg,/tweet/image/whyyoutouzhele/2024/02/21/1760276965938925710_1.jpg,/tweet/image/whyyoutouzhele/2024/02/21/1760276965938925710_2.jpg,/tweet/image/whyyoutouzhele/2024/02/21/1760276965938925710_3.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760278830646718862",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 20:22:32",
    "content": "On February 20, AFP reported that Turkey's state news agency Anadolu announced on Tuesday that six people suspected of spying on Uighur refugees in Turkey for Chinese intelligence agencies have been arrested in Istanbul. \nAccording to Anadolu, a seventh suspect is still wanted.\n\n",
    "images": "/tweet/image/whyyoutouzhele/2024/02/21/1760278830646718862_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760282872814989538",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 20:38:36",
    "content": "According to Bloomberg, some public and private equity institutions have received guidance from securities firms, requiring them to prohibit net selling within half an hour of the opening and closing stages.",
    "images": "",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760283199748321493",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 20:39:53",
    "content": "February 20, Shanghai. Investors of Haiyin Wealth came to the headquarters to defend their rights. A conflict broke out at the scene. An investor who participated in the rights protection fell to the ground and a man next to him shouted: My mother has a bad heart.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/21/1760283199748321493_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760291193210970331",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 21:11:39",
    "content": "On February 21, an investor of Haiyin Wealth questioned the operator of Shanghai Lujiazui Public Security Station on the phone, \"Why did you attack an unarmed old man? Why didn't you let the victim enter the company? Why did you force him into the car?\" \"Taiwanese beat several Chinese to death, why didn't you arrest them? Japan occupied the Diaoyu Islands, why didn't you arrest them? What else do you have besides bullying your own people?",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/21/1760291193210970331_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760299680515190857",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 21:45:23",
    "content": "In recent days, wildfires have occurred in Guiyang, Bijie, Liupanshui, Qianxinan and other places in Guizhou. On the 21st, an old man's house in Bijie was burned down by wildfire. The old man cried loudly as he looked at the ruins in front of him. The old man's daughter, Ms. Tang, said, \"The fire has been put out now, the house has been burned down, and now there is nothing left.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/21/1760299680515190857_0.jpg,/tweet/video/whyyoutouzhele/2024/02/21/1760299680515190857_1.jpg,/tweet/video/whyyoutouzhele/2024/02/21/1760299680515190857_2.jpg,/tweet/video/whyyoutouzhele/2024/02/21/1760299680515190857_3.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760300258309857349",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 21:47:41",
    "content": "On February 21, a Chinese student studying in France shared a Spring Festival gift package from the Chinese Embassy in France on Xiaohongshu, only to find that the candies inside were expired.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/21/1760300258309857349_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1760331241423769985",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-21 23:50:47",
    "content": "On the evening of February 21, the Yunxi Farmers' Market in Jiaozhou, Shandong Province collapsed under the weight of snow. It was reported that the market had just been renovated a year ago.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/21/1760331241423769985_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]