[{"id":"1806406788310254037","name":"李老师不是你老师","createdDate":"2024-06-28 03:18:34","content":"In the early morning of June 28, a fire broke out in Guiyang","images":"/tweet/image/whyyoutouzhele/2024/06/28/1806406788310254037_0.jpg,/tweet/image/whyyoutouzhele/2024/06/28/1806406788310254037_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/06/28/1806406788310254037_0.jpg,/tweet/video/whyyoutouzhele/2024/06/28/1806406788310254037_1.jpg,","hasPublished":true},{"id":"1806528477522198750","name":"李老师不是你老师","createdDate":"2024-06-28 11:22:07","content":"On June 28, the Suzhou Public Security Bureau issued a public notice that Hu Youping, a crew member who stood up to stop the suspect in the \"June 24\" Japanese school bus attack in Suzhou, Jiangsu, died on the 26th due to serious injuries. Suzhou City announced that he would be posthumously awarded the title of \"Model of Righteous Acts of Bravery\" in Suzhou City.\nThe Japanese Embassy in China lowered its flag to half-mast to pay tribute to her. It also said, \"I believe her courage and kindness also represent the vast majority of Chinese people.\"","images":"/tweet/image/whyyoutouzhele/2024/06/28/1806528477522198750_0.jpg,/tweet/image/whyyoutouzhele/2024/06/28/1806528477522198750_1.jpg,","videos":"","hasPublished":true},{"id":"1806540569373778235","name":"李老师不是你老师","createdDate":"2024-06-28 12:10:10","content":"According to the injured, when the suspect was committing the crime, Hu Youping stopped the suspect and was stabbed and fell to the ground, and the son of the Japanese adult victim took the opportunity to escape.\nCitizens who witnessed the scene saw that Hu Youping first grabbed the suspect and then hugged the suspect from behind. The suspect stabbed her with his backhand, causing her to fall to the ground but continued to chase and stab her. She was subdued on the road by citizens, passing drivers and patrol police.","images":"/tweet/image/whyyoutouzhele/2024/06/28/1806540569373778235_0.jpg,","videos":"","hasPublished":true}]