[{"id":"1763601595315462470","name":"李老师不是你老师","createdDate":"2024-03-02 00:26:01","content":"On February 29, a notice on standby was circulated online. Hefei Construction Group announced that due to external privacy factors such as Evergrande's debt crisis and the overall decline of the real estate industry, employees will be placed on standby starting from March 1, and the standby date will end on December 31, 2024. During the standby period, only the minimum wage of Hefei will be paid from the second month. If the actual salary after deducting social security and provident fund is lower than the minimum living allowance of Hefei of 924 yuan/month, it will be paid at 924 yuan/month.","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763601595315462470_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763672346844397979","name":"李老师不是你老师","createdDate":"2024-03-02 05:07:09","content":"On February 28, the European Parliament emphasized in the 2023 EU Foreign and Security Policy Report that \"China's territorial claims against Taiwan have no basis in international law, Taiwan and China are not subordinate to each other, and only the democratically elected government of Taiwan can represent the Taiwanese people internationally\" and strongly condemned the Chinese national leaders' remarks that they would not give up the use of force against Taiwan. On February 29, the spokesperson of the Chinese Mission to the European Union expressed the strongest condemnation of the issue and advised those politicians to read more books.","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763672346844397979_0.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763672346844397979_1.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763672840899838065","name":"李老师不是你老师","createdDate":"2024-03-02 05:09:07","content":"It is worth mentioning that China had previously sent goodwill signals to the EU and has implemented unilateral visa-free policies for various EU countries in recent months. Chinese Foreign Minister Wang Yi has also visited Europe many times recently to meet with relevant parties.","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763672840899838065_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763718926922297565","name":"李老师不是你老师","createdDate":"2024-03-02 08:12:15","content":"After the Texas accident, other local schools immediately took action - requiring parents to sign a \"Day Student Safety Responsibility Letter\". Parents must agree to be responsible for all safety after leaving the school before they can let their children go to school as day students.","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763718926922297565_0.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763718926922297565_1.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763878288399778069","name":"李老师不是你老师","createdDate":"2024-03-02 18:45:29","content":"Recently, the daughter of a veteran who fought in the Korean War in Changchun posted a video asking for help under her real name, saying that her father had no pension after his death, not even a bouquet of flowers.\nShe questioned that all these concerns for veterans were written on the wall, but none of them were realized.\nShe also said that she went to jail three times a year to protect her father's rights.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/02/1763878288399778069_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763884129513279705","name":"李老师不是你老师","createdDate":"2024-03-02 19:08:42","content":"On January 12, the owners of Yunxi Lingfeng in Xi'an High-tech Zone, Shaanxi Province, went to the Housing and Construction Bureau to defend their rights but were driven away by the police.\nIt is reported that Yunxi Lingfeng held a \"house handover ceremony\" on its own when the house was delayed for several months and the project was not completed at all, which led to the owners going to the Housing and Construction Bureau to defend their rights.\nTo this day, Yunxi Lingfeng is still under construction and the house handover is nowhere in sight.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/02/1763884129513279705_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763885951414071718","name":"李老师不是你老师","createdDate":"2024-03-02 19:15:56","content":"On March 2, the official reported that the former village party secretary built a villa on 60 mu of land. It was verified that the village director Huang Mouxiong reported by netizens had no longer held the position since March 2014, and was criminally detained on January 9, 2024 for suspected illegal transfer of land use rights, and was approved for arrest on February 2.","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763885951414071718_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763886354671222847","name":"李老师不是你老师","createdDate":"2024-03-02 19:17:33","content":"On March 2, a building collapsed in the market of Gangping Town, Huaiji County, Zhaoqing City, Guangdong Province. The specific casualties are yet to be reported.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/02/1763886354671222847_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763889650068771191","name":"李老师不是你老师","createdDate":"2024-03-02 19:30:38","content":"On March 2, a delivery guy in Wuhan posted a video showing that when he was delivering food to Wuhan No. 15 Middle School, he found that the teachers' food could be put inside the house, while the students' food could only be put on the ground in the rain.\nThe guy lamented that \"there are different levels of food delivery\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/02/1763889650068771191_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763908222618874366","name":"李老师不是你老师","createdDate":"2024-03-02 20:44:26","content":"On March 1, a blogger said that the limit of China Construction Bank has been further tightened. He said that the news he got from the account manager of CCB was that after the central bank strengthened supervision, CCB created a calculation model to analyze the flow of each card within a certain period of time and then automatically generate the limit. \nMoreover, it is very troublesome to increase the limit. If you want a high approval rate, you must provide a lot of supporting documents. Each increase in the limit takes three months.","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763908222618874366_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763921705813045645","name":"李老师不是你老师","createdDate":"2024-03-02 21:38:01","content":"At about 16:00 on February 27, a white car suddenly rushed into the demolition construction site of Dongxiuhengdeng Village, Yanbu, Dali Town, Nanhai District, Foshan City, and rammed back and forth, injuring 6 construction workers and law enforcement staff on the site. \nAt present, the car driver Huang (male, 49 years old) has been detained in accordance with the law on suspicion of intentional injury.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/02/1763921705813045645_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763928290820006027","name":"李老师不是你老师","createdDate":"2024-03-02 22:04:11","content":"On February 27, China Minsheng Bank issued an announcement stating that the company's board of directors reviewed and approved the \"2023 Bank-wide Performance Compensation Recovery Report.\" This is also the first report this year by a listed bank to publicly disclose that it will recover performance-based compensation from employees, but the resolution did not disclose the specific amount of recovery and the number of people involved.","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763928290820006027_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763941196148138120","name":"李老师不是你老师","createdDate":"2024-03-02 22:55:28","content":"On March 2, the student posted again saying that the Chinese Embassy in France had contacted him about the issue of the expired candies being distributed by the Chinese Embassy in France and provided written instructions from the domestic manufacturer and the French importer to confirm that the candies in the New Year gift package were within the shelf life. According to the explanation provided by Shanghai Guanshengyuan, the expiration date that the students had mistakenly believed was actually the production date. The actual expiration date is 02/01/2025","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763941196148138120_0.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763941196148138120_1.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763941196148138120_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763942182593937525","name":"李老师不是你老师","createdDate":"2024-03-02 22:59:23","content":"Netizens added","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763942182593937525_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763943439484256669","name":"李老师不是你老师","createdDate":"2024-03-02 23:04:23","content":"Since the beginning of the school year, Northwest A&F University has seen excessive formaldehyde levels in student dormitories and theft of student property.\nWhen the school authorities did nothing, students began to post a \"Letter to Classmates\" at school, calling on classmates to unite and protect their rights.\nLater, a student posted the picture on TikTok and was warned by someone pretending to be a police officer.","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763943439484256669_0.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763943439484256669_1.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763949634584564017","name":"李老师不是你老师","createdDate":"2024-03-02 23:29:00","content":"March 2, Shanghai. A woman posted a video saying that in order to make her resign voluntarily, the company placed images of Zhong Kui around her workstation. The boss said that these images were used to catch ghosts.\nThe woman said that she had worked in this company for 2 and a half years, and now the company forced her to resign on the grounds of communication barriers.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/03/02/1763949634584564017_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1763949904622198822","name":"李老师不是你老师","createdDate":"2024-03-02 23:30:04","content":"https://t.co/Ah94NvuHIP","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763949904622198822_0.jpg","videos":"","hasPublished":true},{"id":"1763954556566749590","name":"李老师不是你老师","createdDate":"2024-03-02 23:48:33","content":"A veteran from Shenqiu County, Henan Province who participated in the Wenchuan rescue operation was detained for crying at the hospital and complaining that his daughter contracted viral encephalitis after being vaccinated. On March 2, netizens discovered that a mother continued to plead grievances for her husband and children on the Internet. According to the mother, on May 9, 2014, Zhao Yichen, who was just over 1 year old, contracted viral encephalitis after being vaccinated with an inactivated Japanese encephalitis vaccine and became a vegetative state. That year in Shenqiu County, Henan, he was disabled and died due to vaccination. There is more than one incident.\nAfter Zhao Yichen's accident, her family took her around for treatment these years. His father, Zhao Zhenfeng, cried and complained about his experience in the lobby of Peking University First Affiliated Hospital in 2019 and was detained by the Beijing police for seven days for disturbing order in the unit.\nAccording to Zhao Yichen’s mother, Zhao Zhenfeng has been in the army for more than ten years and participated in the 2008 Wenchuan earthquake disaster relief. After his daughter’s accident, Shenqiu County department leaders went to the army to put pressure on Zhao Zhenfeng to retire. As a result, the family lost its only source of income...","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763954556566749590_0.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763954556566749590_1.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763954556566749590_2.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763954556566749590_3.jpg","videos":"","hasFullContentTranslated":false,"fullContent":"河南沈丘县一名曾参加过汶川抢险的退伍老兵，因在医院哭诉女儿接种疫苗后患上病毒性脑炎被拘留。3月2日，网友发现一位母亲在网络上持续为自己的丈夫孩子申冤。据这位母亲介绍，2014年5月9日，刚过1岁的赵一晨因接种乙型脑炎灭活疫苗后患病毒性脑炎，成为了植物人，而当年河南沈丘县因接种疫苗致残致死的事件不止一例。\n赵一晨出事后，这些年家人带着她四处治疗。其父赵振峰曾于2019年在北京大学第一附属医院大厅内哭诉自己的遭遇，被北京警方以扰乱单位秩序为由拘留七天。\n据赵一晨母亲称，赵振峰入伍十几年，曾参与2008年汶川地震救灾，女儿出事后，沈丘县部门领导去部队施压，要求赵振峰退役。导致家里断掉了唯一的收入来源。\n据赵一晨母亲在2月28日发布的视频称，植物人的女儿目前脚部变形、脊椎侧弯、大跨脱位、全身肌肉萎缩，只能吃流食，带尿不湿，用开塞露。","hasPublished":true},{"id":"1763954958448185556","name":"李老师不是你老师","createdDate":"2024-03-02 23:50:09","content":"https://t.co/kavibFrKqZ","images":"/tweet/image/whyyoutouzhele/2024/03/02/1763954958448185556_0.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763954958448185556_1.jpg,/tweet/image/whyyoutouzhele/2024/03/02/1763954958448185556_2.jpg","videos":"","hasPublished":true}]