[{"id":"1649095170992881667","name":"李老师不是你老师","createdDate":"2023-04-21 00:58:22","content":"Netizen contribution\nRecently, an announcement by the Linzhi Municipal Agriculture and Rural Affairs Bureau about the purchase of law enforcement equipment has sparked heated discussions among netizens.\nThe purchase list includes \"undercover evidence collection equipment, signal blockers, stab-proof vests, electric batons, night vision goggles\", etc.\n\nRegarding \"agricultural management\", according to the explanation of the official website, in accordance with the principle of one law enforcement team for one department, the administrative law enforcement functions originally scattered in the internal institutions and affiliated units of the local agricultural and rural departments will be integrated to form an agricultural comprehensive administrative law enforcement team, and law enforcement will be unified in the name of the agricultural and rural departments.\nExcept for a few places with heavy fishery law enforcement tasks such as coastal areas, inland rivers and lakes, and border junctions, relatively independent fishery law enforcement teams will continue to be set up in the agricultural and rural departments. Agricultural and rural departments in various places have basically achieved one team for law enforcement. According to the requirements of the central government, the establishment of this team comes from the institutions and units that originally assumed law enforcement responsibilities.","images":"/tweet/image/whyyoutouzhele/2023/04/21/1649095170992881667_0.jpg,/tweet/image/whyyoutouzhele/2023/04/21/1649095170992881667_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1649362200841076738","name":"李老师不是你老师","createdDate":"2023-04-21 18:39:27","content":"Netizen contribution\nA Zhejiang University student was rejected for civil service due to his insulting remarks against China. The official response said that he had voluntarily given up the position.","images":"/tweet/image/whyyoutouzhele/2023/04/21/1649362200841076738_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/67XbZhe2tC","accountId":"whyyoutouzhele"},{"id":"1649363234703527936","name":"李老师不是你老师","createdDate":"2023-04-21 18:43:33","content":"Netizen contribution\nRecently, there have been constant disturbances in the domestic single-player game circle. Previously, there was a malicious refund for \"Resident Evil 4 Remake\"\nAfter that, another netizen posted a letter of complaint against China's largest Xbox player community, Price Comparison Assistant.","images":"/tweet/image/whyyoutouzhele/2023/04/21/1649363234703527936_0.jpg,/tweet/image/whyyoutouzhele/2023/04/21/1649363234703527936_1.jpg,/tweet/image/whyyoutouzhele/2023/04/21/1649363234703527936_2.jpg,/tweet/image/whyyoutouzhele/2023/04/21/1649363234703527936_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/wENTirwSWu","accountId":"whyyoutouzhele"},{"id":"1649363620357189635","name":"李老师不是你老师","createdDate":"2023-04-21 18:45:05","content":"User contribution\nOn April 18, Wistron, the world's third largest notebook computer OEM, issued an announcement that its factory in Taizhou, Jiangsu, China will suspend operations on April 26 due to consecutive years of losses.","images":"/tweet/image/whyyoutouzhele/2023/04/21/1649363620357189635_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/sHj93K7Nyd","accountId":"whyyoutouzhele"},{"id":"1649364322244521985","name":"李老师不是你老师","createdDate":"2023-04-21 18:47:52","content":"On April 20, a staff member of Yunnan University of Technology stated that the recent rumor of \"a female student being sexually assaulted by three black men\" was a rumor and the police had been notified.","images":"/tweet/image/whyyoutouzhele/2023/04/21/1649364322244521985_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/Y4Y3lUOLLn","accountId":"whyyoutouzhele"},{"id":"1649364558694297600","name":"李老师不是你老师","createdDate":"2023-04-21 18:48:49","content":"Netizen contribution\nThe Communist Youth League Central Committee issued a statement saying that the revision of the Anti-Espionage Law intends to improve the provisions on cyber espionage.","images":"/tweet/image/whyyoutouzhele/2023/04/21/1649364558694297600_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/ThYOE25LyX","accountId":"whyyoutouzhele"},{"id":"1649370621447471104","name":"李老师不是你老师","createdDate":"2023-04-21 19:12:54","content":"Netizen contribution\nRecently, Beijing Metro changed its pinyin back to English.\nPreviously, Beijing Metro had changed all English translations to pinyin. For example, \"XX Station\" was changed to \"XX Zhan\".","images":"/tweet/image/whyyoutouzhele/2023/04/21/1649370621447471104_0.jpg,/tweet/image/whyyoutouzhele/2023/04/21/1649370621447471104_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/cNQNpjzq4c","accountId":"whyyoutouzhele"}]