[{"id":"1806001431293407749","name":"李老师不是你老师","createdDate":"2024-06-27 00:27:49","content":"On June 25, the black-clad men who blocked the gate of Jianghuai College of Anhui University and prevented students from leaving during the protest appeared in a propaganda video of the Hefei police.\nThe unidentified people who blocked the school gate were confirmed to be Hefei police.","images":"/tweet/image/whyyoutouzhele/2024/06/27/1806001431293407749_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/06/27/1806001431293407749_0.jpg,","hasPublished":true},{"id":"1806004456510939208","name":"李老师不是你老师","createdDate":"2024-06-27 00:39:51","content":"On June 26, Wang Tianyi, the \"number one\" Chinese chess player, was taken away by Hangzhou police for investigation on suspicion of bribery by non-state employees.\nThe article said that the real-name report by chess master Liu Dahua, which was exposed in October last year, was one of the \"triggers\" of this case.","images":"/tweet/image/whyyoutouzhele/2024/06/27/1806004456510939208_0.jpg,","videos":"","hasPublished":true},{"id":"1806016179410203097","name":"李老师不是你老师","createdDate":"2024-06-27 01:26:25","content":"On June 26, there were rumors in the industry that \"some public funds have requested that salaries paid in excess of 2.9 million yuan in 2023 be returned.\" \nA reporter verified that at present, some public funds under central enterprises have indeed implemented salary restrictions, and the reimbursement of salaries exceeding the standard since 2022 has started this week, but the reimbursement standard is not the above 2.9 million yuan, but a partial reimbursement after reaching a certain standard.","images":"/tweet/image/whyyoutouzhele/2024/06/27/1806016179410203097_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/06/27/1806016179410203097_0.jpg,","hasPublished":true},{"id":"1806019688792547482","name":"李老师不是你老师","createdDate":"2024-06-27 01:40:22","content":"June 26, Tibet. A blogger said that he was selling milk tea at a stall by the lake, and a group of tourists came and sat on the chairs he placed without permission. He went forward to argue, but was beaten and choked by the leader. The video shows that the blogger's eyes are red and there are multiple scars on his mouth and neck.","images":"/tweet/image/whyyoutouzhele/2024/06/27/1806019688792547482_0.jpg,/tweet/image/whyyoutouzhele/2024/06/27/1806019688792547482_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/06/27/1806019688792547482_0.jpg,/tweet/video/whyyoutouzhele/2024/06/27/1806019688792547482_1.jpg,","hasPublished":true},{"id":"1806260228784067026","name":"李老师不是你老师","createdDate":"2024-06-27 17:36:11","content":"On June 27, the female anchor of Zhong Xuegao's live broadcast room suddenly fainted during the live broadcast.\nThe live broadcast room then replaced the anchor and said that the fainted anchor had gone to rest and would go to the hospital later.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/27/1806260228784067026_0.jpg,","hasPublished":true},{"id":"1806261184229777741","name":"李老师不是你老师","createdDate":"2024-06-27 17:39:59","content":"On June 27, at Tangde Garden in Tianhe District, Guangzhou, an urban management officer got into an argument with a coconut vendor, who then hit the officer on the head with a shovel.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/06/27/1806261184229777741_0.jpg,","hasPublished":true},{"id":"1806261489809928317","name":"李老师不是你老师","createdDate":"2024-06-27 17:41:12","content":"https://t.co/5EaGAjT4uO","images":"/tweet/image/whyyoutouzhele/2024/06/27/1806261489809928317_0.jpg,","videos":"","hasPublished":true}]