[{"id":"1838996701006184605","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 01:39:15","content":"Today is the seventh day after the death of little boy Hangping. On the 93rd anniversary of the September 18th Incident, he was attacked with a knife outside a Japanese school in Shenzhen. The school bus guide Hu Youping stepped forward and was seriously injured by the assailant. He also unfortunately passed away.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1838996701006184605_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1838996701006184605_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1838996701006184605_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1838996701006184605_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839015782631542983","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 02:55:04","content":"On September 24, many netizens in Zhoucun District, Zibo, Shandong Province posted videos saying that they felt sore throats, coughed, and had difficulty breathing due to unknown gases. On the 25th, the Zhoucun District Emergency Management Bureau responded that it was tear gas dropped by the army during training, which had no effect on the human body and had now dissipated, and the air had returned to normal.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839015782631542983_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839015782631542983_0.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839015782631542983_1.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839015782631542983_2.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839017202340737451","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 03:00:42","content":"On September 25, during morning exercises at Xiadu School in Yuzhou, Henan, a boy stood outside the window of the fourth floor of the school building and seemed to be about to jump off the building. The situation was very dangerous. A female teacher filmed the video and called the police, but was scolded by a male teacher: \"Don't call the police.\"","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839017202340737451_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839017202340737451_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839030682355642592","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 03:54:16","content":"September 25 (Release), Datong, Shanxi. Recently, a female student from Datong University in Shanxi Province purchased 12 yuan of jujube online and asked for a refund instead of a return, saying that the outer packaging bag was wrinkled. After being rejected by the merchant, she insulted the customer service for an hour. After the staff preserved the evidence and contacted the school to no avail, they had no choice but to send a video to ask for an explanation. The reporter contacted the school staff, who said that the matter is currently being handled.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839030682355642592_0.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839030682355642592_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839031727706214718","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 03:58:26","content":"September 25, Beijing. The publisher of Democracy and Legal System has owed wages for many years and has not paid pensions. Three station chiefs went to the door of the State Administration of Press and Publication to demand their wages. According to insiders, they are Liu Zhiyan, station chief in Heilongjiang, Luo Zongming, station chief in Guangxi, and Li Qing, station chief in Hunan.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839031727706214718_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839031727706214718_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839031727706214718_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839031727706214718_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839036114142732717","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 04:15:51","content":"On September 24, the owners' committee of Jinze Building in Tianhe District, Guangzhou City, was scheduled to count the votes at 7:30 p.m. on September 24. At 7 p.m., while the ballot box of the owners' meeting was being moved to the counting location, it was suddenly and violently snatched away by a man in black (suspected to be assigned by the property management). The female owner was attacked and fell to the ground, \"hitting her head against a pillar, breaking her teeth and having a headache\", and was rushed to the hospital.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839036114142732717_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839036114142732717_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839048982875845018","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 05:07:00","content":"On September 25, senior high school students from Peixian Middle School in Jiangsu Province protested against the school's ban on senior high school students from participating in sports games. The students gathered in front of the teacher's office that night and shouted \"Give me back the sports games.\"\nThe office director finally compromised, but threatened the students: \"You won, but you will lose more.\"\nThe students said: \"We lost more oppression, but we got rest and the freedom and light that belong to us in the future!\"","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839048982875845018_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839048982875845018_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839048982875845018_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839048982875845018_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839063045298913326","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 06:02:52","content":"Netizen submission: In Jinhua Tea City Community, Dezhou City, Shandong Province, on July 10 this year, in order to clear the land, the developer forcibly demolished the guard booths on the public land at the north and south gates of the community (resulting in only one guard booth now, and many more idle people inside the community, which has dramatically increased the risk of property safety and personal safety of residents). After the residents found that the booths were demolished, they stopped the trucks transporting construction machinery and refused to let them leave. Later, the police came and \"pointed at the residents\" and yelled and scolded them. A resident posted the video at that time on Douyin (without exaggeration or any narration), which attracted the attention of netizens and was played a lot. When the video reached 10,000 views, the police came to ask for the video to be deleted.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839063045298913326_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839064011041812883","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 06:06:43","content":"On September 25, villagers in Shitun Village, Xiaotun Town, Ruzhou City, Pingdingshan City, Henan Province, protested against underground coal mining that caused ground collapse and endangered houses, and demanded an end to the mining of the Pingmei Chaochuan Coal Mine.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839064011041812883_0.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839064011041812883_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839067638992924864","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 06:21:08","content":"On September 25, the Central Committee of the Communist Party of China and the State Council issued an opinion on implementing an employment-first strategy to promote high-quality and full employment. The opinion proposed to increase the proportion of labor remuneration in the primary distribution and strengthen macro-guidance on the distribution of enterprise wage income.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839067638992924864_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839067638992924864_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839070093742928202","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 06:30:53","content":"On September 25, according to the Central Commission for Discipline Inspection and the National Supervisory Commission’s Discipline Inspection and Supervision Group stationed at the State-owned Assets Supervision and Administration Commission of the State Council and the Tianjin Commission for Discipline Inspection and Supervision, Lu Jin, former Party Secretary and Chairman of China National Gold Group Corporation, was suspected of serious violations of discipline and law and is currently under investigation. According to the announcement of China National Gold on August 23, just one month ago, Lu Jin resigned from the positions of Chairman, Director, Chairman and Member of the Board’s Strategic Committee for personal reasons.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839070093742928202_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839070093742928202_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839070093742928202_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839070093742928202_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839070265814155419","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 06:31:34","content":"https://t.co/xFqU5350gT","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839070265814155419_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839070265814155419_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839070265814155419_2.jpg,","videos":"","hasPublished":true},{"id":"1839075193475477541","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 06:51:09","content":"On September 26, the state-owned enterprise China Agricultural Federation's agricultural wholesale market project \"Smart Cloud Mall\" in Jingzhou City was left unfinished. Since 2021, three years have passed since the project was built, and it has not been completed. The house will not be delivered within the agreed period, and no interest or liquidated damages will be paid. More than a thousand owners have complained through various channels and petitioned for their rights to no avail, demanding the refund of their prepayments.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839075193475477541_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839075193475477541_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839075193475477541_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839075193475477541_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839075359079256429","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 06:51:48","content":"https://t.co/1Bfri4eyUT","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839075359079256429_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839075359079256429_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839075359079256429_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839075359079256429_3.jpg,","videos":"","hasPublished":true},{"id":"1839079011365917084","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 07:06:19","content":"On September 25, China's Ministry of Commerce urged the United States to abandon proposed rules restricting Chinese automotive software and hardware, saying it would take \"necessary measures\" to safeguard the rights and interests of domestic companies.\nThe Ministry of Commerce said China firmly opposes the restrictions, calling them protectionist practices without factual basis and violating the principles of market economy and fair competition.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839079011365917084_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839082195119493530","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 07:18:58","content":"On September 25, the Ministry of Finance and the Ministry of Civil Affairs announced that they would provide living subsidies to vulnerable groups such as the extremely poor and orphans before the National Day holiday next week, but no specific details have been disclosed. The two departments asked local governments to ensure that the relief funds were delivered to the recipients before the National Day holiday, and to promptly convey \"the care and concern of the Party and the government for the people in need.\"","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839082195119493530_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839084135832498468","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 07:26:41","content":"On September 25, China launched an intercontinental ballistic missile into the Pacific Ocean, its first ICBM launch in 44 years. The test was Beijing's first major missile launch since it conducted two hypersonic weapons tests in the summer of 2021.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839084135832498468_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839084135832498468_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839084135832498468_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839084135832498468_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839088455873093947","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 07:43:51","content":"On September 25, the Financial Times reported that the FBI is investigating whether a Silicon Valley venture capital firm called Hone Capital leaked secrets to China and whether it obtained technical, financial or customer information about start-ups for its Beijing-based owners or Chinese authorities. Hone Capital was founded in 2015 with initial capital from the Chinese private equity group CSC, one of the most active early investors in Silicon Valley. Former executives Veronica Wu and Purvi Gandhi accused Hone's Chinese shareholders in public court documents of providing them with incentives to invest in specific technologies with \"critical intellectual property rights.\"","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839088455873093947_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839088455873093947_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839088455873093947_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839088455873093947_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839096444222943529","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 08:15:35","content":"Affected by the rainfall, as of September 24, 69 townships in Shangqiu, Henan Province were affected, and the affected population exceeded 430,000.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839096444222943529_0.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839096444222943529_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839100744244269235","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 08:32:40","content":"China's Guangdong Province has recently seen a large-scale dengue fever outbreak, with Guangzhou, Shenzhen, Foshan and other places reporting nearly 1,000 cases within a week, showing regional point-like outbreak characteristics. The epidemic began to heat up in August and spread further in September. Hong Kong has recorded 12 imported cases, and Taiwan's New Taipei City has also seen 7 local cluster cases. The international medical journal The Lancet pointed out that 2024 may be the worst year for dengue fever in the world's recorded history, and warned that climate change may lead to a wider spread of dengue fever.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839100744244269235_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839104295809016084","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 08:46:47","content":"Recently, a netizen posted on Xiaohongshu that \"I am almost starving to death in Zhengzhou.\" The netizen shared his experience. He submitted more than 40 resumes and only got a job as a medical representative with a basic salary of 3,500 yuan. After working for four months, the boss did not even pay his salary. He called the 12333 labor assistance hotline and was told that the internship agreement could not be managed. The netizen went to interview for many jobs, including tea artist, subway security inspector, clerk, human resources, e-commerce, customer service, front desk, new media operation and other positions. He was either kicked out after the unpaid trial period, or was deceived, or did some jobs with extremely low pay and long working hours.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839104295809016084_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839104295809016084_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839104295809016084_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839104295809016084_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839109053844238774","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 09:05:42","content":"On September 25, there was judicial progress in the gymnasium collapse accident at the 34th Middle School in Qiqihar City, Heilongjiang Province, which caused 11 deaths and 7 injuries. The indictment of the Longjiang County Procuratorate showed that Qu Wenxun, the then district head of Longsha District where the school is located, was charged with bribery and embezzlement. Wu Kangyan, the former full-time secretary of the school, and 13 project personnel were charged with dereliction of duty by state-owned institutions, major responsibility accidents, bribery, collusion in bidding, and false VAT invoices for different behaviors in the gymnasium maintenance project and the bidding and construction of the new auxiliary complex project, as well as past behaviors. Some of them were suspected of only one crime, while others were charged with two or three crimes.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839109053844238774_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839109053844238774_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839109053844238774_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839238607929807201","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 17:40:30","content":"On September 25, the video that exposed the hidden camera incident in Shijiazhuang hotels and homestays has been removed from the Internet.\nAt the same time, the blogger issued a statement to apologize to all the people of Shijiazhuang. He said that the entire Shijiazhuang population of 11 million should not pay for these 20 or 30 businesses. The peak tourism season for the National Day is coming, and in the future, he is willing to shoot cultural and tourism promotional videos for Shijiazhuang for free, and it is his duty to protect the image of Shijiazhuang.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839238607929807201_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839241671751417869","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 17:52:40","content":"On September 26, Xi Jinping presided over an economic work meeting of the Political Bureau of the CPC Central Committee. At the meeting, he acknowledged that China is currently facing economic difficulties and proposed that \"we must view the current economic situation comprehensively, objectively and calmly, and face up to the difficulties.\"","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839241671751417869_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839244771581186316","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 18:04:59","content":"On September 24, the People's Bank of China announced that it would use 800 billion yuan to stimulate the stock market by lending to asset management companies, insurance companies and brokers to buy stocks, and to listed companies to buy back stocks. On September 26, A-shares closed up across the board, with the Shanghai Composite Index up 3.61%, standing above the 3,000-point mark; the Shenzhen Component Index up 4.44%, and the ChiNext Index up 4.42%. Many stocks in the liquor, food and real estate sectors hit their daily limit.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839244771581186316_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839244771581186316_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839244771581186316_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839244771581186316_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839248529295896615","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 18:19:55","content":"September 26 (Release), a netizen submitted a post, Kunshan, Suzhou. During the 2022 epidemic, he bought a pre-sale house built by China Construction Seventh Engineering Bureau at a high price, and the house was delivered in early September 2024. A few days later, there was a typhoon and rain, and the house he bought leaked. The wallpaper on the entire wall was soaked and rotten. The owner's rights protection and desire for compensation were fruitless, and the property and the developer passed the buck to each other. The netizen mentioned that the property was still the property owned by the developer, and replied to the owner: This matter is not their responsibility.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839248529295896615_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839248529295896615_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839248529295896615_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839248529295896615_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839248689300144417","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 18:20:33","content":"https://t.co/heUswMU2mj","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839248689300144417_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839248689300144417_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839248689300144417_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839248689300144417_3.jpg,","videos":"","hasPublished":true},{"id":"1839250873509105939","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 18:29:14","content":"On September 26, according to a report by Kyodo News and NHK, the Japanese Maritime Self-Defense Force destroyer Haruna passed through the Taiwan Strait on September 25. This was the first time that a Japanese Maritime Self-Defense Force ship passed through the strait.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839250873509105939_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839251332084982224","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 18:31:03","content":"On September 26, Foreign Ministry Spokesperson Lin Jian hosted a regular press conference. A reporter asked, according to media reports, a destroyer of the Japan Maritime Self-Defense Force reportedly sailed through the Taiwan Strait on the 25th. This is also the first time that a Japanese destroyer has sailed through the Taiwan Strait. What is China's response to this?","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839251332084982224_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839252427255480743","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 18:35:24","content":"September 25, Jiaozhou, Shandong. A suspected wounding incident occurred at the Mixue Bingcheng Xihu Market store.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839252427255480743_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839252427255480743_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839252427255480743_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839252427255480743_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839264957742923943","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 19:25:12","content":"The follow-up development of the Japanese school incident from the perspective of Little Pinks:","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839264957742923943_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839269054323847500","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 19:41:29","content":"On September 23, in Linyi, Shandong, a netizen in Shandong posted several videos online, reflecting that Laiwu Iron and Steel Group Lunan Mining Co., Ltd. was exposed to discharge the wastewater from the black tailings pond directly into the reservoir. Someone reported the situation to the local Environmental Protection Bureau, and the Environmental Protection Bureau responded that there is a special monitoring agency at the reservoir, and the agency has not yet reported the alarm. The Environmental Protection Bureau has sent people to the scene to collect water samples, and no abnormalities were found after testing. It is reported that the polluted reservoir is the Bashan Reservoir in Yishui County, Linyi City, which is the source of drinking water for 1.2 million people in Yishui County. On the morning of September 24, a staff member of the Yiyuan Branch of the Zibo Municipal Ecological Environment Bureau responded to reporters that he knew that the wastewater from the tailings pond of Laiwu Iron and Steel Group Lunan Mining Co., Ltd. was discharged into the Yi River. The incident happened a week or two ago. The discharge of wastewater was not the subjective intention of the mine, but the tailings pond was damaged. The staff also said that during the on-site handling, they ordered Lunan Mining Co., Ltd. to repair the damaged points of the tailings pond and complete the rectification...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839269054323847500_0.jpg,","hasFullContentTranslated":false,"fullContent":"9月23，山东临沂，山东一位网友在网上发布多段视频反映，莱芜钢铁集团鲁南矿业有限公司被曝将黑色尾矿库废水直接排入水库。有人向当地环保局反映情况，环保局回应称，水库那边有专门的监测机构，机构还没有报警，且环保局已派人到现场采集水样，经检测未发现异常。据悉，被污染水库为临沂市沂水县的跋山水库，是沂水县120万人口的饮用水来源水库。\n而9月24日上午，淄博市生态环境局沂源分局工作人员回应记者称，莱钢集团鲁南矿业有限公司尾矿库废水排入沂河的事情他知道，事发一两周了，排放废水并非矿上主观故意，而是尾矿库泡坏了一个点（音）。工作人员还称，处理现场期间，他们责令鲁南矿业有限公司修复尾矿库被泡坏的点，完成整改。“问题当天就解决了，行政处罚正按程序推进。”","hasPublished":true},{"id":"1839271463997591957","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 19:51:03","content":"On the evening of September 25, in Tianjin, a female driver hit a food delivery guy while driving. Both people were fine, and the car was not seriously damaged, just a minor bump. Enthusiastic people came forward to persuade everyone to disperse, but the driver suddenly said: Tianjin people are idiots. The Tianjin people who were watching around were unwilling to hear this and asked the driver to apologize, but she refused to apologize. The police still refused to admit their mistakes when they arrived, which aroused the anger of the onlookers. Finally, the police took the woman to the police station, and the onlookers also went there to ask her to apologize. The woman apologized in public.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839271463997591957_0.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839271463997591957_1.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839271463997591957_2.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839271463997591957_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839272230179557826","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 19:54:06","content":"On the evening of September 25, Dingxi, Gansu Province, encountered extreme hail weather. Videos posted by citizens showed that hailstones the size of peanuts fell densely on the ground, and the road turned into an ice river. According to the Gansu Provincial Meteorological Bureau, many places in Gansu Province issued orange hail warning signals. The Dingxi Municipal Emergency Management Bureau stated that hail did fall last night and they were verifying the damage.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839272230179557826_0.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839272230179557826_1.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839272230179557826_2.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839272230179557826_3.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839272375281463466","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 19:54:40","content":"https://t.co/b6UC24Y4KH","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839272375281463466_0.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839272375281463466_1.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839272375281463466_2.jpg,","hasPublished":true},{"id":"1839278645191274621","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 20:19:35","content":"On September 20, Yuan Juzheng, a professor of philosophy at National Taiwan University, was interviewed by China Television and said: Huawei phones are better than Apple phones, and at least they won’t explode.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839278645191274621_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839279722884116527","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 20:23:52","content":"On September 24, a netizen posted that there was suspected interference from drones at Hubei Yichang Three Gorges International Airport, causing multiple flights to be delayed and diverted. On the morning of the 25th, a reporter from Xiaoxiang Morning News called Yichang Three Gorges International Airport to inquire about the matter. The staff said that on the evening of the 24th, due to public safety reasons, flights entered an abnormal state from 9 o'clock that night. Some flights that had not been guaranteed were canceled, and some flights were delayed and diverted. By midnight that night, everything had returned to normal. The reporter from Xiaoxiang Morning News asked for details of the public safety reasons and whether the police were on the scene to deal with it. The staff said that he was doing flight support work indoors yesterday and was not very familiar with the situation outdoors. The reporter from Xiaoxiang Morning News also called the Three Gorges Airport Branch of the Yichang Public Security Bureau about this matter. After inquiry, the staff said that there was indeed a drone flying last night. \"We coordinated the anti-terrorism detachment to go there. I can't tell you the specific situation on the scene.\"","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839279722884116527_0.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839279722884116527_0.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839279722884116527_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839288779552731567","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 20:59:52","content":"On September 26, at Sichuan Tianfu New District Information Vocational College, parents held up banners at the school gate, pointing out that their children had unfortunately died during military training at the school, and that the school had evaded responsibility and refused to pay for medical expenses. Some students also left comments under videos related to the school, complaining that the school was a rip-off.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839288779552731567_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839288779552731567_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839288779552731567_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839293994200695285","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 21:20:35","content":"On September 25, Zhou Tianyong, deputy director of the International Strategy Institute of the Party School of the Central Committee of the Communist Party of China and an economist, published an article on his official account, calling for an urgent ban and cessation of local governments' use of retaining private entrepreneurs and asking them to pay money to release them to supplement fiscal revenue.\nThe article stated that allowing local discipline inspection commissions at all levels to retain entrepreneurs and use the method of paying money to release them to obtain local fiscal revenue would definitely lead to another national economic disaster.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839293994200695285_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839293994200695285_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839296262514028849","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 21:29:36","content":"On September 25 and 26, investors continued to go to the local government to defend their rights, and an elderly person was carried away by the police.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839296262514028849_0.jpg,/tweet/video/whyyoutouzhele/2024/09/26/1839296262514028849_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839308898647347401","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 22:19:48","content":"Reuters reported on September 26 that China plans to issue special sovereign bonds worth about 2 trillion yuan (284.43 billion U.S. dollars) this year as part of a new round of fiscal stimulus measures, two people familiar with the matter said, a move that will further increase its response to deflationary pressures and slowing economic growth.\nAs part of the plan, the Ministry of Finance plans to issue 1 trillion yuan of special sovereign debt, mainly to stimulate consumption in response to concerns about the faltering economic recovery after the COVID-19 pandemic, the sources said.\nPart of the funds raised by the Ministry of Finance's special bonds will be used to increase subsidies for the replacement of old consumer goods and the renewal of large commercial equipment.\nThe first source said the proceeds will also be used to provide all families with two or more children with a monthly allowance of about 800 yuan (about 114 U.S. dollars) per child.\nThe source also added...","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839308898647347401_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839308898647347401_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839308898647347401_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839308898647347401_3.jpg,","videos":"","hasFullContentTranslated":false,"fullContent":"路透社消息，9 月 26 日，两位知情人士称，作为新一轮财政刺激措施的一部分，中国计划今年发行价值约 2 万亿元人民币（2844.3 亿美元）的特别主权债券，此举将进一步加大对通货紧缩压力和经济增长放缓的应对力度。\n消息人士称，作为该计划的一部分，财政部计划发行 1 万亿元人民币的特别主权债务，主要是为了刺激消费，以应对人们对新冠疫情后经济复苏步履蹒跚的担忧。\n在财政部专项债券募集的资金中，有一部分将用于增加对消费品以旧换新和大型商用设备更新的补贴。\n第一位消息人士称，这笔收益还将用于向所有有两个或两个以上孩子的家庭提供每个孩子每月约 800 元人民币（约 114 美元）的津贴。\n消息人士还补充说，中国还计划通过单独发行特别主权债务筹集另外 1 万亿元人民币，并计划利用所得款项帮助地方政府解决债务问题。\n路透社表示，中国的大部分财政刺激措施仍用于投资，但回报正在减少，而这些支出已使地方政府背负 13 万亿美元的债务。中国的家庭支出不到 GDP 的 40%，比全球平均水平低约 20 个百分点。\n消息人士表示，部分财政支持措施可能最早于本周公布。由于未获授权对媒体发言，消息人士拒绝透露姓名。","hasPublished":true},{"id":"1839317701346603157","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 22:54:47","content":"Recently, this B-station UP continued to follow up on the unfinished building of Kunming Danuo Ark World and released a video on B-station titled \"Mid-Autumn Festival in the Unfinished Building\". In the video, the owners who moved into the unfinished building found joy in misery, set up a \"long street banquet\" in the unfinished building with drafts on all sides, and danced to the background music of Song Zuying's \"Good Days\" to celebrate the Mid-Autumn Festival. The scene was magical and ironic. However, as of press time, the video has been removed from B-station.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/09/26/1839317701346603157_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839323179925545432","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 23:16:33","content":"According to Guancha.com, HarmonyOS NEXT, known as \"pure-blooded Hongmeng\", will start public beta testing on October 8. The first batch of models participating in the public beta testing include Huawei Mate 60 series, Huawei Mate X5 series, and Huawei MatePad Pro 13.2-inch series.\nAccording to previous news from 21st Century Business Herald, HarmonyOS Next is Huawei's first operating system that is no longer compatible with Android applications.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839323179925545432_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839323179925545432_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839323179925545432_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1839326704088797616","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 23:30:33","content":"On September 26, the Financial Times dug out more details of this Chinese corporate espionage case.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839326704088797616_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839326704088797616_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839326704088797616_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839326704088797616_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839326707268063494","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 23:30:34","content":"https://t.co/hsyQ5KqmZk","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839326707268063494_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839326707268063494_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839326707268063494_2.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839326707268063494_3.jpg,","videos":"","hasPublished":true},{"id":"1839328995160322170","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 23:39:40","content":"On September 19, The Economist reported that Chinese AI companies circumvented the US chip ban through clever innovation and software adjustments.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839328995160322170_0.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839328995160322170_1.jpg,/tweet/image/whyyoutouzhele/2024/09/26/1839328995160322170_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1839331516855586846","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-09-26 23:49:41","content":"Hong Kong's Sing Tao Daily also focused on Reuters' rumor that \"families with two or more children will receive a monthly subsidy of 800 yuan per child.\" The subsidy does not include the first child.","images":"/tweet/image/whyyoutouzhele/2024/09/26/1839331516855586846_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]