[{"id":"1732455402221035657","name":"李老师不是你老师","createdDate":"2023-12-07 01:42:10","content":"https://t.co/DgUdW61qcH","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732455402221035657_0.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732455402221035657_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/DgUdW61qcH","accountId":"whyyoutouzhele"},{"id":"1732523374746743001","name":"李老师不是你老师","createdDate":"2023-12-07 06:12:15","content":"Netizens added","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732523374746743001_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/sRXvb7LhyH","accountId":"whyyoutouzhele"},{"id":"1732540912356544621","name":"李老师不是你老师","createdDate":"2023-12-07 07:21:57","content":"https://t.co/nMBhzHMjif","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732540912356544621_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/nMBhzHMjif","accountId":"whyyoutouzhele"},{"id":"1732576467060457742","name":"李老师不是你老师","createdDate":"2023-12-07 09:43:14","content":"December 7th, the first anniversary of the nationwide lifting of the lockdown\nOn December 7, 2022, the State Council issued ten new regulations, declaring that \"dynamic zeroing\" has entered the historical garbage dump.","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732576467060457742_0.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732576467060457742_1.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732576467060457742_2.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732576467060457742_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/ifFVwuaZbw","accountId":"whyyoutouzhele"},{"id":"1732697899409047773","name":"李老师不是你老师","createdDate":"2023-12-07 17:45:45","content":"@Thomaskwong7 November 23rd is when Luo Canhong will post a video","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1732702171810889735","name":"李老师不是你老师","createdDate":"2023-12-07 18:02:44","content":"On the 7th, the official Weibo account of the Spring Festival Gala responded to the AI drawing incident of the mascot and attached two videos to prove it. However, netizens found more flaws, such as the displayed file only had line drawings and finished images, lacking layer steps, \"line drawings to images\"; the source file was only 4.6M, lacking a revision timeline, and file saving history records, which continued to cause ridicule from netizens. Some even suspected that this was an emergency reverse engineering of the mascot by the Spring Festival Gala overnight.","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732702171810889735_0.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732702171810889735_1.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732702171810889735_2.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732702171810889735_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/KFHHxm6drE","accountId":"whyyoutouzhele"},{"id":"1732710776886989242","name":"李老师不是你老师","createdDate":"2023-12-07 18:36:56","content":"https://t.co/1sAEcudnMw","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732710776886989242_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/1sAEcudnMw","accountId":"whyyoutouzhele"},{"id":"1732711064817528841","name":"李老师不是你老师","createdDate":"2023-12-07 18:38:04","content":"https://t.co/as9Toy1CZA","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732711064817528841_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/as9Toy1CZA","accountId":"whyyoutouzhele"},{"id":"1732711677160751173","name":"李老师不是你老师","createdDate":"2023-12-07 18:40:30","content":"On December 7, migrant workers in Gaoping District, Nanchong City, Sichuan Province, live-streamed their demands for wages","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732711677160751173_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/JpcRVlViaE","accountId":"whyyoutouzhele"},{"id":"1732712925880562142","name":"李老师不是你老师","createdDate":"2023-12-07 18:45:28","content":"Netizen submission\nOn December 5, a netizen exposed that a group of people went to Xuexiang for tourism, but were forced to get off the bus to shop, and were not allowed to get off the bus if they did not make any purchases.\nThe person involved said: The tourists were pulled to shop at 7:30 in the morning, and everyone was forced to get off the bus to shop. The early publicity was seriously inconsistent with the actual situation. After paying the tour group fee, they had to pay the ticket fee when they arrived at the place, and they were not allowed to get on the bus if they did not pay.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732712925880562142_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/xj3n47PjjJ","accountId":"whyyoutouzhele"},{"id":"1732713431755608174","name":"李老师不是你老师","createdDate":"2023-12-07 18:47:29","content":"On December 6, Kuang Guiying, a single mother from Xunwu, Jiangxi, went to the People's Government of Baiyun District, Guangzhou to defend her rights. She was hijacked by the police station as soon as she arrived at the door. The staff of the Tangjing Street Stability Maintenance Center said: If you don't make trouble, we can't make trouble for you.\nIt is reported that she was in a car accident when she brought her 2-year-old daughter to Guangzhou to live with her child's father on November 15 last year, and the village party secretary who was driving the car fled the scene.\nOn the day of the car accident, the hospital concealed Kuang Guiying's injuries and she was forcibly sent back to her hometown in Xunwu, Jiangxi by the village party secretary who caused the accident. It was not until ten days after the incident that Kuang Guiying, who was unwell, came to the doctor again for treatment and learned that she had fractured four toes, metatarsotarsal joints, and torn ligaments. During the recuperation period, Kuang Guiying was raped twice by the police who came to do ideological work. After reporting the case, the county-level city public security and women's federation did not accept it. During this period, local departments broke into private homes many times, intimidated and threatened to ask for private chats. The mother and daughter, unable to bear the harassment, came to Guangzhou again. As a result, the Xunwu government still refused to let the mother and daughter go. They came to Guangzhou across provinces and bribed the Guangzhou Tangjing Police Station to list Kuang Guiying as a key person on the grounds of mental illness, restricting her medical treatment and residence. They also illegally summoned her many times and forcibly sent her to a mental hospital.\nThis caused Kuang Guiying to suffer from post-traumatic stress disorder and her spirit collapsed for a time. After Kuang Guiying reported to the relevant departments in Guangzhou that the Baiyun District Tangjing Police Station had illegally controlled her, the director Xu Zhigang and several deputy directors avoided meeting her. Their perfunctory attitude made Kuang Guiying disappointed and angry.\nNot only that, the people from the Tangjing Police Station beat Kuang Guiying all over her body for three consecutive days from November 13 to 15, 23. After the station called 120 to send her to the hospital, they did not allow the hospital to treat her. In the early morning of the 15th, the desperate Kwong Kwai-ying finally chose to commit suicide by jumping into the Pearl River. She was then violently stuffed into a car by the police and detained, and was not allowed to contact the outside world.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732713431755608174_0.jpg","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1732713884614602851","name":"李老师不是你老师","createdDate":"2023-12-07 18:49:17","content":"Netizen contribution\nDecember 6, Shanghai. A man shouted excitedly on the subway: \"The Japanese posted my short video online, 200 million yen a week, you Communists eat American pig offal\"","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732713884614602851_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/mlJ9mYVy19","accountId":"whyyoutouzhele"},{"id":"1732714400992121329","name":"李老师不是你老师","createdDate":"2023-12-07 18:51:20","content":"On December 6, a netizen posted a video saying that at Shanghai Pudong Airport, a tour guide said to tourists who were about to go to Italy: This is a life-saving talisman when traveling abroad. In times of crisis, just show the national flag and say that you are Chinese.","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732714400992121329_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/rZUIWgeT8N","accountId":"whyyoutouzhele"},{"id":"1732715106130149679","name":"李老师不是你老师","createdDate":"2023-12-07 18:54:08","content":"Netizen contribution\nDecember 6, Guangdong. A woman was setting up a stall in a hospital and was forcibly dragged out by several urban management officers. A staff member nearby saw someone taking pictures and immediately pulled up a blue curtain to cover them.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732715106130149679_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/0I7KAAJBHr","accountId":"whyyoutouzhele"},{"id":"1732715624227299640","name":"李老师不是你老师","createdDate":"2023-12-07 18:56:11","content":"December 4, Changde, Hunan. The owner, Mr. Mou, said that he pulled a truck of oranges from Shimen County to Changchun. The scale showed that it was not overloaded, but it was determined to be overloaded when passing through an overload inspection station in Linli County.\nMr. Mou said that he was forced to unload 8 baskets of oranges totaling nearly 100 kilograms. The next day, he spent 800 yuan to hire a car to pick it up, but found that all the oranges were missing. With the help of the police, Mr. Mou found 4 and a half baskets, and he suspected that the rest were stolen.\nOn December 6, the Baihushan Overload Inspection Station in Linli County issued a statement: Due to poor storage by the inspection station staff, 2 pieces of citrus unloaded outside the inspection booth were lost. The Baihushan Overload Inspection Station apologized to Mr. Mou, compensated 800 yuan, and suspended 2 staff members on duty.\nMr. Mou then responded, saying that he was dissatisfied with the official notice and demanded an apology.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732715624227299640_0.jpg","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1732716923815608485","name":"李老师不是你老师","createdDate":"2023-12-07 19:01:21","content":"December 6, Sichuan. A mother posted on Douyin that her daughter became severely depressed and attempted suicide under the high pressure of study.\nWhen she went home and saw the wall full of awards, she suddenly realized how wrong she was. It turned out that those achievements that she was once proud of were actually needles that pierced her daughter.\nNow her daughter ignores everyone and just stares blankly at the takeaway. Her mother is heartbroken.","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732716923815608485_0.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732716923815608485_1.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732716923815608485_2.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732716923815608485_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/9pitUa2oZj","accountId":"whyyoutouzhele"},{"id":"1732717796818055640","name":"李老师不是你老师","createdDate":"2023-12-07 19:04:49","content":"On December 7, Chengdu, Sichuan. A traffic accident occurred at Shuangliu Airport. A small car knocked down a roadside booth. A person in a yellow reflective suit was lying on the ground. The scene was in a mess.\nA staff member of the Shuangliu Airport Public Security Bureau responded to the incident and said that it was being handled and there would be relevant announcements later.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732717796818055640_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/gKZWeGibei","accountId":"whyyoutouzhele"},{"id":"1732721280619520253","name":"李老师不是你老师","createdDate":"2023-12-07 19:18:40","content":"On December 6, the media reported that on October 23, 2023, two people in Bazhou were detained for 7 days in accordance with the law for organizing and linking up multiple property owners to petition the Beijing National Bureau of Letters and Calls Reception Department to exert pressure through petitions.\nNetizens commented: What city is Bazhou? I only remember Atlantis (a city destroyed by prehistoric floods).","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732721280619520253_0.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732721280619520253_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/UfNAYbx5us","accountId":"whyyoutouzhele"},{"id":"1732721664599744879","name":"李老师不是你老师","createdDate":"2023-12-07 19:20:11","content":"In August, during the Hebei flood, villagers around Bazhou smashed the gate of the Bazhou Municipal Government because they were dissatisfied with the resettlement compensation.","images":"","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/XIjLQz9fVO","accountId":"whyyoutouzhele"},{"id":"1732722197511192768","name":"李老师不是你老师","createdDate":"2023-12-07 19:22:18","content":"On the morning of December 7, some netizens reported that \"patients were queuing up to pay but staff were playing mobile games\" at Shanghai Huashan Hospital. On the same day, The Paper reporter learned from Huashan Hospital that the hospital quickly investigated and understood the relevant situation. The staff member in the video was indeed an employee at the hospital's payment window. The hospital has criticized and educated him, suspended his work, and ordered him to conduct a thorough inspection.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732722197511192768_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/M9jepkrXHv","accountId":"whyyoutouzhele"},{"id":"1732722808298364950","name":"李老师不是你老师","createdDate":"2023-12-07 19:24:44","content":"On December 6, the Hong Kong Culture, Sports and Tourism Bureau submitted a document to the Legislative Yuan, planning to transform the Hong Kong Science Museum into a memorial hall \"showing the country's grand development and achievements\" and relocate it to the current location of the Hong Kong Heritage Museum.","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732722808298364950_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/11b99snCVc","accountId":"whyyoutouzhele"},{"id":"1732723334041739511","name":"李老师不是你老师","createdDate":"2023-12-07 19:26:49","content":"Netizen contribution: Who are you talking about?","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732723334041739511_0.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732723334041739511_1.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732723334041739511_2.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732723334041739511_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/zP3pS8LJKj","accountId":"whyyoutouzhele"},{"id":"1732728442704040389","name":"李老师不是你老师","createdDate":"2023-12-07 19:47:07","content":"@zongshuji8964 Aren't you supposed to like this kind of name, avatar and ID?","images":"","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1732728916744241610","name":"李老师不是你老师","createdDate":"2023-12-07 19:49:00","content":"Some netizens discovered that China Construction Bank has clearly indicated on its Spring Festival Gala co-branded New Year's money that the Spring Festival Gala mascot is a mascot designed by AI.","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732728916744241610_0.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732728916744241610_1.jpg,/tweet/image/whyyoutouzhele/2023/12/07/1732728916744241610_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/a4qL2Q8JAj","accountId":"whyyoutouzhele"},{"id":"1732749482607935922","name":"李老师不是你老师","createdDate":"2023-12-07 21:10:44","content":"Follow-up","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732749482607935922_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/V9y2N01EwR","accountId":"whyyoutouzhele"},{"id":"1732753326196789538","name":"李老师不是你老师","createdDate":"2023-12-07 21:26:00","content":"On December 7, the Japanese government plans to provide free university tuition for families with three or more children.","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732753326196789538_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/6u6pvRSwVE","accountId":"whyyoutouzhele"},{"id":"1732762674381955107","name":"李老师不是你老师","createdDate":"2023-12-07 22:03:09","content":"Netizen contribution\nOn December 7, the construction of high-standard farmland in Chimen Township, Yanping District, Nanping City, Fujian Province was shoddy.\nWhen local villagers went to the farmland to check the construction situation, they found that shoddy work was done and the river sand added to the cement was replaced with soil, resulting in the cement being insufficient in strength after solidification and falling down with a kick.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732762674381955107_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/cNslzlptmL","accountId":"whyyoutouzhele"},{"id":"1732765238099882423","name":"李老师不是你老师","createdDate":"2023-12-07 22:13:20","content":"On December 7, residents of Taopu Town in Shanghai continued to protest against the district government's construction of a new waste treatment plant in Taopu, during which they clashed with the police.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732765238099882423_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/OcjRpoXGDL","accountId":"whyyoutouzhele"},{"id":"1732773870921203774","name":"李老师不是你老师","createdDate":"2023-12-07 22:47:38","content":"On the evening of December 7, a knife attack occurred on the streets of Yantaishan, Fuzhou.\nAccording to online reports, a man rushed into a store kitchen to grab a knife and indiscriminately attacked people in revenge, and then tried to jump into the river but was stopped by the police.","images":"","videos":"/tweet/video/whyyoutouzhele/2023/12/07/1732773870921203774_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/6dYPOHzGQ3","accountId":"whyyoutouzhele"},{"id":"1732773969739039019","name":"李老师不是你老师","createdDate":"2023-12-07 22:48:02","content":"https://t.co/MzOVUCeMBy","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732773969739039019_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/MzOVUCeMBy","accountId":"whyyoutouzhele"},{"id":"1732787788141994450","name":"李老师不是你老师","createdDate":"2023-12-07 23:42:56","content":"Later, there were news reports that according to street vendors, the person who attacked and the person who was attacked were employees of the same store and they got into a fight due to a conflict.","images":"/tweet/image/whyyoutouzhele/2023/12/07/1732787788141994450_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/lzHRj04fVs","accountId":"whyyoutouzhele"},{"id":"1732789505252319273","name":"李老师不是你老师","createdDate":"2023-12-07 23:49:46","content":"Moody's told its Chinese employees to work from home before downgrading China's sovereign rating outlook to prevent the company from being subject to government surprise inspections.\nAt the same time, Moody's also advised Hong Kong analysts to temporarily avoid traveling to mainland China before the interest rate cut.\nOn December 6, Moody's downgraded China's rating outlook from stable to negative.\n","images":"","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/t6cpGiTsRs","accountId":"whyyoutouzhele"}]