[
  {
    "id": "1739679730121482309",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 00:09:04",
    "content": "Netizen contribution\nVideo of the public trial of Peng Xubiao for \"inciting subversion of state power\" by the Xining Intermediate People's Court in 2019\nAccording to the video content, Peng Xubiao is an engineer whose bicycle was confiscated because of the local \"Creating a Civilized City\" campaign, so he posted some remarks in a WeChat group, which were deemed to deny inciting subversion of socialism and state power\nThe presiding judge mentioned that Peng Xubiao's remarks included \"what CCTV said was all false.\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739679730121482309_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/HyczFeBktj",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739685766924497207",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 00:33:03",
    "content": "Another netizen found a 1-hour full version",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739685766924497207_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/xfdpTnuPiY",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739958691200217508",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 18:37:33",
    "content": "On December 25, Shijiazhuang Baifo Vegetable Market issued a notice, receiving a notice from the higher authorities that due to air pollution, it would immediately stop processing and producing noodles, pancakes, and shredded pancakes.\nA reporter contacted the local ecological environment bureau. A staff member said: \"We have not issued such a notice to the lower level. The vegetable market staff made a mistake.\"\nBut a Shijiazhuang netizen added that the current air pollution control in Shijiazhuang has reached a magical level.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739958691200217508_0.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739958691200217508_1.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739958691200217508_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/CQoJdHoTH1",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739960415092707467",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 18:44:24",
    "content": "\"College counselors should dare to fight against wrong thoughts online\"\nOn December 26, Guangming Daily published an article signed by Qiu Yong, an academician of the Chinese Academy of Sciences and secretary of the Party Committee of Tsinghua University, \"Let the tradition of counselors \"carrying both responsibilities\" shine with the vitality of the times\". The article mentioned that counselors should make good use of the Internet, keenly grasp the ideological dynamics of students, be able to interact deeply with students, improve their positive guidance ability, and dare to fight against wrong thoughts online. \nThe article finally emphasized that counselors should enhance their ability to \"carry the burden on both shoulders\", strengthen the demonstration and driving role of being both red and professional, and developing comprehensively, \"making the red background more vivid and the professional brighter\"",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739960415092707467_0.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739960415092707467_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739961650294247507",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 18:49:19",
    "content": "Fourth anniversary\nOn December 27, 2019, the Hubei Provincial Hospital of Integrated Traditional Chinese and Western Medicine reported a case of pneumonia of unknown cause to the Jianghan District Center for Disease Control and Prevention in Wuhan. This was the first time that a local department in China reported a suspected case.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739961650294247507_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/lebi4Ckpp3",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739962406774722643",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 18:52:19",
    "content": "Wang Wen, executive director of the Chongyang Institute for Financial Studies at Renmin University of China, said in an exclusive interview with the \"New Era China Diplomatic Think Tank\" on December 26 that nowadays, almost all Western products, information, and festivals can enter China without hindrance; China has many festivals, including commercial festivals, and Chinese people have many opportunities to celebrate festivals and go on shopping sprees. It is China's all-round openness and social activity that have diluted the novelty of Christmas.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739962406774722643_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/lq28sMM4BD",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739962655819936154",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 18:53:18",
    "content": "On the 27th, Yuhuayuan Senior High School in Ningling County, Shangqiu City, Henan Province\nThe family of the deceased placed wreaths outside the school gate where the incident occurred, holding photos of their children to defend their rights. A large number of onlookers and police gathered at the scene.\nAccording to some netizens: The incident happened at midnight on December 23, and the wounds on the child's body were suspected to be drilled by a screwdriver. The school did not notify the family until the child died. Ms. Yang, a family member of the deceased, said that her cousin was 14 years old and in the second grade of junior high school. After her cousin died, the school notified the family \"When I looked at the body, I found that the child was covered with wounds. It is suspected that he suffered from long-term school violence.\" Ms. Yang said that her brother's hand was pierced by a screwdriver, his legs were bruised, and the wounds even exposed bones. The school insisted that the child jumped off the building by himself, but Ms. Yang couldn't understand why her brother, who had always been very good, would be like this. \nOn the morning of December 27, the Ningling County Education and Sports Bureau reported that on December 24, a student died at Yuhuayuan School in Ningling County. After investigation, it was found that at 6:04 am that day, the school patrol found Yang lying on his side on the ground. At 6:05 am, the school immediately called 120 emergency number and reported to the police. The public security organs determined that Yang died from falling from a high altitude through monitoring, visiting investigations, on-site inspections, inspections by the city and county courts, and the contents of the two suicide notes left by the deceased before his death, and ruled out a criminal case.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739962655819936154_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739963379253489873",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 18:56:11",
    "content": "On December 26, the media reported that a third-grade student at Dongfeng Primary School in Huize County, Yunnan, was hit on the head by a math teacher with a ruler on the 25th. The teacher then contacted the parents to send the child to the hospital, where the wound was sutured with two stitches. The local education bureau issued a notice on the 25th to severely punish the teacher involved.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739963379253489873_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/zkMPhEsbkV",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739963739955220516",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 18:57:37",
    "content": "On December 26, Kaifeng, Henan. After a man and a woman were suspected of quarreling in the car, the man beat the woman in the street, then drove the car to hit the woman, and even tried to hit passers-by indiscriminately at the intersection.\nFrom the video, it can be seen that the scene was a mess, and the traffic lights were knocked down.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739963739955220516_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/9dmTi83QOy",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739966279690121398",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:07:42",
    "content": "Recently, a netizen posted a video to report that the company he worked for, a cultural media company in Xi'an, Shaanxi, not only withheld wages, but also insulted and threatened employees in the company's WeChat group for a long time, saying that they would burn paper for employees and cursed employees' families to be \"hit by a car when they go out\". \nOn December 26, staff at the Xi'an Jiefangmen Police Station, to which the company involved belongs, said that the station had received a report and was investigating the matter.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739966279690121398_0.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739966279690121398_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/XLDhOG4ER5",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739967068118659113",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:10:50",
    "content": "Recently, Wang, the director of the office of the Science and Technology Bureau of Baise City, Guangxi Province, posted a message saying that he had been a section chief for nearly 18 years and had been rated as excellent for three consecutive years, but he failed to be promoted to a fourth-level researcher and only received two votes, questioning the selection process. On December 25, he confirmed to reporters that he had posted the post himself, but later felt that he should not have posted it, so he deleted it. The problems mentioned in the post have been reported to the relevant departments.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739967068118659113_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/dAHMopmkK2",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739968106838008286",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:14:58",
    "content": "High school prisonization\nOn December 26, a teacher at Youyi Middle School in Kunming, Yunnan, asked students not to talk while getting food, and would hit anyone who talked, and insulted the students, saying that they were raised but not taught.\nOn the 26th, school staff said they had seen the video and would send it to the leadership for investigation and handling.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739968106838008286_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Ty7GjZZrJn",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739969014988988818",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:18:34",
    "content": "December 25, Guiyang, Guizhou.\nA woman was criticized by an old lady for wearing a kimono while shopping. The old lady asked the girl to take off the kimono, and then the two had an argument.\nOn December 26, the woman responded that the kimono she wore was to play her favorite anime character, and apologized for her inappropriate behavior at the time.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739969014988988818_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Uf7L4R2qKM",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739969561972400503",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:20:45",
    "content": "December 26, Shangrao, Jiangxi.\nA netizen posted a video saying that a silver dollar from the Republic of China was dug up during construction at a construction site near the Xinjiang Bridge in Qianshan.\nAs soon as the news came out, nearby residents immediately flocked to the site and dug for treasure day and night.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739969561972400503_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/QMbnNiKAiD",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739970117415641511",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:22:57",
    "content": "On December 25, a blogger posted a Christmas article about his family's experience during the Great Famine in the 1960s.\nAfterwards, netizens took to the comment section to recall their elders' experiences during the Great Famine.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739970117415641511_0.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739970117415641511_1.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739970117415641511_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/yfCQzuZgoi",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739970777682682308",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:25:35",
    "content": "On December 27, the blue book \"Report on the Legal Protection of Human Rights in Xinjiang\" was released, which triggered a collective ambiguity in the comment area.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739970777682682308_0.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739970777682682308_1.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739970777682682308_2.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739970777682682308_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/PU9zKQCsn7",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739970868007371031",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:25:56",
    "content": "https://t.co/iGAPDnGIvo",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739970868007371031_0.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1739970868007371031_1.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/iGAPDnGIvo",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739973496346669239",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:36:23",
    "content": "Recently, Ren Xiaojun, a professor at the School of Art and Design of Shanghai University of Technology, released a real-name reporting video, saying that the former and current deans of the school had academic misconduct, and the former dean Li Zhehu had used his power to modify his daughter's grades.\nRen Xiaojun said that before Li Zhehu was awarded the title of professor, he had only published an ordinary journal article in \"Times Literature\" (second half of the month), and had no other works or textbooks. This is inconsistent with the professor evaluation standards of Yanbian University where he is located, and it is inconsistent with the professor evaluation standards of Jilin Province where Yanbian University is located, and it does not meet the professor evaluation standards of the Shanghai Municipal Department of Human Resources and Social Security and Shanghai University of Technology at that time.\nA staff member of the Discipline Inspection Commission (Office of the Supervisory Commissioner) of Shanghai University of Technology responded to reporters that the content of the report is not convenient to disclose to the public and is still under investigation.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739973496346669239_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739976536537637340",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:48:28",
    "content": "On December 27, some migrant workers went to Kunming Metro again to ask for their wages.\nAccording to the contributor, because they came many times without success, some workers have already lived and ate there.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739976536537637340_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/iNzywhk2RH",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739977536350888349",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:52:26",
    "content": "On December 27, in Ningbo, Zhejiang, some citizens hung banners on the streets, demanding that the government respect public opinion and oppose the establishment of paid parking lots in public areas without the consent of the people.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739977536350888349_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/83dMAXK8xN",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739977627069551092",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 19:52:48",
    "content": "On December 27, Hu Xitui posted a Weibo post saying that the Cultural Revolution must not be overturned.\nThe post has now been deleted.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1739977627069551092_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/zrJKjF1xxs",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1739993944266846617",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 20:57:38",
    "content": "December 27, Beihai City, Guangxi, Hepu Maritime Silk Road First Port Scenic Area.\nWorkers blocked the road to demand wages, and then a leader drove towards the workers demanding wages, and the workers threw stones in retaliation.\nAfter the conflict ended, the workers continued to pick up banners to block the road to demand wages.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1739993944266846617_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/tlzdrIUe1E",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1740008042362753180",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 21:53:39",
    "content": "https://t.co/5Rlgk8lzIg",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1740008042362753180_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/5Rlgk8lzIg",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1740031591911682428",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 23:27:14",
    "content": "Netizens commented that Fatty Ding was banned",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1740031591911682428_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/HmSNWKRZ7J",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1740032579468681318",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 23:31:09",
    "content": "\"Contemporary Camel Xiangzi\"\nOn December 27, Shanghai TV's \"News Perspective\" public account published a report focusing on Shanghai's online car-hailing drivers: many of them actually rent their cars, and some even live in their cars",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1740032579468681318_0.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1740032579468681318_1.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1740032579468681318_2.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1740032579468681318_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/26LmQEnKGs",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1740033130357199064",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 23:33:21",
    "content": "Netizens contributed, the actual casualties are 1 dead and 1 injured",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1740033130357199064_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/TWG4erovaG",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1740036852449714372",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 23:48:08",
    "content": "On December 27, a student protest broke out in a provincial model high school in Changsha. It is reported that the school suddenly shortened the originally scheduled three-day New Year's Day holiday to two days, which caused dissatisfaction among students and some teachers. On that day, students began to post and circulate protest manifestos and big-character posters in the cafeteria and grade office, and then evolved into a spontaneous gathering and shouting action, shouting \"fight to the death, give me back three days off.\" In the end, the students' protest was successful, and the school restored the three-day holiday.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1740036852449714372_0.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1740036852449714372_1.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1740036852449714372_2.jpg,/tweet/image/whyyoutouzhele/2023/12/27/1740036852449714372_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/ATRQujynrK",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1740036921081155697",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 23:48:24",
    "content": "The students protested on that day",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/12/27/1740036921081155697_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/oOJbCTsIR0",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1740037598306017758",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 23:51:06",
    "content": "The school later announced a three-day holiday.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1740037598306017758_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/7jNR5K5aja",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1740037738416472078",
    "name": "李老师不是你老师",
    "createdDate": "2023-12-27 23:51:39",
    "content": "At the same time, there is news that the grade group will strictly punish those who post big-character posters.",
    "images": "/tweet/image/whyyoutouzhele/2023/12/27/1740037738416472078_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/GiapFvh73g",
    "accountId": "whyyoutouzhele"
  }
]