[{"id":"1827045447560581530","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 02:09:14","content":"On August 23, Evergreen Group issued a statement to apologize for the incident in which the Paris Hotel did not hang the Chinese flag, saying that it would strengthen employee education and training to prevent similar incidents from happening again.\nAt the same time, it emphasized that the group recognized the 1992 Consensus and opposed Taiwan independence.","images":"/tweet/image/whyyoutouzhele/2024/08/24/1827045447560581530_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827101195036492026","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 05:50:45","content":"\"Teacher L is not your teacher\"\nOn August 22, the media reported that Teacher L, a foreign spy, sponsored needy students to carry out espionage activities, encouraged them to take the civil service exam, and steal state secrets","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/24/1827101195036492026_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827102613390991397","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 05:56:23","content":"Recently, in Shanghai, a Xiaohongshu netizen revealed that his company notified that \"non-Han\" employees need to report to the category manager. At present, the management level is upgraded, and minority employees are not allowed to be arranged in the store as much as possible.","images":"/tweet/image/whyyoutouzhele/2024/08/24/1827102613390991397_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827120405418566100","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 07:07:05","content":"Recently, a blogger revealed that more than a dozen students from an Internet addiction treatment school in Xiangyin, Hunan jointly reported that instructors in the school raped, molested, beat, and took nude photos of students.\nOn July 13, Zhang Enxu was kidnapped to Shengbo School in Xiangyin, Hunan by police disguised as police from the Internet addiction treatment school.\nHis friend reported the case immediately. After the police filed the case, they told his friends that he \"lived very sunny.\" But in fact, Zhang Enxu suffered various abuses in the school.\nZhang Enxu did not stop resisting and wrote a joint report letter with other students in Shengbo School. According to his report letter, Shengbo School has instructors who raped, molested, beat, and took nude photos of students.\nAt present, the police have taken Zhang Enxu out of the school, but the other students who jointly reported seem to still be in Shengbo School.\nThe video caused an uproar among netizens. After the video was taken off the shelves, it was forwarded by netizens.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/24/1827120405418566100_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827121798514610632","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 07:12:37","content":"According to online information, six or seven media outlets and bloggers have reported in recent years that various corporal punishments and abuses occurred in Xiangyin County Shengbo School and the school network behind it. The school has changed its name many times, \"changing its name as many times as the number of students who died\"","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827122112630300795","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 07:13:52","content":"According to reports in public media information. In 2019 and 2023, the Xiangyin government investigated Shengbo School. \n\nIn September 2019, the anti-gang squad of the Xiangyin County Public Security Bureau investigated the Yinggaote Special Training School and detained an instructor who abused students. \n\nIn addition, according to the section chief surnamed Ni, Yinggaote Inspirational Education School and Hunan Zhongshan Vocational and Technical School have the same legal representative, Li Zheng.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827235358704382336","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 14:43:52","content":"On August 23, netizens discovered that eight of the hot searches on Weibo were related to the Indian rape case, and there was not a single hot search about Indian Prime Minister Modi’s visit to Ukraine.","images":"/tweet/image/whyyoutouzhele/2024/08/24/1827235358704382336_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827260304989802828","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 16:23:00","content":"On August 23, Chinese Premier Li Qiang arrived in Belarus for a visit. Slogans such as \"A strong China means a strong Belarus\" were displayed on the streets of the capital Minsk.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/24/1827260304989802828_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827260389094301928","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 16:23:20","content":"August 22, Huixian County, Henan Province. It was reported online that a first-year female student at Mengzhuang Middle School died of heatstroke during military training. Her parents came to the school to deliver medicine but the security guards refused to let them in. On the 23rd, the family placed wreaths and banners in front of the school gate to defend their rights. The school said that the girl did not die during military training, and that it was not true that the parents were not allowed to enter the school to deliver medicine. The incident happened in the dormitory at around 5 a.m.","images":"/tweet/image/whyyoutouzhele/2024/08/24/1827260389094301928_0.jpg,/tweet/image/whyyoutouzhele/2024/08/24/1827260389094301928_1.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/08/24/1827260389094301928_0.jpg,/tweet/video/whyyoutouzhele/2024/08/24/1827260389094301928_1.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827263649964290218","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 16:36:17","content":"On August 24, the U.S. Embassy in China issued a statement:\nOn August 24, 1991, Ukraine became independent\nOn August 24, 2024, Ukraine is fighting to remain free.","images":"/tweet/image/whyyoutouzhele/2024/08/24/1827263649964290218_0.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827266986000445657","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 16:49:33","content":"On August 24, netizens wrote in saying that if they posted photos of the symposium commemorating the 120th anniversary of Comrade Deng Xiaoping’s birth on Toutiao, they would be banned and their accounts would not be able to appeal.","images":"/tweet/image/whyyoutouzhele/2024/08/24/1827266986000445657_0.jpg,/tweet/image/whyyoutouzhele/2024/08/24/1827266986000445657_1.jpg,/tweet/image/whyyoutouzhele/2024/08/24/1827266986000445657_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827270073809064205","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 17:01:49","content":"News on August 23: Russian Ministry of Defense: The Russian and Chinese armies agreed to strengthen cooperation; on the 22nd, China and Russia issued a communiqué condemning the seizure of foreign assets and property and emphasizing the right to take countermeasures.","images":"/tweet/image/whyyoutouzhele/2024/08/24/1827270073809064205_0.jpg,/tweet/image/whyyoutouzhele/2024/08/24/1827270073809064205_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827272034629656751","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 17:09:36","content":"August 21, Hangzhou, Zhejiang. The chairman of Taichang Group said in an interview: In recent years, the company has implemented a master-apprentice system, where apprentices need to give 5% of their monthly income to their masters, and then through the traditional Chinese cultural apprenticeship system, the apprentices will develop a sense of awe for their masters.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/08/24/1827272034629656751_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1827273767703474442","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-08-24 17:16:29","content":"Recently, in Wuxuan, Guangxi, it was reported that local Internet police discovered during their work that a man had posted an article on Toutiao that slandered national athlete Wu Yanni. The police quickly launched an investigation and the suspect has been detained.","images":"/tweet/image/whyyoutouzhele/2024/08/24/1827273767703474442_0.jpg,/tweet/image/whyyoutouzhele/2024/08/24/1827273767703474442_1.jpg,/tweet/image/whyyoutouzhele/2024/08/24/1827273767703474442_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]