[{"id":"1743329280874958980","name":"李老师不是你老师","createdDate":"2024-01-06 01:51:04","content":"At present, middle schools across the country have begun to try to carry out \"voluntary paid supplementary classes\" during the winter vacation, shortening the original winter vacation of about one month to less than one week.","images":"/tweet/image/whyyoutouzhele/2024/01/06/1743329280874958980_0.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743329280874958980_1.jpg","videos":"","hasPublished":true},{"id":"1743331509656797344","name":"李老师不是你老师","createdDate":"2024-01-06 01:59:56","content":"On January 5, patients at Shenzhen Nanshan Hospital held banners on the rooftop to protest their rights and distributed a large number of leaflets downstairs.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/06/1743331509656797344_0.jpg","hasPublished":true},{"id":"1743388842940580321","name":"李老师不是你老师","createdDate":"2024-01-06 05:47:45","content":"On January 5, the Pingyao Culture and Tourism Bureau issued a notice prohibiting merchants from selling non-Han ethnic clothing and clothing that does not conform to the main theme of the times in Pingyao Ancient City.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/06/1743388842940580321_0.jpg","hasPublished":true},{"id":"1743402358837592329","name":"李老师不是你老师","createdDate":"2024-01-06 06:41:27","content":"On January 5, a student at Shandong Yantai Ludong University was hit to death by an ice pick on campus.","images":"/tweet/image/whyyoutouzhele/2024/01/06/1743402358837592329_0.jpg","videos":"","hasPublished":true},{"id":"1743568695392088149","name":"李老师不是你老师","createdDate":"2024-01-06 17:42:25","content":"Road blocking protests are becoming more and more common","images":"","videos":"","hasPublished":true},{"id":"1743573488168825248","name":"李老师不是你老师","createdDate":"2024-01-06 18:01:28","content":"A netizen shared his experience of being infected with mycoplasma pneumonia","images":"/tweet/image/whyyoutouzhele/2024/01/06/1743573488168825248_0.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743573488168825248_1.jpg","videos":"","hasPublished":true},{"id":"1743578828310487334","name":"李老师不是你老师","createdDate":"2024-01-06 18:22:41","content":"At present, after Hainan TV host Xiao Chenghao was suspended for inappropriate remarks, the director of Hainan TV was collectively condemned by patriotic big Vs.","images":"/tweet/image/whyyoutouzhele/2024/01/06/1743578828310487334_0.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743578828310487334_1.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743578828310487334_2.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743578828310487334_3.jpg","videos":"","hasPublished":true},{"id":"1743581074817429801","name":"李老师不是你老师","createdDate":"2024-01-06 18:31:37","content":"January 6, Beijing. It was reported online that a netizen was illegally terminated by a company. During the communication with the company manager, the manager shouted: \"I terminated it illegally now, I am breaking the law now, is it your business if I break the law?\" \"The first and second instance of labor arbitration, I have plenty of people waiting for you, you can try and find a job for two and a half years, you don't have to think about finding a job anymore, (anyway) I have food to eat next month, you figure it out yourself.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/06/1743581074817429801_0.jpg","hasPublished":true},{"id":"1743585488210923558","name":"李老师不是你老师","createdDate":"2024-01-06 18:49:09","content":"On January 4, outside the gate of Qinhuangdao Building Materials Vocational and Technical College in Hebei Province, an old man selling candied haws set the payment code voice to \"eliminate the little Japanese, remember 918, and don't forget the Nanjing Massacre.\" According to the photographer, the old man has changed to this voice for a long time.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/06/1743585488210923558_0.jpg","hasPublished":true},{"id":"1743587124962590841","name":"李老师不是你老师","createdDate":"2024-01-06 18:55:39","content":"On January 5, Caixin reported that more and more Chinese bachelors are flocking to Nepal to find wives.\nShort videos with the keyword \"Nepalese bride\" have also emerged on social media, describing Nepal as an ideal place for \"daughters\" and \"many girls\", with low prices and low cost of marrying a wife. Local women are portrayed as good wives and mothers who do not covet material things.\nAccording to a video posted online in June 2023, the price of taking a \"wife\" from Nepal is about 120,000, which takes five months.\nAccording to data from the National Bureau of Statistics, as of the end of 2022, China's male population was 32.37 million more than females, resulting in an imbalanced gender ratio.\nSince the 1990s, Chinese single men have begun to extend their marriage tentacles to neighboring Southeast Asian countries, and have successively entered Vietnam, Laos, Myanmar, and Indonesia. And now, this trend of looking for marriage has finally broken through the \"roof of the world\" and reached Nepal.","images":"/tweet/image/whyyoutouzhele/2024/01/06/1743587124962590841_0.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743587124962590841_1.jpg","videos":"","hasPublished":true},{"id":"1743587973306695871","name":"李老师不是你老师","createdDate":"2024-01-06 18:59:01","content":"On January 5, the Guangzhou Liwan District Land Development Center issued the city's first housing ticket at the Shiweitang demolition site. The homeowner or his immediate family can use the ticket to purchase newly built commercial housing from the \"designated warehouse\" and directly deduct the housing payment.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/06/1743587973306695871_0.jpg","hasPublished":true},{"id":"1743589378448818626","name":"李老师不是你老师","createdDate":"2024-01-06 19:04:36","content":"A software engineer submits his work status","images":"/tweet/image/whyyoutouzhele/2024/01/06/1743589378448818626_0.jpg","videos":"","hasPublished":true},{"id":"1743592289857929642","name":"李老师不是你老师","createdDate":"2024-01-06 19:16:10","content":"On January 5, a blogger filmed the current situation of Heping Road in Longhua, Shenzhen. For as long as 7 minutes, the road was full of homeless people, and the scene was quite shocking.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/06/1743592289857929642_0.jpg","hasPublished":true},{"id":"1743597555609448727","name":"李老师不是你老师","createdDate":"2024-01-06 19:37:06","content":"January 6, Handan, Hebei, Smart City.\nSome car owners refused to pay the parking fee in the community due to dissatisfaction with the lack of parking spaces in the community and the prohibition of roadside parking. That night, the property management prohibited the vehicles of owners who had not paid the parking fee from entering the community, which led to a conflict. Afterwards, the police on the scene confronted the owners and some owners were taken away.","images":"/tweet/image/whyyoutouzhele/2024/01/06/1743597555609448727_0.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743597555609448727_1.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743597555609448727_2.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743597555609448727_3.jpg","videos":"","hasPublished":true},{"id":"1743600180744667226","name":"李老师不是你老师","createdDate":"2024-01-06 19:47:32","content":"https://t.co/lOM1QrcaAQ","images":"/tweet/image/whyyoutouzhele/2024/01/06/1743600180744667226_0.jpg","videos":"","hasPublished":true},{"id":"1743611014434709987","name":"李老师不是你老师","createdDate":"2024-01-06 20:30:35","content":"In recent years, incidents of companies defying national laws are no longer news.\nIn August this year, an employee of the Zhengzhou University Design Institute said he wanted to take a break but was rejected. He tried to use the labor law to protect his rights, but the person in charge of his company said: \"You are telling me about the labor law, right? Then go and sue me.\"\n","images":"","videos":"","hasPublished":true},{"id":"1743616762157891875","name":"李老师不是你老师","createdDate":"2024-01-06 20:53:25","content":"@BlazingStellar Thanks for the correction, I'm living in a 23-year dream","images":"","videos":"","hasPublished":true},{"id":"1743618478362317018","name":"李老师不是你老师","createdDate":"2024-01-06 21:00:14","content":"January 6, Shanghai. The owner of the bankrupt One Tera Wade Gym, Lao Lu, took over the new Ruilong Gym and refused to recognize the membership cards of the original One Tera Wade Gym. He sent a large number of security guards to block the members of One Tera Wade outside the door and refused to let them in. As a result, a fierce conflict and shoving broke out between the members and the security guards. During the dispute, a woman fell to the ground and was then carried away in an ambulance.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/06/1743618478362317018_0.jpg","hasPublished":true},{"id":"1743618693718818893","name":"李老师不是你老师","createdDate":"2024-01-06 21:01:06","content":"On January 5, Dazhou, Sichuan. An abandoned baby girl was found in Xuanhan County with a note on her body with her date of birth and reason for abandonment. According to the note, the baby girl was born on August 20, 2023, and was only four months old. It also said \"due to family changes, unable to bear the burden of raising her\".\nOn the 6th, the police from the Xicheng District Police Station said that the baby girl was abandoned with obvious intention and they were trying their best to find her parents. The baby girl has been sent to the Dazhou Welfare Institute","images":"/tweet/image/whyyoutouzhele/2024/01/06/1743618693718818893_0.jpg,/tweet/image/whyyoutouzhele/2024/01/06/1743618693718818893_1.jpg","videos":"","hasPublished":true},{"id":"1743619857650725163","name":"李老师不是你老师","createdDate":"2024-01-06 21:05:43","content":"On January 3, Xinxiang, Henan. At about 10 am, a baby boy was found abandoned on the roadside near a community in Pingyuan New District. The child was placed in the back of a car with a piece of clothing as a cushion, and there were two bags beside it.\nAccording to passers-by, the child should be one year old or a little over one year old. The bag next to him contained milk powder, clothes and a birth certificate. The police contacted the child's grandmother, but she refused to accept him. The specific situation is being communicated.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/06/1743619857650725163_0.jpg","hasPublished":true}]
