[{"id":"1743191354002334103","name":"李老师不是你老师","createdDate":"2024-01-05 16:43:00","content":"On January 4, in a corner of the Harbin Engineering University campus, piles of Xi Jinping's works were thrown next to a trash can.\nIt is reported that the school organized a public book donation activity, mainly Xi Jinping's works, and in the end they were thrown next to the trash can because no one wanted them.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743191354002334103_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743191354002334103_1.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743191354002334103_2.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743191354002334103_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/QNluZCHqKW","accountId":"whyyoutouzhele"},{"id":"1743192680387977473","name":"李老师不是你老师","createdDate":"2024-01-05 16:48:16","content":"On January 3, Henan Provincial Institute of Building Science issued a notice that due to the market depression and the sharp drop in business volume, the company decided to streamline its staff and hoped that employees would consider the overall situation and take the initiative to apply for a long vacation. The company will pay basic social security on their behalf.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743192680387977473_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743192680387977473_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/NU9fmIMWCE","accountId":"whyyoutouzhele"},{"id":"1743195019320705533","name":"李老师不是你老师","createdDate":"2024-01-05 16:57:34","content":"On January 5, A-shares fell for four consecutive days at the beginning of the year, triggering complaints from investors: The market has been falling for ten years in the ten years since it came to power. This is the problem with the government, an invincible leader.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743195019320705533_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743195019320705533_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/hJIYlb8nty","accountId":"whyyoutouzhele"},{"id":"1743196538413727768","name":"李老师不是你老师","createdDate":"2024-01-05 17:03:36","content":"On January 3, the rights protection of the owners of Hengda Jiulongwan in Kunming, Yunnan Province was suppressed, and more than a dozen people were arrested on the scene.\nIt is reported that after the house was left unfinished, Shanghai Green Star Wisdom took over the guaranteed delivery project and promised to deliver the house in May or June of 2024 in 2023. However, during the actual construction period, there were only a few people on the construction site, pretending to be working, and the owners negotiated many times but to no avail.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/05/1743196538413727768_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/pdvLt3QR3t","accountId":"whyyoutouzhele"},{"id":"1743200293754396995","name":"李老师不是你老师","createdDate":"2024-01-05 17:18:31","content":"On January 4, Qinghuayuan School in Neihuang County, Anyang, Henan Province\nOn that day, more than 60 parents went to the school to ask for an explanation because they were dissatisfied with the fee issue, but they unexpectedly found that the hygiene in the restaurant was appalling.\nThe steamed buns were moldy and spoiled, and there were traces of suspected rat bites, the vegetables were not fresh, and even the tableware was stained.\nDuring the period, the parents and a canteen manager had a dispute, and the parents questioned: Why did they spend thousands of yuan for their children to eat these foods. Then the local law enforcement officers came and sealed the steamed buns in the canteen. At the same time, the parents also showed the steamed buns and vegetables in the canteen to a school leader in person.\nIn the early morning of January 5, the Neihuang County Education Bureau issued a situation report stating that after investigation, the situation was true, and the school’s plan to charge weekend tutoring fees had been expressly prohibited, and the principal was suspended.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/05/1743200293754396995_0.jpg","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1743205861562937825","name":"李老师不是你老师","createdDate":"2024-01-05 17:40:39","content":"\"The theory of retribution can be stopped\"\nOn January 4, a blogger posted that according to the data statistics of the US National Oceanic and Atmospheric Administration from 1990 to the present, among the countries that caused \"more than one million losses, ten deaths, 7.5 or tsunamis\", China ranked first with 186 times.\nLearning advanced experience and protecting the safety of people's property is the right way. The theory of retribution can be stopped.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743205861562937825_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743205861562937825_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/20yauxZB6k","accountId":"whyyoutouzhele"},{"id":"1743208728180957688","name":"李老师不是你老师","createdDate":"2024-01-05 17:52:02","content":"On January 3, China Business News published an editorial: The best commitment is to let go and delegate power. \nThe article mentioned: 45 years of reform and opening up show that the history of China's economic take-off is the history of government decentralization and independent expansion of rights. The free expansion of rights is the source of power for economic and social credit. What the government delegates is both power and responsibility, and at the same time, it is the vitality of the economy.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743208728180957688_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743208728180957688_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/WSQWEtS6qB","accountId":"whyyoutouzhele"},{"id":"1743210420679135573","name":"李老师不是你老师","createdDate":"2024-01-05 17:58:46","content":"On January 3, Wuhan, Hubei. A woman suddenly unbuckled her seat belt and prepared to jump out of the car. The driver, who did not notice the abnormality, reminded her that if she did not fasten her seat belt, the car would keep barking and that she could be stabbed from behind.\nWho would have thought that as soon as she finished speaking, the woman suddenly opened the door and jumped out of the car.\nAnother video shows that the woman also rushed towards the car coming from the opposite direction.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/05/1743210420679135573_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/BHh9DsuPcY","accountId":"whyyoutouzhele"},{"id":"1743211970583535824","name":"李老师不是你老师","createdDate":"2024-01-05 18:04:55","content":"https://t.co/LGfCmQpFld","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743211970583535824_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743211970583535824_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/LGfCmQpFld","accountId":"whyyoutouzhele"},{"id":"1743215680948769209","name":"李老师不是你老师","createdDate":"2024-01-05 18:19:40","content":"On January 5, Beijing No. 1 Intermediate People's Court accepted the bankruptcy liquidation application of Zhongzhi Group.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743215680948769209_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743215680948769209_1.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/QzQA0Ubc8L","accountId":"whyyoutouzhele"},{"id":"1743220685583839636","name":"李老师不是你老师","createdDate":"2024-01-05 18:39:33","content":"January 5, Henan. The houses in Jinzunfu community have been built, but the workers' wages have not been paid yet. The workers are outside the developer's door to demand their wages.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/05/1743220685583839636_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/xJdEZxtspp","accountId":"whyyoutouzhele"},{"id":"1743230080980021712","name":"李老师不是你老师","createdDate":"2024-01-05 19:16:53","content":"Netizen added\nBefore, at the entrance of the Public Security Bureau in Laoshan District, Qingdao","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743230080980021712_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/MhLMe3VkJm","accountId":"whyyoutouzhele"},{"id":"1743232315478655364","name":"李老师不是你老师","createdDate":"2024-01-05 19:25:46","content":"Media reports on January 5.\nOn the eve of New Year's Day, some netizens exposed that a public official of the Nanyang Ecological Environment Bureau earned 3,000 yuan a day after tax during his part-time job, which caused netizens to question whether there was any interest transfer.\nStaff of the Fangcheng Branch of the Nanyang Ecological Environment Bureau responded: The employee was an employee of the Environmental Monitoring Brigade and had participated in a one-week special technical work at a Beijing Internet technology company during the six-month salary suspension period. There was no interest transfer problem.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/05/1743232315478655364_0.jpg","hasPublished":false,"tweetShortURL":"https://t.co/kRwpuC27Vj","accountId":"whyyoutouzhele"},{"id":"1743234665257803782","name":"李老师不是你老师","createdDate":"2024-01-05 19:35:06","content":"https://t.co/j563hnozaQ","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743234665257803782_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743234665257803782_1.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743234665257803782_2.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/j563hnozaQ","accountId":"whyyoutouzhele"},{"id":"1743236999048286226","name":"李老师不是你老师","createdDate":"2024-01-05 19:44:23","content":"On January 5, a student exposed online that the Hangzhou Institute of Advanced Studies of the University of Chinese Academy of Sciences was suspected of enrollment fraud.\nThe article stated that when enrolling, the school promised students basic security including 600 yuan of national graduate student scholarships, 700 yuan of Hangzhou Institute of Advanced Studies scholarships, and 1500/1800 yuan of basic research assistant allowances.\nHowever, this year, the 1500/1800 yuan research assistant allowance was suddenly cancelled, which is equivalent to directly cutting the basic security by more than half, and \"clearly requiring not to make public group notifications\". Students learned about it from teachers, and they did not even have the right or channel to appeal, which was obviously inconsistent with the actual propaganda.\nIn the \"Letter to Hangzhou Institute of Advanced Studies\", students wrote that if we do not resist at this time, it will inevitably harm our vital interests. For this reason, we call on students from all colleges to report to the Education Bureau.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743236999048286226_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743236999048286226_1.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743236999048286226_2.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743236999048286226_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1743241512241033491","name":"李老师不是你老师","createdDate":"2024-01-05 20:02:19","content":"Some netizens added that the salary is normal in the industry, but it is rare for civil servants to participate in positions like the Environmental Monitoring Team that have nothing to do with network security.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743241512241033491_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/0DVMqDb8zO","accountId":"whyyoutouzhele"},{"id":"1743245764615102882","name":"李老师不是你老师","createdDate":"2024-01-05 20:19:12","content":"On January 5, Zhejiang Agricultural and Forestry University announced new regulations to rectify unlicensed electric vehicles on campus, which caused collective dissatisfaction and complaints from students. Students said that electric vehicles on campus need to be licensed by lottery, but only a few numbers are issued each time. Many students have not been able to get a license in one or two years, and the sky-high shared electric vehicles on campus are 2 yuan for 10 minutes. Therefore, students cannot get licenses for electric vehicles in compliance with regulations. Even the new regulations of the school require students to transport electric vehicles home during holidays. However, foreign students do not have these restrictions. These regulations only apply to Chinese students. Foreign students can even ride motorcycles on campus. Some students complained that this shows that there are bad people among the leaders and traitors among the masses.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743245764615102882_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743245764615102882_1.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743245764615102882_2.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743245764615102882_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"","accountId":"whyyoutouzhele"},{"id":"1743247621081157641","name":"李老师不是你老师","createdDate":"2024-01-05 20:26:35","content":"On January 5, it was reported that the reform of NetEase's art department will start the order grabbing mode. According to the screenshots, employees will work overtime in the internal system after normal working hours every day to grab orders and accumulate points. The company will adopt the last-place elimination system. The salary for grabbing orders will be paid every six months.\nAn insider of the company said that this is an extra job opportunity for everyone, with a point of 500 yuan. It is up to you whether to do it or not, and it will not affect your performance salary and bonus.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743247621081157641_0.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743247621081157641_1.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743247621081157641_2.jpg,/tweet/image/whyyoutouzhele/2024/01/05/1743247621081157641_3.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/f98l1mEbDA","accountId":"whyyoutouzhele"},{"id":"1743259605679915018","name":"李老师不是你老师","createdDate":"2024-01-05 21:14:12","content":"On January 5, netizens discovered that in a video titled \"Jewish Capital: The World is Under My Control\", the entire screen was filled with comments like \"Hope for the Return of Hebrew\".","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743259605679915018_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/vLVtfXQU32","accountId":"whyyoutouzhele"},{"id":"1743259619659600332","name":"李老师不是你老师","createdDate":"2024-01-05 21:14:16","content":"Industry insiders added","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743259619659600332_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/WMXB1wetiB","accountId":"whyyoutouzhele"},{"id":"1743260239359569924","name":"李老师不是你老师","createdDate":"2024-01-05 21:16:43","content":"Another netizen added","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743260239359569924_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/oghV17lVmD","accountId":"whyyoutouzhele"},{"id":"1743276334288101623","name":"李老师不是你老师","createdDate":"2024-01-05 22:20:41","content":"Recently, a blogger said that the biggest expenditure in the township government is no longer the reception fee, but the publicity and advertising fee.\nNotebooks should be purchased uniformly for learning, billboards should be high-end to create an atmosphere, various systems should be standardized and put on the wall, and billboards should be made for party building, publicity, discipline inspection, and safety production. The annual advertising fee ranges from hundreds of thousands to millions.","images":"/tweet/image/whyyoutouzhele/2024/01/05/1743276334288101623_0.jpg","videos":"","hasPublished":false,"tweetShortURL":"https://t.co/dbQ9KEi8LN","accountId":"whyyoutouzhele"}]