[
  {
    "id": "1743678582231081443",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 00:59:04",
    "content": "On the evening of January 6, a large number of people gathered in front of the Shenzhen Bao'an District People's Government to demand their wages.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743678582231081443_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743747459661103477",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 05:32:46",
    "content": "Netizen contribution\nRecently, in Xinxiang, Henan, the social security payment period was extended by 3 months, and village cadres went door to door to call or visit people to persuade them to pay.\nIn 2018, it was 180 per person, and now it has risen to 380 per person. Some families simply don't pay.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/07/1743747459661103477_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1743765141525582304",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 06:43:01",
    "content": "Netizen contribution\nOn January 5, Beijing's flexible employment social security was changed to implement \"pay first, then subsidize\". After flexible employment, people with employment difficulties must first pay social insurance premiums and then enjoy social security subsidies based on their actual payment.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/07/1743765141525582304_0.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743765141525582304_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1743766128478818804",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 06:46:57",
    "content": "Netizens added: The person who jumped off the building at Tsinghua University Shenzhen Graduate School on the 19th was a master's graduate of 2018. Before his death, his supervisor promised him a place for a doctorate. He persisted and worked as a research assistant for 2-3 years. In December 2023, he learned that the supervisor still had no doctoral places in the fall of 2024. Coupled with some emotional problems, he finally chose to commit suicide.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/07/1743766128478818804_0.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743766128478818804_1.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743766128478818804_2.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1743923067707859347",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 17:10:34",
    "content": "January 6, Nanning, Guangxi. A netizen posted a video saying that the pattern on the wall of the passage of Tinghong Road subway station is the Japanese Rising Sun Flag.\nOn January 7, the subway customer service responded that it might be a bit similar and they would send staff to inspect it as soon as possible.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743923067707859347_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743923357970530442",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 17:11:43",
    "content": "On January 6, in Lu'an, Anhui, a man's feet were accidentally entangled by the rope of a hot air balloon outside a shopping mall. He was immediately carried upside down in the air and was rescued by nearby people.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743923357970530442_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743924198014161260",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 17:15:04",
    "content": "On January 6, in Foshan, Guangdong, dozens of workers sat on the edge of the roof of Wells Plaza and jumped off the building to demand their wages.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743924198014161260_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743925421647753438",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 17:19:55",
    "content": "On January 7, in response to the United States selling weapons to the Taiwan region of China and imposing sanctions on Chinese entities, a spokesperson for the Chinese Ministry of Foreign Affairs announced on the 7th that China has decided to impose sanctions on five US military-industrial companies.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743925421647753438_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743926768329797655",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 17:25:16",
    "content": "On January 1, it was reported online that a Fudan University student who studied in the United States had been living on the streets of Bo City for 16 years. He was unable to work due to frequent auditory and visual hallucinations, and lived a wandering life by picking up garbage and giving alms.\nOn January 5, after confirming that this person was a Fudan alumnus, the New York branch of the Fudan University Alumni Association provided help to Sun Weidong and arranged a temporary residence and regular care for him.\nOn January 7, Sun Weidong, who was properly resettled, thanked the volunteers in front of the camera for helping him restart his life.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743926768329797655_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743927864037134801",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 17:29:38",
    "content": "However, many patriotic big Vs disagreed, believing that the Fudan Alumni Association should not help Sun Weidong, who is already an American.\nThey believed that Sun Weidong \"was given a scholarship by the country, but ended up swearing allegiance to the Star-Spangled Banner\"\nThey accused the Fudan Alumni Association of selective attention and not caring about the homeless in China,\nthey accused Fudan University of \"specially organizing students to work like slaves for foreigners\"\nand compared him with \"Ding Pangzi Gold Medal Lecturer\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/07/1743927864037134801_0.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743927864037134801_1.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743927864037134801_2.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743927864037134801_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1743932177773891970",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 17:46:46",
    "content": "On January 7, a post on Douyin lamenting the hard work of subway security inspection resonated with many subway security inspectors. Many subway security inspectors said that they were working under extremely high workloads, but their salaries were pitifully low.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/07/1743932177773891970_0.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743932177773891970_1.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743932177773891970_2.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743932177773891970_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1743936857031802943",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 18:05:22",
    "content": "Later, the blogger said someone approached him and asked him to delete the post.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/07/1743936857031802943_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1743941571920158887",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 18:24:06",
    "content": "\"Return Man\"\nRecently, a merchant said that Taobao opened the \"refund only\" policy only a few days ago, and the \"return man\" appeared.\nSomeone bought 4 items and asked for express delivery separately. After the express delivery arrived, it was rejected and applied for a refund only. Only one item was returned, but all the money was returned to her.\nAfter contacting the express delivery station, it was learned that this person had done this for thousands of express parcels, and even used a truck to pick up the express.\nThe merchant complained to Taobao but failed, and has now reported to the police.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743941571920158887_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743946370145218704",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 18:43:10",
    "content": "Recently, a student revealed that Guangzhou No. 1 Tie Middle School spent a huge amount of money to purchase an \"intelligent interactive emotional catharsis instrument\", but in fact it was a Nintendo Wii game console with a screen.\nAccording to the funding disclosure of Tie No. 1 Tie Middle School, the \"intelligent interactive emotional catharsis instrument\" was produced by Beijing Aotai Rege Technology Co., Ltd. and the purchase cost was 46,500 yuan.\nAccording to Taobao search, the price of a Nintendo Wii game console is about 600 yuan.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743946370145218704_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743955353216147548",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 19:18:51",
    "content": "Netizens added that the game console was produced in 2006 and costs less than 200 yuan on the second-hand market.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/07/1743955353216147548_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1743961795184750619",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 19:44:27",
    "content": "On January 6, the media reported that China's per capita GDP (gross domestic product) has reached 12,000 US dollars, which is 600 US dollars away from the World Bank's high-income standard of more than 13,000 US dollars in 2022. \nAs soon as this article came out, it was ridiculed by many netizens. One netizen replied: One is per capita GDP, and the other is per capita income. These are two concepts! \nNetizens said that although the per capita GDP announced by the Chinese media reached 12,000 US dollars, the data released by the Chinese government in 2023 showed that the per capita disposable income of urban residents in the first half of 2023 was 26,357 yuan, and the per capita disposable income of rural residents was 10,551 yuan.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/07/1743961795184750619_0.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743961795184750619_1.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743961795184750619_2.jpg,/tweet/image/whyyoutouzhele/2024/01/07/1743961795184750619_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1743964050956935600",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 19:53:25",
    "content": "Those who carry firewood for the public will be banned and silenced\nRecently, a Nanjing netizen continued to expose the problem of Nanjing Gas Company charging randomly online, saying that it charged 0.61 yuan more per cubic meter, but was restricted by Douyin officials in various ways, including limiting traffic, limiting private messages, forcing offline, and forcing account cancellation, etc.\nBut in the end, with his efforts, local media conducted interviews and investigations, and the gas company issued an announcement stating that it would conduct an investigation.\nOn January 6, he released a video lamenting that Nanjing people are not united at all. The matter involves the interests of all Nanjing people, but everyone is not concerned about their own interests. They just hope that others will rush to the front and they will reap the fruits of their labor.\nOn January 7, he released a video saying that Douyin has popped up a window asking him to cancel his account, and goodbye everyone.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743964050956935600_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743970137919705197",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 20:17:36",
    "content": "On January 7, a COSER posted a video saying that she was stopped and questioned by the police while riding the subway in Shanghai. According to the video content, the girl had just returned from a comic exhibition, but was not allowed to enter the station and was questioned by the police. The police asked her what image she was COSing. After confirming that the other party was a domestic game character and was wearing Hanfu, they asked her to provide her ID card. Finally, the police asked her to take off her hat and accessories, and said that she would be held legally responsible if she attracted onlookers in the subway. The police said that if you dress up as a Coser to enter the subway, you must call the police, but if you wear Hanfu alone or your face and hair color are not dressed up accordingly, you don’t need to.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743970137919705197_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743970580125057448",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 20:19:22",
    "content": "On January 6, a blogger in Wuhan, Hubei Province, posted a video saying, \"On December 29, 23, a group of people in black suddenly rushed into my home, strangled me, and forced me into a truck, and left me on the side of the road. When I got back by car, my home had become a ruin.\"\nIn the video, the children were looking for their textbooks in the ruins.\nOn January 7, the person concerned went to the local police station to inquire about the results of the investigation, and the staff asked him to go back and wait for notification.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743970580125057448_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743982087214969343",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 21:05:05",
    "content": "January 6, Fujian. A group of parents who lost their children were looking for them in the square, holding their children's photos, when a row of unidentified people wearing masks appeared from nowhere, formed a human wall to block them and prohibited pedestrians from approaching.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743982087214969343_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1743983199322030444",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-07 21:09:31",
    "content": "January 6, Huai'an, Jiangsu. Yifeng Times owners collectively defended their rights and had a scuffle with the police.\nIt is said that the developer occupied the owner's shop but did not pay rent to the owner.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/07/1743983199322030444_0.jpg",
    "hasPublished": true
  }
]