[
  {
    "id": "1706575013803913246",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 15:42:44",
    "content": "The article was contributed by @maishaotongxue, a party involved in the Zhu Jun case\n\n\"Zhu Jun case, what happened from June 2014 to September 2023\"\n\nOn June 10, 2014, Xian Zi, who was interning in the CCTV \"Art Life\" column group, was molested by the host Zhu Jun in the dressing room. Because Yu Junjian and others entered the dressing room, Zhu Jun stopped molesting her, and Xian Zi refused.\n\nOn June 10, 2014, Xian Zi communicated with classmates and relatives to ask how to deal with it, and the answer she got was not to make it public.\n\nOn June 11, 2014, Xian Zi communicated with Teacher Z, who suggested that Xian Zi call the police. Accompanied by Teacher Z, Teacher Z's friend (a lawyer) and classmates, Xian Zi went to the Yangfangdian Police Station of the Haidian Branch of the Beijing Municipal Public Security Bureau to report the case. The police took statements from Xianzi and Teacher Z. After completing the one-hour statement, the police went to CCTV, conducted an on-site investigation in the dressing room where the incident occurred, and retrieved the surveillance video. Later, the police extracted DNA from Xianzi's underwear and played the surveillance video to Xianzi and others. During the video playback, the police pointed to the scene of Xianzi wiping her mouth and said, \"This video can be used as evidence that you were forced by Zhu Jun.\"\n\nOn June X, 2014, the duty officer of Yangfangdian Police Station told Xianzi that the case was now handled by the Haidian Branch of the Beijing Municipal Public Security Bureau. Later that day, two police officers told Xianzi, \"Zhu Jun is positive energy, and the impact of this incident should be considered.\" (I don't remember the exact date)\n\nOn June 13, 2014, the Haidian Branch of the Beijing Municipal Public Security Bureau came to the home of Xianzi's parents in Wuhan without informing Xianzi, put pressure on her parents, and asked Xianzi's parents to write a letter of guarantee, promising not to mention that Xianzi had been molested by Zhu Jun.\n\nAt 5:17 am on July 26, 2018, Xianzi posted her first long Hammer Notes article on WeChat Moments, describing what happened four years ago and her reflections on the past four years. Her friend saw the long article on her Moments and posted it on her own Moments. This friend is also a friend of Mai Shao.\n\nAt 6:42 am on July 26, 2018, Mai Shao posted a long article on Weibo that he saw on his friend's Moments, and noted: A friend of a friend exposed CCTV host @朱军99.\n\nAt 8:50 am on July 26, 2018, the long article on Weibo posted by Mai Shao was blocked.\n\nAt 22:46 on July 26, 2018, Xianzi's classmate Asan posted a long Hammer Notes article, describing how Xianzi asked him for help on the day of the incident, and how Teacher M, who worked in the CCTV \"Art Life\" column group, put pressure on him and Xianzi. Later, the Weibo was blocked.\n\nAt 15:22 on July 27, 2018, Caixin.com published a report titled \"Female intern accuses host of sexual harassment\". In this report, which was forwarded 11,000 times that day, the reporter interviewed Xianzi, Teacher Z, Teacher Z's lawyer friend who had accompanied Xianzi to report the case, Asan, Yangfangdian Police Station and Zhu Jun. Among them, Yangfangdian Police Station and Zhu Jun refused to respond. This report is the first relatively comprehensive report on this matter by domestic media. Other media also conducted interviews on the same day, but none of them were published. Five hours after the release, Caixin.com's report was deleted.\n\nOn July 30, 2018, accompanied by a lawyer, Xianzi arrived at the Yangfangdian Police Station at 2:30 pm to request the results of the investigation four years ago, and was told that the case had been handled by the Beijing Haidian Branch. Xianzi and the lawyer waited at the Yangfangdian Police Station until 7 pm. A police officer from the Beijing Haidian Branch came to the police station and asked Xianzi to re-write and sign the record of the indecent incident and the dissemination process of the Hammer Note. The Yangfangdian Police Station promised to notify Xianzi the next day and give her a receipt for the case four years ago, but Xianzi has not received a call from the police station so far.\n\nOn the evening of August 14, 2018, Mai Shao was pressured to \"vacate the current rental house if he did not delete the Weibo related to Zhu Jun\".\n\nAt noon on August 15, 2018, Beijing Xingquan Law Firm issued a lawyer's statement on its official Weibo account, stating that the information that \"Zhu Jun sexually harassed (molested) interns\" that had been circulating online since July was false information, and emphasized that the firm had conducted a 20-day investigation and evidence collection. The firm has represented the case and sued the original Sina Weibo poster and the forwarding user of the incident to the Haidian District People's Court of Beijing on August 15.\n\nOn the evening of August 15, 2018, the Beijing News published an interview with Mai Shao: \"After Zhu Jun spoke out, the whistleblower and the parties hope to go to court | Exclusive\" report, and the article published on the official account was deleted the next day.\n\nOn the evening of August 16, 2018, Xian Zi opened a Weibo account under the name \"Xian Zi and Her Friends\" and responded to Zhu Jun's lawyer's statement, saying that \"Mai Shao is not spreading rumors, and all the friends who spread the article are not spreading rumors, because that is the truth, my real experience. I very much hope that Zhu Jun's lawyer's letter can give me an opportunity to prove the truth.\" \n\nOn August 17, 2018, Xian Zi issued a \"Statement on the \"Lawyer's Statement\" of Beijing Xingquan Law Firm\", saying \"I hope that Beijing Xingquan Law Firm can take facts and laws seriously, rather than continue to undermine the seriousness of the law and the \"Lawyer's Statement\". If Beijing Xingquan Law Firm continues to spread the rumor that \"Zhu Jun sexually harassed (molested) an intern (myself) as false information\", I will hold Xingquan Law Firm and related attorneys accountable in accordance with the law.\" \n\nOn August 18, 2018, Xian Zi's Weibo was restricted from forwarding, and she could only post Weibo, and others could not forward her Weibo content. \n\nOn August 20, 2018, many media outlets published a report titled \"Video of a sexual harasser: Zhu Jun read my palms, tried to reach under my skirt and then kissed me forcefully.\" For the first time, Xian Zi told the story of what happened four years ago in front of the camera, and hoped that more victims would come forward to defend their legitimate rights and interests.\n\nOn August 22, 2018, People magazine published a report on Xian Zi: \"After reporting sexual harassment.\"\n\nFrom August 22 to 23, 2018, Xian Zi received threatening calls from other places, threatening the safety of her mother; on the evening of the 23rd, the threatening calls and recordings were disclosed on Weibo.\n\nOn the afternoon of August 24, 2018, after waiting for 9 days and still not receiving a copy of Zhu Jun's indictment, Mai Shao posted a \"Response to Zhu Jun's Lawyer's Statement\" on Weibo, calling on Zhu Jun's lawyer to contact his lawyer in order to advance the judicial process as soon as possible. In her response, she said, \"This case not only concerns my own interests and the interests of the victim, but will also serve as a yardstick to judge whether China's judiciary can protect the legitimate rights and interests of women.\"\n\nOn August 27, 2018, Mai Shao and her lawyer went to the notary office to notarize the evidence.\n\nOn August 28, 2018, Mai Shao posted a Weibo saying, \"Sina has unblocked all the blocked Weibo posts about Zhu Jun on my Weibo,\" and she thought things might have changed.\n\nOn August 29, 2018, more news came out that Zhu Jun's sexual harassment (molestation) of female interns may have been dealt with internally. Xian Zi and Mai Shao said, \"What we want is legal explanation and progress, and we also ask CCTV, as the person in charge of the workplace, to make the investigation results public.\"\n\nOn September 3, 2018, the \"Chinese Folk Song Conference\" program (replay) hosted by Zhu Jun appeared on CCTV-3 and will be broadcast for 8 consecutive days. The next day, the program was suspended.\n\nOn September 5, 2018, Xian Zi's Weibo could be forwarded. On the same day, American and Chinese media reported that \"JD.com CEO Liu Qiangdong was arrested in the United States on suspicion of raping a female college student\". The US police accepted interviews from media in both China and the United States and released the full text of the report on the case.\n\nComparing the experiences of Zhu Jun and Liu Qiangdong, Associate Professor Zhou Xuanyi of the School of Philosophy of Wuhan University posted a Weibo saying: In our lifetime, we finally realized that the sexually assaulted do not need to stand up, but the accused should stand up. Some common sense only becomes common sense after being realized.\n\nOn September 25, 2018, Mai Shao and Xianzi received a call from the Beijing Haidian Court, notifying them that they had been sued by Zhu Jun. In the indictment, Zhu Jun and his attorney claimed that the content published by Mai Shao and Xianzi was \"fabricated and seriously untrue\". On the grounds of a dispute over reputation rights, they demanded that Mai Shao and Xianzi compensate for their economic losses and mental consolation for a total of 655,000 yuan. On the same day, Xianzi filed a complaint with the Beijing Haidian Court on the grounds that Zhu Jun \"sexually harassed and violated her personality rights\".\nIn a video interview, Xian Zi said, \"After you come forward, everyone will know more clearly that you are a living person.\" Mai Shao said, \"We will actively respond to the lawsuit and let the judiciary decide.\"\n\nOn September 26, 2018, Caijing Magazine and Vista Magazine published interviews with Xian Zi and Mai Shao. Regarding possible results and mediation, they said, \"We don't want to admit defeat before we see the verdict, and we are not prepared to admit defeat.\"\n\nOn September 27, 2018, after a month of interviews and information collection, Reuters, one of the three major international news agencies, published a related report. The report mentioned that \"although sexual harassment in the workplace is very common, there have been only 34 cases of sexual harassment officially recorded in the court database since 2010, some of which were cases where the victims were prosecuted.\"\n\nOn the evening of September 29, 2018, Xian Zi and Mai Shao participated in the online discussion of matters: Me too response to the lawsuit. In the discussion lasting more than two hours, they shared their views on the outcome of the lawsuit, the metoo movement and other topics.\n\nOn September 30, 2018, The Paper published a commentary saying, \"Since this year, some cases related to women's dignity have also occurred around us. We should not leave a mess to satisfy the curiosity of onlookers, nor should we allow all kinds of low-quality conspiracy theories to run rampant. Instead, we should reconstruct relevant legislation and discourse power, so that every accusation of sexual assault and sexual harassment is taken seriously, jump out of the mud pit of scandals and vulgar jokes, and make individual cases a stepping stone for China's legal civilization and the progress of women's rights.\"\n\nOn October 1, 2018, Zhu Jun did not appear in the singing video of the 100 hosts singing together at the 60th anniversary celebration of CCTV.\n\nOn October 25, 2018, the plaintiff Zhu Jun and the defendants Xian Zi and Mai Shao will exchange evidence in the Haidian Court of Beijing. The case of Xian Zi suing Zhu Jun was accepted by the Haidian District People's Court of Beijing.\n\nOn January 18, 2019, Zhu Jun's request to the court to terminate the trial was rejected by the Haidian District People's Court. Xianzi obtained the case file she reported to the police station in 2014 from the internal documents of the court, and submitted two applications to the court, changing the case to a \"sexual harassment damage liability dispute\" and requesting both parties to take a polygraph test.\n\nIn 2019, Mai Shao's Weibo, Zhihu account, WeChat public account, and NetEase Cloud Music account were all muted.\n\nIn October 2020, Mai Shao went to the UK and France to pursue a master's degree in public health.\n\nOn December 2, 2020, Xianzi's case against Zhu Jun for sexual harassment damage liability dispute was heard in the Haidian District People's Court. The trial lasted more than ten hours. On that day, some of Xianzi's supporters expressed their support at the door of the court, and some foreign media reporters who came to interview were taken away by the police. Chinese domestic media are not allowed to report any information about the trial. So what happened during the more than ten hours of trial?\n\n1. In January 2019, Xian Zi applied to change the case to \"sexual harassment damage liability dispute\" in accordance with the law, but it was not until the day of the trial in December 2020 that the collegial panel decided not to change it, and the reason given was very absurd.\n\n2. After the pre-trial meeting in January 2019, Xian Zi's party requested a re-DNA test of the dress Xian Zi wore on the day of the incident, but was rejected by the court on December 2, 2020.\n\n3. After the pre-trial meeting in January 2019, Xian Zi's party requested to play the CCTV corridor surveillance video on June 9, 2014 in court. However, even though there were multiple surveillance video screenshots in the file, the response of the Haidian Public Security Bureau was \"never retrieved the surveillance video.\" Xian Zi's party asked the court to continue to retrieve it from the public security, but was rejected in court. (Note: The court denied the existence of the video when many parties had seen the video and video screenshots)\n\n4. Both of Xianzi's parents appeared to testify and stated that on June 13, 2016, they were asked by the criminal police of Haidian Public Security Bureau in Wuhan to make a statement and promised not to pursue the matter. Xianzi's party requested to obtain the statement of Xianzi's parents from the police in court, but was rejected in court.\n\n5. Shang, who took Xianzi into the dressing room and became Zhu Jun's witness, clearly stated in the lawyer's statement submitted by the other party as evidence: he was studying in another city in June 2014, did not participate in the program recording, was not familiar with Xianzi, had little communication, and never took Xianzi into the dressing room. After the authenticity of this testimony was denied by the corridor surveillance screenshots in the file and the notarized materials submitted by Xianzi's party, Xianzi's party requested to notify Shang to appear in court to find out the reasons for his perjury and the facts of the case, but was rejected by the collegial panel in court.\n\n6. For two years, Xian Zi's side has repeatedly asked the court to notify Zhu Jun to appear in court, but the collegial panel replied \"no need\", without explaining the reason or giving any legal basis.\n\n7. According to Articles 15 and 16 of the People's Juror Law, Xian Zi's side requested the participation of people's jurors and a seven-member collegial panel.\n\n8. Xian Zi's side requested a public trial, but was never granted, and could only let the other side throw dirty water.\n\nOn December 21, 2020, Weibo @一个有点理想的记者 published an article pointing out that the case was pointed at \"foreign forces\", using Mai Shao's identity as an international NGO employee and the presence of traditional Chinese characters on the signs held by supporters outside the court on December 2, emphasizing that the metoo and Zhu Jun cases were tools used by foreign governments to try to carry out a color revolution in China through Mai Shao and Zhu Jun's cases. Mai Shao denied support from foreign forces and denied that the international organization he worked for had any connection with the Zhu Jun case. He was willing to accept all investigations, but various channels for speaking out had been silenced.\n\nOn September 14, 2021, in response to the dispute over sexual harassment damages between Xian Zi and Zhu Jun, the Beijing Haidian Court held a closed trial and believed that the evidence submitted by Xian Zi was insufficient to prove Zhu Jun's sexual harassment, and rejected her lawsuit at first instance. After the trial, Xian Zi read a statement to her supporters outside the court, saying that the judge did not give her the opportunity to elaborate on the allegations and did not allow the prosecution to obtain multiple pieces of evidence, such as surveillance videos, group photos, transcripts, and DNA on the clothes she wore at the time. In her statement, Xian Zi said: \"Thank you very much, I will definitely appeal.\" Zhu Jun did not appear in court on the day of the trial, nor did he respond to Xian Zi's statement after the trial. On social media such as Sina Weibo and WeChat official accounts, many accounts that supported Xian Zi or forwarded information about the case were banned or blocked. Xian Zi appealed.\n\nIn October 2021, after Xian Zi's official account published the judgment and appeal, the article was deleted and Xian Zi's WeChat official account was banned. Many netizens who participated in the forwarding on Weibo were banned.\n\nAt 2:00 p.m. on August 10, 2022, the second instance of the general personality rights dispute (sexual harassment damage liability dispute) between Xianzi and Zhu Jun upheld the original judgment.\n\nIn 2023, Xianzi applied for a retrial of the general personality rights dispute case.\n\nOn September 22, 2023, Mai Shao's lawyer received a civil ruling from the Beijing Haidian Court. Zhu Jun applied to withdraw the defamation lawsuit against Mai Shao and Xianzi in August 2018. The Beijing Haidian Court ruled to allow Zhu Jun to withdraw the lawsuit. At this point, Zhu Jun's case ended.\n\nMai Shao wrote, \"When this lawsuit just started in July 2018, I never thought it would take five years, and that a lawsuit would go through a narrative transformation from 'sexual harassment' to 'foreign forces trying to start a color revolution in China through metoo'. In the past five years, this lawsuit is part of the epitome of the transformation of our times.\"\n\nOn September 24, 2023, Xu Kai, the lawyer of Xian Zi and Mai Shao, issued a closing statement as follows:\n\n1. In the case of reputation rights dispute, the plaintiff Mr. Zhu took the initiative to withdraw the lawsuit to the court, and there was no settlement or negotiation in any form between the plaintiff and Mai Shao Xian Zi and/or its agents.\n\n2. In the case of general personality rights dispute, after the first instance, the second instance and the application for retrial, the plaintiff Xian Zi had the burden of proof, but the existing evidence was insufficient to prove the fact of sexual harassment, and the claim was dismissed. The first instance, the second instance judgment and the retrial ruling of this case did not in any way determine or imply that the plaintiff Xian Zi made false statements or fabricated facts.\n\n3. Our client took the initiative to participate in every court session organized by the court, answered every question raised by the court, collected and submitted or applied for every piece of evidence related to the facts to be proved, and exhausted every method we know of in the civil litigation process that may assist the court in ascertaining the facts. 4. After reporting to the police in 2014, filing a lawsuit in 2018, the first instance in 2021, the second instance in 2022, and applying for a retrial in 2023, Xian Zi lived up to the declaration she wrote on her WeChat Moments at the age of 21 in the early morning of the day she reported to the police:",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706575013803913246_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706576049339842828",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 15:46:51",
    "content": "Netizens hotly discuss the case of Chengde programmer being fined",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706576049339842828_0.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706576049339842828_1.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706576049339842828_2.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706576049339842828_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/NtKLegtSXn",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706576267431006502",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 15:47:43",
    "content": "Current situation of Zhengzhou No.1 Middle School",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706576267431006502_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/RyyX3UXi8c",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706576359571550245",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 15:48:05",
    "content": "https://t.co/Z4cB3eWp58",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706576359571550245_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Z4cB3eWp58",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706577768589185491",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 15:53:41",
    "content": "Under a video about Hong Kong police, netizens in the comment section all wrote “absolutely amazing”",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/09/26/1706577768589185491_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/wv7Qsrunsq",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706578728170438666",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 15:57:30",
    "content": "In Chifeng, Inner Mongolia, police are stopping pedestrians to check whether they have downloaded the national anti-fraud app.",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706578728170438666_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/LpgjD2DK0v",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706579458595942531",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 16:00:24",
    "content": "On September 25, in Xianyang, Shaanxi, a woman wanted to meet with the leader of the Housing and Urban-Rural Development Bureau and was stepped on by three security guards.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/09/26/1706579458595942531_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/7okigcCdzX",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706580217202987478",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 16:03:25",
    "content": "https://t.co/xuwPj5Q0HW",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706580217202987478_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/xuwPj5Q0HW",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706580619935772999",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 16:05:01",
    "content": "On September 26, a worker from Building 4 of Jiangxi Normal University jumped off a building, allegedly because the school had withheld workers' wages due to summer dormitory renovation.",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706580619935772999_0.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706580619935772999_1.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706580619935772999_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Q4edqBRBMF",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706585954603970601",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 16:26:13",
    "content": "Netizen contribution\nJiujiang No. 1 Middle School in Jiangxi Province replaced its new principal and party secretary in September this year.\nHowever, the new party secretary of Jiujiang No. 1 Middle School took a series of \"reform\" measures after taking office, including forcing senior high school students to study and take exams in class during sports games, reducing teachers' salaries, etc.\nAnd it is precisely because of these things that all the teachers and students in the school are dissatisfied with the new leadership. So, not long ago, some students from Jiujiang No. 1 Middle School couldn't stand this matter anymore and decided to stand up and write an article called \"Bombard the Headquarters\", and copies began to circulate in the school and in some QQ groups of school students.\nUntil about last Thursday and Friday, the police came directly to the school and took away some students involved in the incident. It seems that there are also people from the Provincial Commission for Discipline Inspection.\nThe questions asked by the police even included things like the \"White Paper Movement\" and threatened these students not to spread this matter on any platform",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706585954603970601_0.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706585954603970601_1.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706585954603970601_2.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706585954603970601_3.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706586912998277344",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 16:30:01",
    "content": "On September 25, a female doctoral student at Xidian University jumped off a building. It was said that she was under too much pressure from her supervisor.",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706586912998277344_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/LKs26iSu3A",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706625835858264323",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 19:04:41",
    "content": "Entering September, the issue of \"pre-prepared meals entering campuses\" has caused an uproar in Chinese society \nWhy do canteen problems occur frequently in China? \nWhy do ordinary people prefer to trust the school canteen that may produce \"rat heads and duck necks\" rather than the pre-prepared meals made uniformly by the central kitchen? \nBecause ordinary people may not understand pre-prepared meals, but they understand China. \n\nhttps://t.co/U0VoeC82t8",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706625835858264323_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/0wCWFCs7UD",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706626415100076192",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 19:06:59",
    "content": "On September 26, in Xiamen, traffic police confiscated a deliveryman’s electric bike on the street",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/09/26/1706626415100076192_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/0PaMsSbBZw",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706628116402057264",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 19:13:45",
    "content": "Recently, a leader of a state-owned enterprise in Jiangxi said, \"Don't ever think that Saturdays and Sundays are non-working days,\" because employees did not see any news for half a day on Saturday, and expressed the intention to adopt the Saturday-Sunday work system in the future.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/09/26/1706628116402057264_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/RAAOsrW8yj",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706628834655694995",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 19:16:36",
    "content": "https://t.co/fkGMW7mjCK",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706628834655694995_0.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706628834655694995_1.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706628834655694995_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/fkGMW7mjCK",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706629511565975902",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 19:19:17",
    "content": "https://t.co/0bSaOR1bod",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706629511565975902_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/0bSaOR1bod",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706648684413301246",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 20:35:29",
    "content": "On September 26, in Renhe Town, Baiyun District, Guangzhou, the aunties who used to do square dance every day suddenly started practicing the loyalty dance.",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706648684413301246_0.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706648684413301246_1.jpg,/tweet/image/whyyoutouzhele/2023/09/26/1706648684413301246_2.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/pXEEHCgNWs",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706673465216860321",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 22:13:57",
    "content": "September 26, Baoji Street",
    "images": "/tweet/image/whyyoutouzhele/2023/09/26/1706673465216860321_0.jpg",
    "videos": "",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/Bq0Zrtg3uE",
    "accountId": "whyyoutouzhele"
  },
  {
    "id": "1706693550664986632",
    "name": "李老师不是你老师",
    "createdDate": "2023-09-26 23:33:45",
    "content": "Around the night of September 25 and the early morning of September 26, a murder occurred on Xiangyang Road in Licang District, Qingdao. A man and a food delivery boy were hacked.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2023/09/26/1706693550664986632_0.jpg",
    "hasPublished": false,
    "tweetShortURL": "https://t.co/fI1dQvwzlu",
    "accountId": "whyyoutouzhele"
  }
]