[{"id":"1849931943661482317","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-26 05:52:00","content":"On October 25, a netizen posted on Xiaohongshu that he wanted to visit the \"European Town\" of Huawei's Dongguan headquarters, but he received an administrative warning from Huawei.\nThe netizen said that he wanted to take his children to visit Huawei's headquarters, but he couldn't find the reservation entrance. Seeing that there were many posts on Xianyu asking for a tour, he also posted one. Unexpectedly, he received an administrative warning from Huawei.\nIt is reported that Huawei's European Town in Xiliu Beipo Village, Songshan Lake, Dongguan, was built according to 12 European towns or classic buildings such as Oxford, Windermere, Luxembourg, Bruges, Fribourg, Burgundy, Verona, Paris, Granada, Bologna, Heidelberg, and Kleinnov, with a total construction area of 1.26 million square meters. Through online searches, you can see many guides for visiting European towns. However, the area is not actually open to the public as Huawei's office area.","images":"/tweet/image/whyyoutouzhele/2024/10/26/1849931943661482317_0.jpg,/tweet/image/whyyoutouzhele/2024/10/26/1849931943661482317_1.jpg,/tweet/image/whyyoutouzhele/2024/10/26/1849931943661482317_2.jpg,/tweet/image/whyyoutouzhele/2024/10/26/1849931943661482317_3.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1849934451947483142","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-26 06:01:58","content":"On October 24, the Swiss Federal Institute of Technology in Zurich ETH announced strict security checks on Chinese students, which means that Chinese students will have almost no chance of enrolling in the school's science, technology, engineering or mathematics (STEM) majors in the future.\nThe school was founded in 1855 and is known for its rigorous academics and outstanding scientific research. It has trained many Nobel Prize winners, including Einstein.\nIn addition to China, Afghanistan, Belarus, Cuba, Iran, Iraq, Syria, North Korea, Russia, Sudan, Venezuela and other countries are also included in the review","images":"/tweet/image/whyyoutouzhele/2024/10/26/1849934451947483142_0.jpg,/tweet/image/whyyoutouzhele/2024/10/26/1849934451947483142_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1849943192818348424","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-26 06:36:42","content":"Recently, two jumping incidents occurred in Qingdao Binhai College, resulting in one death and one injury. According to students, the reason for the students jumping off the building was that they had a mental breakdown due to the school's strict management system.\nAfterwards, the school immediately blocked the news, and the angry students expressed their dissatisfaction with the school management by posting posters and exposing it online.","images":"/tweet/image/whyyoutouzhele/2024/10/26/1849943192818348424_0.jpg,/tweet/image/whyyoutouzhele/2024/10/26/1849943192818348424_1.jpg,/tweet/image/whyyoutouzhele/2024/10/26/1849943192818348424_2.jpg,","videos":"/tweet/video/whyyoutouzhele/2024/10/26/1849943192818348424_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1849944248600437179","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-26 06:40:53","content":"Netizens added that some of the situations of Shanghai's \"Halloween Martial Law\" on the evening of the 25th","images":"/tweet/image/whyyoutouzhele/2024/10/26/1849944248600437179_0.jpg,/tweet/image/whyyoutouzhele/2024/10/26/1849944248600437179_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1850009464017125854","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-10-26 11:00:02","content":"At present, there is no further update on Shabai's personal account, but the profile picture has changed from color to black and white.\nAt the same time, the Weibo topic #The profile picture of the woman who went to Switzerland for euthanasia has become black and white# was banned by the platform.\n","images":"/tweet/image/whyyoutouzhele/2024/10/26/1850009464017125854_0.jpg,/tweet/image/whyyoutouzhele/2024/10/26/1850009464017125854_1.jpg,/tweet/image/whyyoutouzhele/2024/10/26/1850009464017125854_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true}]