[
  {
    "id": "1774829485595984043",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 00:01:38",
    "content": "On April 1, a fire broke out in a dormitory on the Xinghu campus of Guangdong University of Technology and Business. It is suspected that the fire was caused by the aging of the school's wiring.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1774829485595984043_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1774831582748065947",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 00:09:58",
    "content": "Netizen contribution\nChina Aviation Information Group conducts regular surveys on the ideological trends of employees in its various units.\nAnd includes \"group incidents and signs such as petitions\" in the \"survey of the bottom line of cults\" work.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1774831582748065947_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1774833947089818029",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 00:19:22",
    "content": "On March 9, a Nanjing cyclist posted a video showing that he was stopped by a traffic policeman on the streets of Nanjing. The traffic policeman said that bicycles without license plates were not allowed on the road.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1774833947089818029_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1774847783037526524",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 01:14:21",
    "content": "April 1, Wangzuo Town, Fengtai District, Beijing. The property management of Yanxi Huafu District A charged high parking fees. When the owners refused to pay, the property management closed the gate of the underground garage in the community and prevented the owners' cars from entering. As a result, a large number of owners' cars were stranded outside the community and could not enter, which aroused strong dissatisfaction among the owners. That night, about 400 owners protested outside the community. The police mediated on the spot and asked the town government to come and deal with it.\nAfter the town government arrived at the scene, it was suspected that they had not reached an agreement with the property management. An owner at the scene said, \"Does the developer not give face to the deputy mayor? Is it so awesome?\"\n23:29 (Released) At this time, the impatient owners kept shouting \"Lift the pole! Lift the pole! Lift the pole!\"\n23:33 (Released) With the efforts of many owners, the property management finally opened the gate. The owners applauded and congratulated, saying \"Victory, a staged victory\"\nAccording to media reports, Fengtai Yanxi Huafu District A...",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1774847783037526524_0.jpg,",
    "hasFullContentTranslated": false,
    "fullContent": "4月1日，北京丰台区王佐镇。燕西华府A区物业高价收取停车费，业主们不交费，物业便关闭小区地下车库的道闸，不让业主们的车进入，导致大量业主的车被滞留在小区外无法进入，引发业主们的强烈不满，当晚大约有400名左右的业主在小区外抗议。警察在现场调解并让镇政府的人过来处理。\n 镇政府的人到达现场后，疑似和物业没有谈拢。现场有业主称“开发商都不给副镇长面子吗？这么牛的吗”\n 23时29分 (发布) 此时失去耐心的业主们在现场不断高喊“抬杆儿！抬杆儿！抬杆儿！”\n 23时33分 (发布) 在众多业主们的努力下，最终物业打开了道闸，业主们拍手祝贺，说道“胜利了，阶段性胜利了”\n据媒体报道，丰台燕西华府A区的业主们此前在购房时，开发商曾口头承诺小区业主可以免费使用地下车库，即便未来对外销售，每个车位的价格也不会超过15万元。可2023年11月，开发商却贴出了一纸公告，称2024年3月31日前选购A区车位，每个小车位为32万元；4月1日后选购，每个小车位的价格将涨至45万元。而租赁价格为每月450元，再加上管理费100元，算下来，一年要交6600元。此举令大量业主不满，业主们不能接受物业的“强买强卖。”因此和开发商发生矛盾，导致了4月1日晚的冲突。",
    "hasPublished": true
  },
  {
    "id": "1774855611672322135",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 01:45:27",
    "content": "On March 30, Phoenix.com published an editorial.\nMultiple ministries and commissions met with heads of multinational companies intensively, and asked people not to let xenophobia disrupt the business environment.\nThe article believes that attracting foreign investment is of great significance to China's economic growth, job opportunities and technological innovation.\nXenophobic voices have created difficulties for the country to continue to expand and deepen its opening up. Xenophobia at the grassroots level and the openness of the upper-level policies should not coexist for a long time.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1774855611672322135_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1774855611672322135_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": false
  },
  {
    "id": "1774925343389794349",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 06:22:33",
    "content": "Follow-up\nChinese students and international students started to criticize each other on the campus software",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1774925343389794349_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1774925343389794349_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1774941612163920233",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 07:27:11",
    "content": "An absurd farce performed with the suffering of the people of Shanghai.",
    "images": "",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1774988292292821400",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 10:32:41",
    "content": "April 2, Changchun, Jilin. Guanqun has been in trouble for 5 years, and investors went to the Nanguan District People's Procuratorate to defend their rights",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1774988292292821400_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1774989089881686450",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 10:35:51",
    "content": "Stickers with implicit meanings appeared on the streets of Beijing, suspected to be from Meituan's crowdsourcing riders satirizing Meituan's internal competition and income problems.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1774989089881686450_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1774989089881686450_1.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1774989089881686450_2.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775112382051647982",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 18:45:46",
    "content": "On April 2, Hubei University asked students to submit a screenshot of their personal information on WeChat.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775112382051647982_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775113341570068775",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 18:49:35",
    "content": "On April 1, an old man at Ningbo Railway Station in Zhejiang Province smashed the wireless chargers on the seats in the waiting hall one by one.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1775113341570068775_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775113733326393451",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 18:51:08",
    "content": "On April 1, an announcement from Heilongjiang City's Nenjiang Province stated that due to factors such as adjustments to subsidy policies and rising oil prices, buses were experiencing operational difficulties and were unable to continue operating services. All bus owners decided to suspend operations of all Nenjiang city bus lines on April 8.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775113733326393451_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775113733326393451_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775114952170148340",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 18:55:59",
    "content": "On April 1, the Hunan Provincial Commission for Discipline Inspection and Supervision conducted anti-corruption education for the spouses of nearly 140 top leaders of provincial agencies, state-owned enterprises, and universities, which triggered ridicule in the comments section of netizens.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775114952170148340_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775114952170148340_1.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775114952170148340_2.jpg,",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1775114952170148340_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775117427631599787",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 19:05:49",
    "content": "On April 2, news emerged on social media that a policeman was posted every 10 meters on the Suzhou Bianhe Bridge to prevent citizens from mourning Li Keqiang during the Qingming Festival.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1775117427631599787_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775118907612844461",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 19:11:42",
    "content": "On April 2, in Zhengzhou, Henan, the developer of Yaxing Huancuiju Community deceived homebuyers into buying at the price of commercial housing in the name of resettlement housing, which caused dissatisfaction among the owners. On the same day, the owners came to the sales office to defend their rights. During the period, someone sprayed an unknown liquid on the owners who were defending their rights.\nThe video shows that the owners ran out with their noses covered, their faces flushed and coughing non-stop, and someone shouted \"something is sprayed inside\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1775118907612844461_0.jpg,/tweet/video/whyyoutouzhele/2024/04/02/1775118907612844461_1.jpg,/tweet/video/whyyoutouzhele/2024/04/02/1775118907612844461_2.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775121499273548157",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 19:22:00",
    "content": "April 2 evening, Xi'an streets",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775121499273548157_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775121499273548157_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775124355632034141",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 19:33:21",
    "content": "March 29, Zhengzhou, Henan. A family member posted a video saying that his daughter died when she was treated for heart disease at Henan Provincial People's Hospital because the hospital prescribed 10 times the dose of medicine. The family members first held banners outside the hospital to protest their rights, and then were forcibly carried away by security guards when they protested inside the hospital.\nOn April 2, the family members knelt outside the city government to protest their rights, and the staff on the side shouted \"Don't take pictures!\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1775124355632034141_0.jpg,/tweet/video/whyyoutouzhele/2024/04/02/1775124355632034141_1.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775124884613468350",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 19:35:27",
    "content": "On April 2, in Huadu District, Guangzhou, traffic police entered an electric vehicle store to check whether the electric vehicles on sale were in violation of regulations. The angry store owner put a knife to his neck and shouted, \"You want to kill me? Get out, get out!\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1775124884613468350_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775131233426550792",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 20:00:41",
    "content": "On April 1, the Sichuan Regulatory Bureau of the State Financial Supervision and Administration approved Sichuan Trust to enter bankruptcy procedures in accordance with the law.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775131233426550792_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775134992852463998",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 20:15:37",
    "content": "On April 2, the coal mining industry began to count and investigate influential accounts with more than 100,000 followers among people in the industry.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775134992852463998_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775139064095600715",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 20:31:48",
    "content": "On April 1, Xi'an Jiaotong University's official account pushed an article \"dissuading suicide\", but the article ridiculed suicide victims throughout the article, causing psychological discomfort and criticism from a large number of students.\nLater, the author responded in an apology, emphasizing that he was an active member of the party and was determined to become a member of the Communist Party. The original intention of making this article was to improve his personal work ability and contribute to the student department.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775139064095600715_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775139064095600715_1.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775139064095600715_2.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775139064095600715_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775142778680271201",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 20:46:33",
    "content": "On April 2, a property management company in a residential area in Fuqing City, Fujian Province, maliciously rammed into an owner. \nIt is reported that the cause was a dispute over parking fees, as the property management company charged the owner 100 yuan a day/1,500 yuan a month for parking. Tonight, the owners stopped the property management company to argue, and during the argument, an owner sat in front of the car to prevent the property management company from leaving, but the property management company accelerated and ran over them.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1775142778680271201_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775143587837096232",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 20:49:46",
    "content": "Follow-up\nJing County Culture and Tourism Bureau issued a situation report\nThe public security organ imposed administrative detention on one of the scenic area staff members who threw stones.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775143587837096232_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775148246962176346",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 21:08:17",
    "content": "On the evening of April 2, there was a suspected rights protection protest at the Community Party and Mass Service Center in Building A1, Zhanfeng Industrial Park, Hangcheng Industrial Zone, Xixiang Street, Bao'an District, Shenzhen. There were several people lying on the ground blocked by black security guards, and there was an ambulance next to them. One of the parties pointed at the uniformed people and shouted to the crowd watching nearby: Everyone come and see these scammers, you all have the right to see, don't be afraid...",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775148246962176346_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775148246962176346_1.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775148246962176346_2.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775148246962176346_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775157751481618758",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 21:46:03",
    "content": "On April 1, the well-known domestic band \"Huichundan\" was invited to Taiwan to participate in the \"Taiwan Festival\" music festival, but the performance was cancelled by the organizer because they mentioned \"Taiwan, China\" on Weibo.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775157751481618758_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775157751481618758_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775159901557260765",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 21:54:36",
    "content": "On April 1, the media reported that a member of the Municipal CPPCC was sentenced to 15 years in prison for driving a car and killing a NPC representative. In 2019, Liling Municipal NPC representative Liu was hit and killed by Chen, a member of the Liling Municipal CPPCC and the former village director of Tangfang Village, while mediating a dispute. In the first instance of the case, Chen was sentenced to death for intentional homicide. Later, the Hunan High Court ruled to revoke the original verdict and sent it back for retrial. During this period, Chen's family compensated Liu's family 6.5 million yuan and was forgiven.\nNetizens questioned where the village director got 6.5 million yuan. As of now, the media \"Headline News\" that reported this incident has removed this report on Weibo, and NetEase News has also removed this report. Zhejiang Traffic Voice has opened a selection of comments.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775159901557260765_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775159901557260765_1.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775159901557260765_2.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775159901557260765_3.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775160325148389804",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 21:56:17",
    "content": "April 1, Heze, Shandong. The Huapeng Linlongyin real estate project failed to deliver the houses on time, and the owners protested in front of the sales office and then marched to the government building to defend their rights.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1775160325148389804_0.jpg,/tweet/video/whyyoutouzhele/2024/04/02/1775160325148389804_1.jpg,/tweet/video/whyyoutouzhele/2024/04/02/1775160325148389804_2.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775163126264021194",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 22:07:24",
    "content": "It is reported that although the performance of \"Huichundan\" at the \"Taiwan Festival\" music festival on the 4th was cancelled, their tour in Taipei tonight will proceed normally. Some people held up the \"Taiwan Independence\" flag to protest at the performance site.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775163126264021194_0.jpg,/tweet/image/whyyoutouzhele/2024/04/02/1775163126264021194_1.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775164563903688784",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 22:13:07",
    "content": "April 2, Qingdao, Shandong. The Qingdao Children's Welfare Institute owed workers wages, and workers held banners outside the welfare institute to demand their wages.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/04/02/1775164563903688784_0.jpg,",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1775179068649927127",
    "name": "李老师不是你老师",
    "createdDate": "2024-04-02 23:10:45",
    "content": "Netizen contribution\nA university in Guangzhou instructs students to falsely report employment information\nThe actual salary of senior interns is only one or two thousand yuan, without social security and provident fund, but the school requires the average salary to be filled in to be no less than 5,000 yuan. If there are students who have not found a job, they must also falsely report a company and income.",
    "images": "/tweet/image/whyyoutouzhele/2024/04/02/1775179068649927127_0.jpg,",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]