[{"id":"1782444892066578821","name":"李老师不是你老师","createdDate":"2024-04-23 00:22:33","content":"On April 22, a netizen in Kunshan, Jiangsu Province posted that because her family's gas bill doubled, she wrote an article requesting a thorough investigation of Suzhou's gas problems.\nAfter the article was published, Kunshan China Resources Gas called her and asked her to delete the post, and arranged for four employees to come to her home for repairs and explanations accompanied by the community. At first, after the China Resources staff explained, she thought the matter was over. As a result, 20 minutes later, the police came to her home to conduct a home investigation in the name of anti-fraud. .","images":"/tweet/image/whyyoutouzhele/2024/04/23/1782444892066578821_0.jpg,/tweet/image/whyyoutouzhele/2024/04/23/1782444892066578821_1.jpg,/tweet/image/whyyoutouzhele/2024/04/23/1782444892066578821_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1782471963941736509","name":"李老师不是你老师","createdDate":"2024-04-23 02:10:07","content":"Don't forget","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1782537047355293821","name":"李老师不是你老师","createdDate":"2024-04-23 06:28:44","content":"Some netizens found that the company information page shows that China Resources Gas is registered in Bermuda.\nAt the same time, some Weibo posts and articles about China Resources Bermuda were no longer viewable.","images":"/tweet/image/whyyoutouzhele/2024/04/23/1782537047355293821_0.jpg,/tweet/image/whyyoutouzhele/2024/04/23/1782537047355293821_1.jpg,/tweet/image/whyyoutouzhele/2024/04/23/1782537047355293821_2.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1782752121592422455","name":"李老师不是你老师","createdDate":"2024-04-23 20:43:22","content":"\"I don't understand the law\"\nOn April 22, according to the \"China Agriculture and Rural Affairs News\", some town and village cadres in Kailu County, Inner Mongolia Autonomous Region, prevented farmers from going to the fields for spring ploughing. They had to pay for farming, but they had signed land contract contracts before.\nThe video shows that a deputy director of the Shuangsheng Village Committee of Jianhua Town, Kailu County, said when he stopped farmers from ploughing in the spring: \"What can 110 do? If the higher-ups ask me to collect money, I will collect money.\" There were also town cadres at the scene who stopped farmers from ploughing and strongly demanded that their cars be seized.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/23/1782752121592422455_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1782754061139255681","name":"李老师不是你老师","createdDate":"2024-04-23 20:51:04","content":"https://t.co/dCqGh70gBG","images":"/tweet/image/whyyoutouzhele/2024/04/23/1782754061139255681_0.jpg,","videos":"","hasPublished":true},{"id":"1782755316616012132","name":"李老师不是你老师","createdDate":"2024-04-23 20:56:04","content":"On April 23, the Cyberspace Administration of China announced the launch of a special campaign called \"Clear and Bright: Rectify the \"self-media\" that seeks traffic without bottom line\".\nKey rectifications\n1. Self-directed and self-acted fraud. Posting false information about domestic and foreign current affairs, social livelihood and other fields, deceiving the public by fraud and disrupting public order.\n2. Using any means to hype up social hot spots. Impersonating the parties, relatives or related personnel of hot events to publish information to attract the attention of netizens.","images":"/tweet/image/whyyoutouzhele/2024/04/23/1782755316616012132_0.jpg,/tweet/image/whyyoutouzhele/2024/04/23/1782755316616012132_1.jpg,","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1782779658418716993","name":"李老师不是你老师","createdDate":"2024-04-23 22:32:47","content":"On April 18, in the canteen kitchen of Guocun Campus of Shanxian No. 5 Middle School in Heze, Shandong Province, a canteen employee collected waste cooking oil next to the kitchen waste bin.\nStudents questioned and worried about the use of the oil, but the school denied the existence of this matter.\nIn addition, students revealed that there were no seats in the school's canteen, and everyone had to stand to eat every day.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/23/1782779658418716993_0.jpg,","hasFullContentTranslated":true,"hasPublished":true},{"id":"1782787613415309591","name":"李老师不是你老师","createdDate":"2024-04-23 23:04:24","content":"The incident of obstructing farmers from going to the fields for spring ploughing sparked public outrage\nOn April 23, under a video titled \"What is the human rights situation in China? The Chinese people have the most say\", nearly 50,000 netizens commented on \"Ji Yunhao\" (the deputy secretary of the town party committee who claimed \"I don't understand the law\" in the incident)","images":"","videos":"/tweet/video/whyyoutouzhele/2024/04/23/1782787613415309591_0.jpg,","hasFullContentTranslated":true,"hasPublished":true}]