[
  {
    "id": "1769042423982772513",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 00:45:55",
    "content": "Many books related to \"new quality productivity\" have been launched.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769042423982772513_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769055030647112000",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 01:36:01",
    "content": "On March 16, a fire broke out at Sinoway Industry and Trade Co., Ltd. in Zhuxi Industrial Zone, Huashui Town, Dongyang City, Jinhua City, Zhejiang Province, and several factory buildings were burned down.\nThe fire started at noon and spread from one factory building to the surrounding factories. Fire trucks from surrounding counties and cities continued to arrive for support, but the fire was not extinguished until 8 pm. It is currently unknown whether there were any casualties.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769055030647112000_0.jpg,/tweet/video/whyyoutouzhele/2024/03/17/1769055030647112000_1.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769146619948126276",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 07:39:58",
    "content": "On March 16, the Baogong Park Scenic Area in Hefei announced that it would suspend its opening due to internal construction.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769146619948126276_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769298911967981811",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 17:45:07",
    "content": "Netizens shared a peculiar paper: \"Regulating the body's material needs and desires by targeting intestinal flora is expected to improve the efficiency of building a clean government culture\"",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769298911967981811_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769299714397102269",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 17:48:18",
    "content": "On March 14, a resident intern at the Nanning First People's Hospital committed suicide. The news was banned, but medical students continued to forward it.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769299714397102269_0.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769299714397102269_1.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769299714397102269_2.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769299714397102269_3.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769301314452742348",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 17:54:40",
    "content": "March 16, Shenyang, Liaoning. A man carved \"Japan's national anthem\" in large characters on the wall of Torishima Park. He was stopped by surrounding citizens and called the police.\nOn the 17th, Bird Island Scenic Area stated that the police had intervened in the investigation. ",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769301314452742348_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769302063375106544",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 17:57:38",
    "content": "March 17 (Release) In Yangpu District, Shanghai, the owners of Yangpujiang No. 1 Community put up banners to protect their rights. They said that the quality of the houses was substandard after delivery, and the developer had false propaganda and rough construction.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769302063375106544_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769309431127253399",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 18:26:55",
    "content": "On March 17, the account of \"judicial corruption fighter abc\", who claimed to be a woman crying for injustice at Bao Gong Temple in Kaifeng, was banned.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769309431127253399_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769330547732500585",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 19:50:49",
    "content": "After the murder of three junior high school students in Handan, netizens questioned how the three junior high school students could dig a deep pit to bury the person. On March 17, a villager near Handan personally measured the depth of the pit and said that he was 1.8 meters tall and dug for five or six hours, but the pit was less than 2 meters.\nAfter the incident, reporters went to the scene and found that the pit where the teenager was buried in the vegetable greenhouse at the scene had been filled.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769330547732500585_0.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769330547732500585_1.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769330547732500585_2.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769330547732500585_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769330820370592170",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 19:51:54",
    "content": "March 16, Jingjiang, Jiangsu. A woman posted a video saying that her family was suspected of being poisoned while working at Jingjiang Gree Energy Equipment Co., Ltd. On the same day, she was sent to Jingjiang Chinese Medicine Hospital for rescue for thirteen hours. During this period, no doctor told the patient's condition, and several police officers blocked the door of the emergency room. The helpless woman knelt outside the emergency room for more than two hours, kneeling down with red and swollen knees.\nIn the early morning of the 17th, the woman posted another video saying \"I still didn't wait for the doctor, but so many police came.\" The video shows that a large number of police officers held hands to form a human wall to isolate the family members outside the hospital. The woman sighed, \"Where is justice, where is justice, is this the people not fighting against officials?\" Later, the woman said in the comment area, \"The hospital came and announced the death. Many police came. They should want to take the person to the funeral home.\" She also revealed that the person was robbed. Now the family members are arranged to go to the funeral home to wait for a reply.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769330820370592170_0.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769330820370592170_1.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769330820370592170_2.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769330820370592170_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769331109563699569",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 19:53:03",
    "content": "https://t.co/myulxclf2N",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769331109563699569_0.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769331109563699569_1.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769331109563699569_2.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769331109563699569_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1769333466858987997",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 20:02:25",
    "content": "Forgotten explosion\nOn March 16, a netizen from Xingtai, Hebei lamented that the results of the Yanjiao explosion came out in two days, but the explosion in Jinwan Mengdu Community, Renze District, Xingwan has not been found for a month. Now the family is gone, the mother and son are still in the hospital, and the medical expenses of millions of yuan have caused daily expenses to become a problem. No one answers the phone calls.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769333466858987997_0.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769333466858987997_1.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769333466858987997_2.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769333466858987997_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769342529659339220",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 20:38:26",
    "content": "On March 14, a bullying video from Mianping County, Liangshan, Sichuan Province suddenly attracted attention. The video showed several men and women holding knives and sticks beating and threatening a boy, during which the boy knelt down and begged for mercy.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769342529659339220_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769343105554170350",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 20:40:43",
    "content": "Mianning Public Security issued a notice: On the afternoon of March 14, 2024, a video of multiple people beating one person was circulated on the Internet, and our bureau quickly investigated the content involved in the video.\nAfter investigation, the content involved in the video was that during the Spring Festival this year (February 13), Wang Mouyuan (female, 14 years old) gathered many people in Heping Village, Shilong Town, and insulted and beat the victim Wang Moufeng (male, 13 years old) who lived there. Afterwards, the victim and his family did not call the police. At present, Wang Moufeng has been re-examined and re-examined in the hospital and is in good health. Our bureau has filed a case for investigation, the main persons involved in the case have been brought to justice, and the case investigation is being carried out in an orderly manner. The police remind: If you encounter illegal infringement, please call the police in time. At the same time, according to the relevant provisions of the \"Law of the People's Republic of China on the Protection of Minors\", please do not spread related audio, video and information. The public security organs will resolutely crack down on all kinds of illegal and criminal acts and do their utmost to protect the legitimate rights and interests of minors.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769343105554170350_0.jpg",
    "videos": "",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769343731755356370",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 20:43:13",
    "content": "Later, the victim's father said he had gone home to see the child.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769343731755356370_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769369758137241903",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 22:26:38",
    "content": "Recently, an incident occurred in Meizhou, Guangdong, where a suspected underage boy molested a girl on the street. In the video, the boy dragged a girl into the alley, and the girl kept crying for help.\nIn the video, the two were wearing the uniforms of Wuhua County Hedong Primary and Secondary School.",
    "images": "/tweet/image/whyyoutouzhele/2024/03/17/1769369758137241903_0.jpg,/tweet/image/whyyoutouzhele/2024/03/17/1769369758137241903_1.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769369758137241903_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  },
  {
    "id": "1769370494216568978",
    "name": "李老师不是你老师",
    "createdDate": "2024-03-17 22:29:33",
    "content": "On the evening of March 17, the father of the victim of the Handan junior high school student murder case started a live broadcast, and his lawyer was entrusted to introduce the current situation to the public.\nWhen talking about the fact that the family still cannot see the child's body, the live broadcast room was suddenly banned.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/03/17/1769370494216568978_0.jpg",
    "hasFullContentTranslated": true,
    "hasPublished": true
  }
]