[
  {
    "id": "1756439827103309924",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 06:07:42",
    "content": "@realTaoRay @iguangcheng @BobFu4China @Sasha_Gong @HeQinglian @Tianshuihanyan @DesmondShum @wangzhian8848 @ElaineYuMuMu @zhangboli198964 Happy New Year!",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1756631383496143325",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 18:48:53",
    "content": "Many friends are concerned about the New Year's Eve murder case in Ju County, Rizhao City, Shandong Province.\nAt present, I can confirm that: 1. Shooting occurred at the scene 2. Medical staff died.\nThe content of other screenshots circulated on the Internet needs further verification.",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1756634032572420142",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 18:59:24",
    "content": "Netizen added: Last night, someone appealed for justice for medical staff on social media platforms",
    "images": "/tweet/image/whyyoutouzhele/2024/02/11/1756634032572420142_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1756640040308949368",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 19:23:17",
    "content": "[18-year-old child was beaten to a bloody head for not wanting to pay New Year's greetings]\nFebruary 10, Hubei Enshi. A woman posted a video saying that her 18-year-old son was beaten to a bloody head by his ex-husband (the child's biological father) on the first day of the Lunar New Year because he did not want to pay New Year's greetings to his stepmother's house.\nThe woman said that her ex-husband was a teacher, and in order to avoid having a criminal record and delaying his work, she had no choice but to forgive him.\nOn the 11th, the local police station responded that the two sides had reached a settlement and criticized and educated the father.",
    "images": "/tweet/image/whyyoutouzhele/2024/02/11/1756640040308949368_0.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/11/1756640040308949368_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1756644839360266360",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 19:42:21",
    "content": "It was reported that Ren Zeping sent a New Year's greeting on Weibo at midnight on New Year's Eve, but the picture was suspected to be the \"Rising Sun Flag\", which aroused the dissatisfaction of many bloggers and netizens.\nRen Zeping then deleted the Weibo post in seconds and opened the selected comments",
    "images": "/tweet/image/whyyoutouzhele/2024/02/11/1756644839360266360_0.jpg,/tweet/image/whyyoutouzhele/2024/02/11/1756644839360266360_1.jpg,/tweet/image/whyyoutouzhele/2024/02/11/1756644839360266360_2.jpg,/tweet/image/whyyoutouzhele/2024/02/11/1756644839360266360_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1756660855737897057",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 20:45:59",
    "content": "On February 9, during the live broadcast of the Spring Festival Gala in Qing County, Cangzhou, Hebei, a large number of netizens continued to speak out for Zhang Xinwei, constantly spamming the screen with comments such as \"unjust\" and \"killing someone means paying for his life\".",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/11/1756660855737897057_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1756661510036660237",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 20:48:35",
    "content": "February 11 (Release) In Xinwu District, Wuxi, Jiangsu, dozens of migrant workers came to China Construction Eighth Engineering Bureau to ask for their wages, but they did not get their wages and were detained in the police station by the local police without having any food for the whole day.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/11/1756661510036660237_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1756679642843390235",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 22:00:39",
    "content": "\"Hidden in the dust\"\nOn February 11, a village party secretary posted a video to speak for rural elderly people and tell about the huge gap in life between urban elderly and rural elderly people.\nHe lamented that \"the countryside is now a past that can never be returned to and a future that cannot be seen. Children are all overwhelmed by medical care, education and housing. The rural population is losing and aging seriously. Where is the way out for the countryside?\"",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/02/11/1756679642843390235_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1756703140903051456",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 23:34:01",
    "content": "At present, some of the injured have been sent to Linyi Central Hospital in the neighboring Yishui County.\nMultiple sources said that there were more than ten injured and more than ten dead. The murderer had been in prison and committed the crime with his cellmates. Some of them had mental problems.\nThe murderer had a grudge against the dead and used a homemade cannon.",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1756703392741625975",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 23:35:01",
    "content": "Linyi Central Hospital in Yishui County is the largest hospital in the former Yimeng Special District, and is rated as a Class 3A hospital. Juxian County Hospital and Rizhao City Hospital are not as good as it.\nThis is also the reason why some of the injured were sent there.",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1756704044305784873",
    "name": "李老师不是你老师",
    "createdDate": "2024-02-11 23:37:36",
    "content": "In the north, \"Tu Pao\" refers to simple homemade firearms. Because it uses pyrotechnic powder to shoot out iron sand, it can be roughly classified as a type of shotgun.",
    "images": "",
    "videos": "",
    "hasPublished": true
  }
]