[
  {
    "id": "1751636259594781180",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 00:00:02",
    "content": "Later, Guangdong students added",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751636259594781180_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751637524760432900",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 00:05:04",
    "content": "Netizen contribution\nOn the roadside wall near the Provincial Stadium on Xi'an Metro Line 2, a poet named \"Lonely Sowing\" wrote a poem called \"My Rights\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751637524760432900_0.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751637524760432900_1.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751637524760432900_2.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751645768933417202",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 00:37:49",
    "content": "Some netizens added that they had seen it before",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751645768933417202_0.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751645768933417202_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751655868788039788",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 01:17:57",
    "content": "@torontobigface I understand. When their family can’t withdraw money and their house is demolished, they will know who is really willing to speak up for them. I will still submit my article.",
    "images": "",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751660135129170364",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 01:34:55",
    "content": "I've never seen this before:\nAs CCTV and the Central Military Commission's Political Work and Propaganda Bureau criticized patriotic celebrities, short skits satirizing patriotic celebrities have begun to appear inside the wall.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751660135129170364_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1751749268669440294",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 07:29:06",
    "content": "On January 28, Henan Village Bank depositors were sent to Qinglong Villa, where they were detained many times, as soon as they arrived at Zhengzhou East Station in the name of emergency drills. During this period, the depositors' family and friends called the police many times, but the local police did not respond. The following is the on-site recording sent by the depositors.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751749268669440294_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1751910016175518028",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 18:07:51",
    "content": "The scene of Henan Village Bank depositors being taken away at the high-speed railway station\nA large number of people wearing red vests, similar to those at Li Keqiang's memorial service, appeared at the scene, holding black umbrellas.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751910016175518028_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1751913160917807198",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 18:20:21",
    "content": "On January 29, Operation War Horse responded in an interview that what they did was recognized by the general public and did not need the evaluation of a few internet trolls.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751913160917807198_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751914598213546204",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 18:26:03",
    "content": "@triangle_404 Don't forget the subcutaneous account of the Central Military Commission Jun Zhengping",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751914598213546204_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751917956257231232",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 18:39:24",
    "content": "A company in Jiangsu offers a reward of 1 million yuan for clues of illegal and criminal activities of civil servants in Fuzhou.\nOn January 27, Jiangsu Yuantong Corrugated Pipe Co., Ltd. announced that it would publicly offer a reward of 1 million yuan for clues of illegal and criminal activities such as abuse of power, favoritism, corruption and bribery by Chen Xi, the captain of the Comprehensive Law Enforcement Brigade of the Market Supervision Bureau of Changle District, Fuzhou City.\nOn January 29, the Discipline Inspection and Supervision Commission of Changle District, Fuzhou City responded that it had been handed over to the functional departments for handling and was being handled according to procedures.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751917956257231232_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1751918482331971687",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 18:41:29",
    "content": "Netizens in the comment section are looking forward to \"everyone catching corrupt officials\"",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751918482331971687_0.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751918482331971687_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751919041583665559",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 18:43:43",
    "content": "https://t.co/KAkyIQWvMx",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751919041583665559_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751919702694051929",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 18:46:20",
    "content": "He is really an actor\nOn the 28th, a video of \"a 211 graduate secretly delivering food without telling his wife after being laid off\" sparked heated public discussion. The food delivery platform located a rider named \"Hu Mourong\" based on the screenshots of his income from running orders posted by the man, but Master Hu said that he was not the man in the video. He recalled that one day when he was running food, a man had taken a screenshot of his income from running orders on his mobile phone, but his final income when he got off work that day was 244 yuan.\nIt is reported that the man had said that January 22 was his last day of unemployment, but he registered as a rider on January 16. After verification, the food delivery platform found that the man had only run 2 orders since he registered as a rider. Master Hu, whose identity was stolen, said that he had contacted the other party afterwards. As of now, the man's Douyin account \"Fu Xiaoqi\" has been banned by the platform.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751919702694051929_0.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751919702694051929_1.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751919702694051929_2.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751922359697576128",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 18:56:54",
    "content": "On January 29, multiple media outlets reported that the Hong Kong court issued a winding-up order to China Evergrande Group. The court said that the winding-up may be accompanied by a change in management. After hearing arguments from both sides, the judge formally issued a winding-up order on the morning of the 29th. As soon as the news was announced, Evergrande's share price fell by 20.87%. Subsequently, similar companies also suspended trading, with Evergrande Auto's previous decline reaching 18% and Evergrande Property falling by 2.5%.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751922359697576128_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751923331446567300",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 19:00:46",
    "content": "On January 29, Hong Kong Satellite TV reported that Nicole Kidman's new movie contained an \"Occupy Central\" plot, and legislators questioned the Hong Kong government's lack of strict review.\nAs a result, the comment section was flooded with comments, and netizens said thank you for the recommendation and must watch it.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751923331446567300_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1751934432598950315",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 19:44:52",
    "content": "A blogger said that the country should thoroughly investigate the \"Sony China Insulting Case\", \"Li Ning China Insulting Case\" and \"Wang Gang Fried Rice Case\". If there is no \"hate-country business\" behind these three cases, then the whistleblowers at the time were also engaging in cyber violence and affecting the business environment, and should also bear corresponding legal responsibilities like the War Horse Operation.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751934432598950315_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751941946271015121",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 20:14:44",
    "content": "Just now, there was a loud noise in Songjiang, Shanghai",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751941946271015121_0.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751941946271015121_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751943791592772046",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 20:22:04",
    "content": "A Minhang netizen posted a video saying that the cat was startled by the shaking of the glass window",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751943791592772046_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1751944698057326767",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 20:25:40",
    "content": "On January 29, the Huangshi Intermediate People's Court of Hubei Province held a public trial of the bribery case of Chen Xuyuan, former deputy secretary of the Party Committee and chairman of the Chinese Football Association. The Huangshi People's Procuratorate accused: From 2010 to 2023, the defendant Chen Xuyuan used the convenience of his positions as president, chairman, head of the preparatory group for the change of leadership of the Chinese Football Association, and chairman of the Chinese Football Association, as well as the convenient conditions formed by his power and status, to provide assistance to relevant units and individuals in project contracting, investment and operation, and event arrangements, and illegally accepted property from others totaling more than RMB 81.03 million. The procuratorate requested that Chen Xuyuan be held criminally responsible for the crime of accepting bribes.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751944698057326767_0.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751945004728172576",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 20:26:53",
    "content": "The surveillance footage showed that the loud noise occurred at 19:24 in Songjiang, Shanghai.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751945004728172576_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1751958738716541302",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 21:21:27",
    "content": "Contribution summary\nXinghua middle schools also announced that students must study and take online classes at home every day according to school schedule during the holidays.\nOn the other hand, after Jiangsu middle schools went on vacation on time, some parents were still unwilling to let the school go on vacation for too long and decided to organize their own venues to open small classes.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751958738716541302_0.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751958738716541302_1.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751960472247562340",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 21:28:21",
    "content": "On January 29, a news report that \"a man was arrested 40 minutes after reporting a discipline inspection commission cadre\" once again attracted public attention. It is reported that on December 11, 2021, Zhang Quan from Hebi City, Henan Province, posted a video on social media through a friend, reporting in real name that Zhang Hui, general manager of a real estate company in Hebi City, bribed Ai Jun, then director of the Discipline Inspection Commission of Hebi City. Unexpectedly, only forty minutes after the video was released, the whistleblower and two other friends were taken away by the Hebi police, and then criminally detained on suspicion of \"false accusation and framing\". They were arrested by the Qibin District Procuratorate in less than 48 hours. The local police and prosecutors seamlessly connected the judicial process at an incredible speed.\nAfter the case occurred, public opinion across the country paid close attention. Just as the Hebi police and prosecutors worked closely together to transfer the case to the trial organ at an astonishing speed and were preparing to advance the judicial process at an astonishing speed, the Supreme People's Procuratorate paid attention and intervened.\nOne year after the Henan Provincial Procuratorate intervened and supervised the case, the three whistleblowers were acquitted and released and restored their freedom.\nAfter more than a year of investigation, on February 21, 2023, the Qibin District Public Security Bureau of Hebi City withdrew the review and prosecution of Niu Mou, and the Qibin District Procuratorate of Hebi City made a decision not to prosecute Zhang Mouquan and Yang Moubin. However, the person reported, Ai Moujun, still cannot be ruled out as a suspect of involvement in the case.\nHowever, unexpectedly, just as the Commission for Discipline Inspection was high-profile in its propaganda department's \"no tolerance, serious investigation,\" for the person reported, the then-commissioned cadre who was reported for taking bribes was unexpectedly elected as the director of the local mountainous urban area people's congress until now. According to insiders, one of the people reported, Ai Moujun, and Xu Guang, the vice governor of Henan Province who has been dismissed, are in a \"carrying\" relationship (Ai Mou's wife and Xu Guang's wife are sisters)\nThe results of further investigation by the local police showed that the financial accounts of the wife and relatives of the person reported (both local department-level cadres) had tens of millions of funds flowing in and out of the accounts. After the local police suspected that this official's illegal clues were discovered, they did not transfer them to the local Commission for Discipline Inspection and Supervision within two years. Fan Chen, the attorney for the case, submitted the illegal clues to the Hebi Municipal Commission for Discipline Inspection. Nearly two years have passed, and he still has not received the investigation results of the relevant departments.\nAt present, multiple departments in Henan Province are conducting a full-scale investigation into this major incident of cracking down on whistleblowers.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751960472247562340_0.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751960472247562340_1.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751960472247562340_2.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751960472247562340_3.jpg",
    "videos": "",
    "hasPublished": true
  },
  {
    "id": "1751961926035218795",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 21:34:07",
    "content": "January 28, Guizhou. A man posted a video saying that he bought a bus ticket from Suzhou to Yunnan, but when he arrived at the Guiyang service area, the bus driver actually left them behind and drove away. The man also said that the Guiyang traffic police at the scene asked the passengers to take the train instead. They said that their bus tickets were not purchased through formal channels and were not guaranteed.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751961926035218795_0.jpg",
    "hasPublished": true
  },
  {
    "id": "1751965261001863272",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 21:47:22",
    "content": "According to the photos and videos circulating online, the cause of the loud noise may be an explosion in an experiment at Blue Arrow Aerospace, which injured three people.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751965261001863272_0.jpg,/tweet/image/whyyoutouzhele/2024/01/29/1751965261001863272_1.jpg",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751965261001863272_0.jpg",
    "hasPublished": false
  },
  {
    "id": "1751965698278998151",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 21:49:07",
    "content": "Another big V said that he verified it with official authorities, who admitted that it was an experiment and the noise was a bit loud, but denied that there were any casualties or explosion.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751965698278998151_0.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1751979459777822955",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 22:43:48",
    "content": "At present, the Emergency Management Bureau of Songjiang District, Shanghai stated that no explosion occurred in Songjiang District and the district government will give a unified explanation.",
    "images": "/tweet/image/whyyoutouzhele/2024/01/29/1751979459777822955_0.jpg",
    "videos": "",
    "hasPublished": false
  },
  {
    "id": "1751989688993222877",
    "name": "李老师不是你老师",
    "createdDate": "2024-01-29 23:24:26",
    "content": "Netizen contribution\nAt Eason Chan's Guangzhou concert in early January, a fan held up a banner (usually to request a song or express his love for the singer), which immediately attracted a large number of security personnel to come from all directions and take the banner away.",
    "images": "",
    "videos": "/tweet/video/whyyoutouzhele/2024/01/29/1751989688993222877_0.jpg",
    "hasPublished": false
  }
]