[{"id":"1761784067513540748","name":"李老师不是你老师","createdDate":"2024-02-26 00:03:48","content":"On February 25, another battery-powered vehicle spontaneous combustion accident occurred in Daishan, Nanjing","images":"/tweet/image/whyyoutouzhele/2024/02/26/1761784067513540748_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1761784067513540748_1.jpg","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1761784067513540748_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1761784535627300949","name":"李老师不是你老师","createdDate":"2024-02-26 00:05:40","content":"February 24. People protesting their rights outside the Supreme Court of Beijing. The woman who took the photo said, \"You have to come to eat.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1761784535627300949_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1761906232422433259","name":"李老师不是你老师","createdDate":"2024-02-26 08:09:15","content":"February 23, Zhengzhou, Henan.\nA girl wandered around the city center holding a sign that read \"I have nothing to say.\"\nThe live broadcast room was then banned","images":"/tweet/image/whyyoutouzhele/2024/02/26/1761906232422433259_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1761906232422433259_1.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1761906232422433259_2.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1761906232422433259_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762057231854342569","name":"李老师不是你老师","createdDate":"2024-02-26 18:09:16","content":"On February 26, the China Film Archive released its 2024 recruitment brochure. Some netizens discovered that all key positions related to film promotion and planning require party membership.","images":"/tweet/image/whyyoutouzhele/2024/02/26/1762057231854342569_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762057231854342569_1.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762061909388304507","name":"李老师不是你老师","createdDate":"2024-02-26 18:27:51","content":"On February 24, a high-priced game called \"VR Long March\" attracted the attention of many players. The video shows that you only need to wear VR glasses to immerse yourself in the difficult journey and story of the Red Army.\nThe game is priced at 1,500 yuan on the Steam interface, while the current mainstream 3A game is priced at about 300 yuan. However, as can be seen from the video, the game's poor performance is shameful.\nAccording to players in the Steam comment area, the game content is only five minutes, and there is no so-called Red Army crossing the snow-capped mountains, flying over Luding Bridge and the first National Congress of the Communist Party of China. After completing a few questions and answers, there is no content and the gray screen ends... In short, it is a pile of shit. There are also comments that this type of game should be used exclusively for VR party building platforms.\nAfter searching, it was found that many companies provide VR party building and integrity training equipment, as well as software development and customization.\nA company that provides this service, \"Xiyuan Science...","images":"/tweet/image/whyyoutouzhele/2024/02/26/1762061909388304507_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762061909388304507_1.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762061909388304507_2.jpg","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1762061909388304507_0.jpg","hasFullContentTranslated":false,"fullContent":"2月24日，一款名为《VR长征》的天价游戏吸引广大玩家注意，视频显示，只需要戴上VR眼镜就可以沉浸式感受当年红军艰难的征程和故事。\n该游戏在Steam界面的售价为1500元人民币，目前主流3A游戏大作的售价约为300元左右。但是从视频可以看出，该游戏粗劣的表现力令人汗颜。\n根据Steam评论区玩家表示，游戏内容就五分钟，没有宣传的所谓红军过雪山，飞夺泸定桥和中共一大等内容，在完成了几道问答题之后就没有内容灰屏结束了...总而言之就是一坨屎。也有评论表示这类游戏应该是专供VR党建平台使用的。\n通过检索后发现，有不少企业都提供VR党建廉政培训设备，以及软件的开发和定制。\n 一家提供此服务的“西缘科技”其官网显示，搭建一套党建VR系统的费用包括软件开发成本、硬件设备成本、内容制作成本、维护和更新成本，价格大约为几万元到十万元不等。","hasPublished":false},{"id":"1762062651885019221","name":"李老师不是你老师","createdDate":"2024-02-26 18:30:48","content":"On February 24, a fire broke out in Nanjing Mingshang Xiyuan Community, killing 15 and injuring 44.\nRecently, many places across the country have urgently issued notices to conduct centralized inspections of safety hazards of electric bicycles.","images":"/tweet/image/whyyoutouzhele/2024/02/26/1762062651885019221_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762062651885019221_1.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762062651885019221_2.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762062651885019221_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762063997518373149","name":"李老师不是你老师","createdDate":"2024-02-26 18:36:09","content":"On February 25, a Weibo influencer wrote about the fire in a residential complex in Nanjing, saying, \"Many comments said that the property management company has no law enforcement power and should not be blamed. Why was it that during the epidemic, the security guards were able to control the entrance so tightly that it was impossible for you to go out or come in? Try not taking a nucleic acid test two years ago. When it came time to ask them to control the upstairs use of electric vehicles and regulate their storage, they had this argument.\"","images":"/tweet/image/whyyoutouzhele/2024/02/26/1762063997518373149_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762063997518373149_1.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762066720322167275","name":"李老师不是你老师","createdDate":"2024-02-26 18:46:58","content":"Female entrepreneur was criminally detained for asking for project payment, and the government was only willing to give 12 million yuan for a debt of over 100 million yuan. There is still no news about the lawyer who lost contact\nAccording to China Business News, ethnic minority female entrepreneur Ma Yigai has been asking for project payment for 8 years after building 10 government projects in Liupanshui, Guizhou.\nIn December last year, Hou Zhitao, the lawyer in this case, sent a video for help. In the video, he said that when everyone saw this video, he might have been persecuted and sacrificed by the Liupanshui government of Guizhou. After checking Hou Zhitao's Weibo, it was found that his latest Weibo celebrating his birthday was automatically posted by the system on February 10. Many people left messages in the comment area of Hou Zhitao's Weibo, asking about his recent situation.\nAt the end of 2023, on the day of the hearing of the Guizhou Provincial Higher People's Court, Ma Yigai was criminally detained by the local public security for suspected provocation. Before her, more than 10 lawyers, lawyer assistants, etc. who acted as debt execution agents for her had been criminally detained...","images":"/tweet/image/whyyoutouzhele/2024/02/26/1762066720322167275_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762066720322167275_1.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762066720322167275_2.jpg","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1762066720322167275_0.jpg","hasFullContentTranslated":false,"fullContent":"女企业家讨工程款被刑事拘留，过亿债务政府只愿给1200万。代理律师失联至今仍无消息\n据中国经营报报道，少数民族女企业家马艺珈伊，为贵州六盘水城建10个政府项目后，持续讨要工程款长达8年。\n去年12月，此案律师候志涛曾发视频求助，他在视频中表示，当大家看到这个视频的时候，自己有可能已经遭到贵州六盘水政府的迫害而牺牲。查看候志涛的微博后发现，其最新一条庆祝生日的微博是系统于2月10日自动发布的。不少人在候志涛的微博评论区留言，询问其近况。\n2023年年末，在贵州省高级人民法院听证会召开当天，马艺珈伊被地方公安以涉嫌寻衅滋事罪刑事拘留。而在她之前，为她代理债务执行的律师、律师助理等10余人已被刑事拘留，涉嫌罪名均为寻衅滋事罪。\n 据部分公开材料显示，六盘水市水城区政府共欠企业约2.2亿元。而地方政府一份文件则承认有9000余万元欠款。\n 经多方证实，马艺珈伊等人被抓前，区政府一度提出以1200万元化解所有债务，被她和代理律师拒绝，随即案发。据媒体报道，马艺珈伊承办的项目之一：鞭驼小镇及世界鞭坨文化博物馆批复于2016年，当时的六盘水市委书记李在勇，2023年涉嫌严重违纪违法被中央纪委调查。","hasPublished":false},{"id":"1762091725391061324","name":"李老师不是你老师","createdDate":"2024-02-26 20:26:20","content":"Recently, a large number of JD.com deliverymen have reported the issue of JD.com's salary cuts in the internal forum.\nOne employee said, \"The company has already adjusted the delivery fee from 1.5 yuan to 1.3 yuan a few days ago.\"\nAnother employee said, \"Front-line employees are already very hard-working, working in the wind and rain. If you want to cut your salary, at least give a suitable reason.\"","images":"/tweet/image/whyyoutouzhele/2024/02/26/1762091725391061324_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762091725391061324_1.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762091725391061324_2.jpg","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1762091725391061324_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762097775381033068","name":"李老师不是你老师","createdDate":"2024-02-26 20:50:22","content":"On February 26, a video titled \"The Ministry of Commerce accuses the United States of denying China's achievements in its WTO membership commitments\" was mocked by netizens. Netizens asked whether they dared to make the content of the commitments public.","images":"/tweet/image/whyyoutouzhele/2024/02/26/1762097775381033068_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762097775381033068_1.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762097775381033068_2.jpg","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1762097775381033068_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762098533237133413","name":"李老师不是你老师","createdDate":"2024-02-26 20:53:23","content":"On February 25, a courier sorter posted a video exposing that the Fuzhou Zhongtong Express sorting center withheld employees' wages and exploited labor. One person was assigned to work on four production lines during the overnight shift, and all of them were large items, which was too busy to handle, while some employees had nothing to do. Because he was too tired, he went to his supervisor for coordination but was told to find a labor service, but the labor service said to find an intermediary.\nLater, the labor service told him that because he filmed the video, all his wages were deducted, and this incident caused heated discussions among netizens.\nOn February 26. The blogger posted another video saying that after the video attracted attention, the Zhongtong headquarters, the boss of the intermediary company, and the female supervisor involved called him and paid his salary at 9 a.m.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1762098533237133413_0.jpg,/tweet/video/whyyoutouzhele/2024/02/26/1762098533237133413_1.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762101812968968399","name":"李老师不是你老师","createdDate":"2024-02-26 21:06:25","content":"On February 26, a woman posted a video saying, \"I want to report in real name that the police officers of Panlongcheng Economic Development Zone Police Station in Huangpo District, Wuhan City, Hubei Province raped underage girls, accepted bribes and beat people. If it is a fabricated accusation, I am willing to bear legal responsibility.\" She also said that she had called the police before, but no one cared. In response, the local police station said: It is a rumor and the higher authorities will deal with it.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1762101812968968399_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762101971018727515","name":"李老师不是你老师","createdDate":"2024-02-26 21:07:02","content":"February 26, Sichuan. A truck driver posted a video saying that Zong Qinghou, the founder of Wahaha Group, had passed away, but the freight he was owed had not been settled yet, and the problem had not been solved after he complained. He said he was not sad at all about Zong Qinghou's death, \"Although your company has contributed a lot of tax revenue to the country, the logistics companies under you owe us drivers a lot of hard-earned money.\"","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1762101971018727515_0.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762112199139397775","name":"李老师不是你老师","createdDate":"2024-02-26 21:47:41","content":"On February 26, a smoke duct exploded in Building 9 of Phase II of Guanxi County, Xinchang Street, Jingdezhen. No casualties were reported.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1762112199139397775_0.jpg,/tweet/video/whyyoutouzhele/2024/02/26/1762112199139397775_1.jpg,/tweet/video/whyyoutouzhele/2024/02/26/1762112199139397775_2.jpg","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762126572545253386","name":"李老师不是你老师","createdDate":"2024-02-26 22:44:48","content":"The 80-page report mentioned that when foreign companies offend China, China will retaliate against them, especially foreign companies operating in China.\nThe Chinese government is increasingly inclined to use threats or measures that affect trade and investment to force other governments to compromise in order to achieve political goals.\nChina's labor system is not fair, for example: forced labor, restrictions on labor mobility, restrictions on wages being freely negotiated by labor and management, deprivation of workers' rights to association, organization and collective bargaining, and prohibition of the formation of independent unions representing workers.\nThe report also mentioned that the Five Eyes Alliance stated in public speeches that the Chinese government's theft of technology from other countries is unprecedented and involves multiple fields, from aviation biotechnology to computers and other industries.","images":"/tweet/image/whyyoutouzhele/2024/02/26/1762126572545253386_0.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762126572545253386_1.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762126572545253386_2.jpg,/tweet/image/whyyoutouzhele/2024/02/26/1762126572545253386_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1762134659960394099","name":"李老师不是你老师","createdDate":"2024-02-26 23:16:56","content":"February 26, Handan, Hebei. Zhongliang Yanlan Fenghua project owes workers wages, and workers gathered at the sales office with banners to demand wages.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/26/1762134659960394099_0.jpg","hasFullContentTranslated":true,"hasPublished":false}]