[{"id":"1762631152483864894","name":"李老师不是你老师","createdDate":"2024-02-28 08:09:49","content":"If you see conspiracy theorists posting this kind of pictures next time, please help me clarify it.","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762632505801249074","name":"李老师不是你老师","createdDate":"2024-02-28 08:15:12","content":"Primary school students take to the streets","images":"","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762764706756862300","name":"李老师不是你老师","createdDate":"2024-02-28 17:00:31","content":"Poly Langyue Xuzhang Community, Jiangbei District, Ningbo City\nDue to excessive price cuts, the owners organized to go to the sales office to defend their rights and demand to cancel their contracts","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/28/1762764706756862300_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762779713532010843","name":"李老师不是你老师","createdDate":"2024-02-28 18:00:09","content":"On February 28, Jiangsu Xuzhou Yueyin Guangbo Art School was suspected of bankruptcy. It was originally scheduled to start school on February 24, but there has been no news so far. When the students returned to school, they found that the principal had secretly rented out the dormitory during the winter vacation, and now it is a mess. It is reported that when enrolled, the school claimed to be a 3+2 junior college. Three years later, the students were told that the school was an adult junior college and they needed to pay a 4,800 yuan introduction fee for two years of internship. The students said that they only got a technical secondary school diploma issued by Nanjing Railway Vocational and Technical College. At present, the students are organizing rights protection.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/28/1762779713532010843_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762780932543513032","name":"李老师不是你老师","createdDate":"2024-02-28 18:04:59","content":"On February 28, near Tianhui Department Store in Panyu District, Guangzhou, an elderly man defended his pension rights.","images":"/tweet/image/whyyoutouzhele/2024/02/28/1762780932543513032_0.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762780932543513032_1.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762780932543513032_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762783884796657831","name":"李老师不是你老师","createdDate":"2024-02-28 18:16:43","content":"A public primary school in Tianhe District, Guangzhou, requires students to \"voluntarily\" purchase a newspaper sponsored by the Guangzhou Education Research Institute at a price of 75 yuan per semester.","images":"/tweet/image/whyyoutouzhele/2024/02/28/1762783884796657831_0.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762783884796657831_1.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762783884796657831_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762787218010014072","name":"李老师不是你老师","createdDate":"2024-02-28 18:29:58","content":"The giant baby phenomenon in colleges and universities:\nIt is reported that the computer science and computer science class 2 of Three Gorges University suddenly checked the games on students' mobile phones because a student's parent wrote a long article in the parent group that day.\n(It turns out that universities also have parent groups)","images":"/tweet/image/whyyoutouzhele/2024/02/28/1762787218010014072_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762790348944781714","name":"李老师不是你老师","createdDate":"2024-02-28 18:42:24","content":"February 26, Guangdong. A netizen said that when she passed by a Haidilao store, she found that employees were being physically punished. After the post was published, it sparked heated discussions among netizens, and a large number of netizens left comments in the comment area to tell about their experiences of being physically punished in Haidilao or other companies.","images":"/tweet/image/whyyoutouzhele/2024/02/28/1762790348944781714_0.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762790348944781714_1.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762790348944781714_2.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762790348944781714_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762791996576403944","name":"李老师不是你老师","createdDate":"2024-02-28 18:48:57","content":"Afterwards, netizens said that they would not delete the post. This was the voice of students for students and also the voice of workers.","images":"/tweet/image/whyyoutouzhele/2024/02/28/1762791996576403944_0.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762794996170657970","name":"李老师不是你老师","createdDate":"2024-02-28 19:00:52","content":"February 28, Shanxi. A woman posted on Douyin that her sister was killed by her grandfather, but her uncle wanted to use her sister's body for a ghost marriage. And she has not seen her sister's body since the incident, but her uncle and others who are not direct relatives can see her body.\nThe woman also said that before, her relatives had asked her sister and mother to use the car accident insurance money to buy insurance for her to boost her performance.\nAs of now, the work posted by the woman on Douyin has been removed from the platform.","images":"/tweet/image/whyyoutouzhele/2024/02/28/1762794996170657970_0.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762794996170657970_1.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762794996170657970_2.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762794996170657970_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762795313671106576","name":"李老师不是你老师","createdDate":"2024-02-28 19:02:08","content":"The chat records released by the woman","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/28/1762795313671106576_0.jpg","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762802100956721543","name":"李老师不是你老师","createdDate":"2024-02-28 19:29:06","content":"Actionist\nOn February 27, a famous patriotic V said that he would sue Mo Yan for allegedly violating the Heroes and Martyrs Law.\nHu Xijin then published a long article to denounce his self-promotion\nOn the 28th, the blogger announced that he would sue Hu Xijin.","images":"/tweet/image/whyyoutouzhele/2024/02/28/1762802100956721543_0.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762802100956721543_1.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762802100956721543_2.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762802100956721543_3.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true},{"id":"1762831408798609683","name":"李老师不是你老师","createdDate":"2024-02-28 21:25:34","content":"On February 28, it was reported online that a junior high school student in Qingyuan, Guangdong, fell to his death in Zhouxin No. 1 Middle School. The school concealed the truth, and the family burned paper money outside the school to defend their rights.\nAccording to the mother of the student who fell to his death, her daughter Li Ruihan, who was studying in Class 3, Grade 9 of Zhouxin No. 1 Middle School, entered the school at 19:04 on February 25 and fell to her death from the 5th floor of the teaching building at 19:12.\nThe mother of the deceased said that the school knew that the child had fallen to his death, but did not notify the parents at the first time. It was not until 19:28 that the parents were informed by phone that the student had not returned to school, and the fact that the student had fallen to his death was concealed. She came to the school to check when she found something wrong. After arriving at the school, she found that the police had been handling the matter at the school, and the school prohibited her from entering the school. During this period, she kept calling the head teacher, but she could not get through. After she insisted on asking many times, the school agreed to let her enter the school. When the mother came downstairs of the teaching building, she saw her daughter lying coldly on the ground.\nAn online person who claimed to be a student of the school...","images":"","videos":"/tweet/video/whyyoutouzhele/2024/02/28/1762831408798609683_0.jpg","hasFullContentTranslated":false,"fullContent":"2月28日，网传广东清远一名初三学生在洲心第一中学坠亡，学校隐瞒真相，家属在校外烧纸钱维权。\n据坠亡学生母亲称，她的女儿李睿涵，就读于洲心第一中学九年级三班，2月25日19时04分进入学校，于19时12分从教学楼5楼坠亡。\n死者母亲表示，校方明知孩子已经坠亡，却没有在第一时间通知家长，直到19时28分才电话告之家长学生没有回学校，隐瞒了学生已坠亡的事实。她察觉不对便来到学校查看，来到学校后发现警察已在学校处理，并且校方禁止她进入学校，期间不断拨打班主任电话，但一直未能拨通。在她多次执意要求下，校方才同意让其进入学校。当母亲来到教学楼楼下时，才看到女儿冷冰冰地躺在地上。\n 一名自称是该校学生的网友留言称：校方没收了拍摄该事件学生的手机并销毁，还威胁知情学生。不仅如此，校方还将此事定为意外坠楼。","hasPublished":true},{"id":"1762831524729106833","name":"李老师不是你老师","createdDate":"2024-02-28 21:26:01","content":"https://t.co/R3bjfAj08O","images":"/tweet/image/whyyoutouzhele/2024/02/28/1762831524729106833_0.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762831524729106833_1.jpg","videos":"","hasPublished":true},{"id":"1762833072943247420","name":"李老师不是你老师","createdDate":"2024-02-28 21:32:11","content":"On February 27, the Guizhou Provincial Party Committee and the Provincial Government held a provincial conference on high-quality development of the private economy and the construction of a business environment, stating that leaders at all levels should take contact and service to private enterprises as their duty. Strictly honor government commitments, comprehensively clear overdue accounts owed to enterprises, effectively reduce the production and operation costs of private enterprises, and serve as a \"shop assistant\" for enterprises. However, a large number of Guizhou netizens reported in the comment area that they were owed project funds and wages.","images":"/tweet/image/whyyoutouzhele/2024/02/28/1762833072943247420_0.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762833072943247420_1.jpg,/tweet/image/whyyoutouzhele/2024/02/28/1762833072943247420_2.jpg","videos":"","hasFullContentTranslated":true,"hasPublished":true}]