[{"id":"1746208568498327930","name":"李老师不是你老师","createdDate":"2024-01-14 00:32:20","content":"Because the Taiwan Affairs Office's statement that \"Taiwan's election results cannot represent mainstream public opinion\" was too outrageous, neither the \"little pinks\" nor the \"anti-thieves\" agreed with this statement, causing tonight's Weibo Night to become a \"rush to the tower night.\"\nNetizens directly said, \"2950 I will be submissive, 40% I will hit hard.\"","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746208568498327930_0.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746208568498327930_1.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746208568498327930_2.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746208568498327930_3.jpg","videos":"","hasPublished":true},{"id":"1746235770887692415","name":"李老师不是你老师","createdDate":"2024-01-14 02:20:25","content":"Correction: It should be \"Taiwan election results show that the Democratic Progressive Party does not represent mainstream public opinion\", I was misled by the comments in the picture\nBy the way, update the comments on the tower","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746235770887692415_0.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746235770887692415_1.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746235770887692415_2.jpg","videos":"","hasPublished":true},{"id":"1746237667761688709","name":"李老师不是你老师","createdDate":"2024-01-14 02:27:58","content":"Currently, the topic of \"Taiwan Election\" on Weibo has been banned.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746237667761688709_0.jpg","videos":"","hasPublished":true},{"id":"1746259926781960561","name":"李老师不是你老师","createdDate":"2024-01-14 03:56:25","content":"The 2024 Foreign Ministry spokesperson answered reporters' questions about Taiwan's elections. It was roughly the same as in 2020, with slight changes.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746259926781960561_0.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746259926781960561_1.jpg","videos":"","hasPublished":true},{"id":"1746260586940289296","name":"李老师不是你老师","createdDate":"2024-01-14 03:59:02","content":"At the same time, netizens discovered that in the Taiwan election results released by Xinhua News Agency, \"leader\" was used instead of \"president\", and \"representatives of the people\" was used instead of \"legislators\"; \"Democratic Progressive Party\" was abbreviated as \"DPP\", while \"KMT\" and \"Taiwan People's Party\" used their full names.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746260586940289296_0.jpg","videos":"","hasPublished":true},{"id":"1746313229561737713","name":"李老师不是你老师","createdDate":"2024-01-14 07:28:13","content":"By the way, now that the election is over, let me add a follow-up. The party recommended by the subdistrict office is the Kuomintang. At the same time, it says that choosing the Democratic Progressive Party is choosing turmoil.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746313229561737713_0.jpg","videos":"","hasPublished":true},{"id":"1746315121436037517","name":"李老师不是你老师","createdDate":"2024-01-14 07:35:44","content":"On January 10, a Tibetan internet celebrity named \"Zhuoma under the Snow Mountain\" was questioned by fans and netizens for using an Apple phone during a live broadcast.\nZhuoma posted a video explaining that the reason why Tibetans like to use Apple phones is because Apple's input method comes with Tibetan input method, which is more convenient to use.\nAfter the video was released, some netizens expressed their support, but they were also bombarded by netizens, asking why they didn't learn Chinese and type Chinese characters, but had to use Tibetan? They also questioned whether Apple's poor signal was an excuse.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/14/1746315121436037517_0.jpg","hasPublished":true},{"id":"1746317217627562195","name":"李老师不是你老师","createdDate":"2024-01-14 07:44:04","content":"Netizen contribution\nXi Jinping's books are also placed at the entrance of Hong Kong bookstores","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746317217627562195_0.jpg","videos":"","hasPublished":true},{"id":"1746461922503925978","name":"李老师不是你老师","createdDate":"2024-01-14 17:19:04","content":"Netizens added that the same is true in Macau","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746461922503925978_0.jpg","videos":"","hasPublished":true},{"id":"1746464540810752445","name":"李老师不是你老师","createdDate":"2024-01-14 17:29:28","content":"On January 14, a fire broke out near the Party and Mass Service Center of Shanghe Nan Community in Luanchuan County, Luoyang City.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/14/1746464540810752445_0.jpg","hasPublished":true},{"id":"1746466409981354295","name":"李老师不是你老师","createdDate":"2024-01-14 17:36:54","content":"\"Love has nothing to do with gender\"\nJanuary 13, Taiyuan Grand Theater. After the performance, Jin Xing showed the rainbow flag to the audience on stage.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/14/1746466409981354295_0.jpg","hasPublished":true},{"id":"1746468902140358958","name":"李老师不是你老师","createdDate":"2024-01-14 17:46:48","content":"On January 14, Caixin once again released a special feature on Xinjiang police torture. The article mentioned that Ren Tingting, who lives in Xinjiang and is over 50 years old, has a husband who is a senior local policeman and later died in the line of duty. Her only son, Sun Renze, was criminally detained on March 27, 2018 for suspected provocation.\nWhile Sun Renze was detained in the Huocheng County Detention Center in Yili Prefecture, he was tortured by the police, including: carrying a stool, tying up, smearing mustard, pulling leg hair with tape, electric shock with old-fashioned telephones, hanging heavy objects on the genitals, and applying hot water on the face with towels.\nIn the early morning of September 27, 2018, Sun Renze fell into a coma after being interrogated by police officers for more than seven hours in the Huocheng County Detention Center, and then transferred to the ICU of several hospitals. On November 9, Sun Renze, who had not been able to wake up, finally died at the age of less than 31.\nThe police said that Sun Renze was choked and fell into a coma when he asked for water during the interrogation, and the interrogators were not responsible. But Ren Tingting was dissatisfied with the result of the interrogation when she saw her son seriously injured and in a coma. Five years later, she ran around under pressure to uncover the truth. On November 6, 2023, the Kuitun City Court of Yili Prefecture sentenced eight police officers to 3 to 13 years in prison for intentional injury in the first instance.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746468902140358958_0.jpg","videos":"","hasPublished":true},{"id":"1746468950911668635","name":"李老师不是你老师","createdDate":"2024-01-14 17:47:00","content":"Full text\n","images":"","videos":"","hasPublished":true},{"id":"1746471428155756838","name":"李老师不是你老师","createdDate":"2024-01-14 17:56:50","content":"Netizen contribution\nRecently, a video circulated online showed that a police officer from the Beijing Public Security Bureau suddenly broke into a gathering of Peking University law professors and wanted to take one of the professors for a talk. As a result, he was rebuked by the professors.\nThe professors questioned his non-standard law enforcement and lack of procedures, and angrily scolded: We are all playing this... Don't be so arrogant... Don't try this on us.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/14/1746471428155756838_0.jpg","hasPublished":true},{"id":"1746472214453514636","name":"李老师不是你老师","createdDate":"2024-01-14 17:59:58","content":"January 14, one hour ago.\nAt the entrance of the Garden of China Resources City Runxi Phase 1, the police arrested the owners who went to Mixc to defend their rights and dragged a 60-year-old female owner into the car","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/14/1746472214453514636_0.jpg","hasPublished":true},{"id":"1746474754368770464","name":"李老师不是你老师","createdDate":"2024-01-14 18:10:04","content":"On January 13, Baoding, Hebei. A netizen posted a video saying that when he and his friends were camping near a reservoir in Bailong Township, Mancheng District, Baoding City, Hebei Province, they encountered villagers who asked for 100 yuan, but the two sides did not reach an agreement on the fee. Then the villagers called a manure truck to irrigate the land and cut off the road.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/14/1746474754368770464_0.jpg","hasPublished":true},{"id":"1746476256802050286","name":"李老师不是你老师","createdDate":"2024-01-14 18:16:02","content":"The most active person who implemented these methods was the youngest police officer. He was not only perverted, but also excited. Reporter Wang Heyan’s description is very vivid:\nAlmost all the defendants alleged that Liu Xianyong, the youngest and first to participate in the criminal investigation team, was the most excited and active among the eight defendants, and had the most \"abnormal\" methods of extorting confessions. They said that during the interrogation, Liu Xianyong either used tape to pluck Sun Renze's leg hair, hung a Coke bottle filled with water on Sun Renze's genitals, or pinched his genitals with plastic gloves. Pulling out pubic hair, applying towels to the face and pouring water on the face were mostly done by Liu Xianyong. During the trial, Liu Xianyong admitted the above behavior, \"I wanted to insult Sun Renze's personality and destroy his psychological defense.\"\nIf there is another movement, there will probably be many young people like this.\nOnce the Pandora's box of evil in human nature is opened, everyone may become crazy and violent, and become less like a human being.\nFinally, the lawyers’ defense point of view was also very ironic, ‘I hope the court will take into account the special circumstances of cracking down on gangs and evil at that time, and based on the modesty of criminal law, it will be lenient to the defendant as appropriate. ’","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746476256802050286_0.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746476256802050286_1.jpg","videos":"","hasPublished":true},{"id":"1746476682855276808","name":"李老师不是你老师","createdDate":"2024-01-14 18:17:43","content":"Currently, topics related to \"frozen garlic\" have been banned on Weibo.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746476682855276808_0.jpg","videos":"","hasPublished":true},{"id":"1746479634097623074","name":"李老师不是你老师","createdDate":"2024-01-14 18:29:27","content":"On the evening of January 13, it was reported online that an old man drove an electric tricycle into Tiananmen Square East Road. According to the contributor, Beijing announced a notice on the control of electric tricycles in 2023, which will be implemented on January 1, 2024. There was no unified standard for this electric tricycle before, and most of them were driven by elderly people in their 50s and 60s, mainly to pick up children from school and go to the hospital. After all, it is not easy for the elderly of this age to ride an electric bike, and it is sometimes inconvenient to take the bus.\n\nFor example, the previous one in my family could be pushed directly into the wheelchair. The electric and oil-mixed tricycle had a purchase price of RMB 20,000+, but first of all, it was notified that it could be collected for 1,500 yuan, otherwise the car would be directly seized when it expired. Many Beijing residents called 12345 to complain, saying that it should be controlled from the source instead of directly confiscating people's legal property, but no effective feedback was received. A step back, if electric tricycles need to be managed, standardized operations such as license plates can also be carried out. Even Beijing's express delivery trucks are said to have been forced to pay out of their own pockets for new ones.\n\nNear the Second Ring Road in Beijing, the phenomenon of towing cars has basically started since December. People who don't cooperate will be left alone at first, but later there was a magical scene of stealing cars in the middle of the night. Unfortunately, we were young and not at home at the time, so we didn't record it. The general situation is: about 10 people secretly cut the chain of the electric car parked near the bungalow at one o'clock in the middle of the night, and several people blocked the door, and then 7-8 people directly lifted the car onto the trailer. The purpose is to carry out the operation with the least number of people, which is a blatant robbery and theft. But little do people know that the cost of these labors is much more expensive than this electric car.\n\nThe video was posted by someone on Douyin yesterday (January 13). An old man, because his car was going to be confiscated, probably thought that he had to hear a sound even if the car was gone, so he forced his way into the vicinity of Tiananmen Square and drove wildly~ He also hooked out the surrounding plainclothes police to intercept together.","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/14/1746479634097623074_0.jpg","hasPublished":true},{"id":"1746481782956982385","name":"李老师不是你老师","createdDate":"2024-01-14 18:37:59","content":"Errata, Taiyuan City Shanxi Grand Theater","images":"","videos":"","hasPublished":true},{"id":"1746482207789642234","name":"李老师不是你老师","createdDate":"2024-01-14 18:39:41","content":"https://t.co/NOXtXL3rmi","images":"","videos":"/tweet/video/whyyoutouzhele/2024/01/14/1746482207789642234_0.jpg","hasPublished":true},{"id":"1746483500553830458","name":"李老师不是你老师","createdDate":"2024-01-14 18:44:49","content":"\"The Age of Male Beauty\"\nOn January 13, many Henan netizens reported that they had received a text message from the Henan Provincial Bureau of Culture and Tourism, calling on unmarried young men in each city who are over 180cm tall to report to the local Bureau of Culture and Tourism as soon as possible, actively cooperate with local dispatch work, and contribute to the tourism and cultural work of our province.\nJust when everyone was confused, on the 14th, a series of promotional videos of handsome men in Henan scenic spots came out.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746483500553830458_0.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746483500553830458_1.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746483500553830458_2.jpg","videos":"","hasPublished":true},{"id":"1746488865257308189","name":"李老师不是你老师","createdDate":"2024-01-14 19:06:08","content":"On January 14, the media reported that the delivery boy had earned 1.02 million in three years. This triggered doubts among netizens, and many netizens began to calculate his income. Some netizens also said that he was promoted by Meituan with all his resources. Netizens bluntly said: Don't sing praises to suffering, suffering has no meaning.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746488865257308189_0.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746488865257308189_1.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746488865257308189_2.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746488865257308189_3.jpg","videos":"","hasPublished":true},{"id":"1746489292954730900","name":"李老师不是你老师","createdDate":"2024-01-14 19:07:50","content":"Currently, this article has been deleted.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746489292954730900_0.jpg","videos":"","hasPublished":false},{"id":"1746496040088252578","name":"李老师不是你老师","createdDate":"2024-01-14 19:34:38","content":"On January 14, the movie \"Taylor Swift: The Time Tour\" was completely removed from theaters in Xi'an. \nIt was reported online that a fan was reported for planning to hold a rainbow flag while watching a movie in Xi'an. This led to the complete removal of the movie from theaters in Xi'an.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746496040088252578_0.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746496040088252578_1.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746496040088252578_2.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746496040088252578_3.jpg","videos":"","hasPublished":false},{"id":"1746502347105202304","name":"李老师不是你老师","createdDate":"2024-01-14 19:59:42","content":"At present, all the cultural and tourism bureaus across the country have begun to follow up","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746502347105202304_0.jpg","videos":"","hasPublished":false},{"id":"1746505289510085099","name":"李老师不是你老师","createdDate":"2024-01-14 20:11:24","content":"Netizen contribution\nUnder a news report about a teacher in Hangzhou who stopped students who were still writing in the middle of the night, parents left messages saying that their children had to write until midnight every day.\nSome parents said that their children had to stay up until two or three in the morning to write.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746505289510085099_0.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746505289510085099_1.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746505289510085099_2.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746505289510085099_3.jpg","videos":"","hasPublished":false},{"id":"1746541608143634888","name":"李老师不是你老师","createdDate":"2024-01-14 22:35:43","content":"Some fans refuted the rumor, saying that no one actually planned to raise the rainbow flag at the scene, but because two Taylor Swift fan groups were competing for a private screening, one of the fan groups reported the other fan group to the public security organs, and the severity of the matter was beyond their imagination, causing all the movies in the city to be taken offline.\nThe whole thing is very consistent with the class struggle during the Cultural Revolution.","images":"/tweet/image/whyyoutouzhele/2024/01/14/1746541608143634888_0.jpg,/tweet/image/whyyoutouzhele/2024/01/14/1746541608143634888_1.jpg","videos":"","hasPublished":false}]