[{"id":"1860360841020707060","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 00:45:02","content":"On the morning of November 22, nearly 100 retired comrades from the Shenzhen Press Group gathered at the Shenzhen Press Building on Shennan Road, hoping to have a dialogue with the group's president, Ding, to safeguard their legitimate rights and interests.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860483781116694699","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 08:49:06","content":"\"Non-violent non-cooperation\" Shantou notified that no reason should be given for closing down and refusing inspection, so the shop owners posted the reasons for closing down at the door:","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860512280296980792","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 10:35:04","content":"On November 20, villagers from Xiaonanhe Village in Tianjin gathered and poured into the Social Conflict Mediation and Resolution Center of Jingwu Town to defend their rights and demand housing allocation.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860512999586562531","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 10:50:17","content":"Prior to this, on November 15, villagers also gathered in front of the government building to defend their rights. According to a video circulated online, the housing construction and distribution plan of Xiaonanhe Village has been decided for more than ten years, and the division of plots was drawn by lot four years ago. The villagers have also paid more than 10,000 yuan in housing price difference, but are still waiting for the distribution of houses.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860536456718287296","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 12:21:07","content":"Guangzhou's multi-million-level riverside luxury house, Shangdu Xuanwan by the River, was exposed to serious quality problems. Owners held umbrellas and put up signs to protect their rights in their cars. According to the video, the building had serious quality problems such as a sudden drop in the elevator, tilted exterior walls, use of inferior and harmful materials, hollow floors, uneven ground, water leaks in the house, and large areas of water seepage in the underground parking lot. One owner joked that this was a resettlement house with a riverside view.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860541227332165985","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 12:36:20","content":"On November 4, owners of Country Garden Jade Mansion in Jinxiang County, Jining, Shandong Province, held up banners to protest the unfinished project and demanded that the government take charge. The banners read: \"We don't make trouble to protect our rights, we just want to go home early. We don't have to be afraid of the powerful. We have the party and the country's laws.\" \"The government that serves the people, please take charge for the people.\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860562852702277642","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 14:07:10","content":"On November 4, owners of Country Garden Jade Mansion in Jinxiang County, Jining, Shandong Province, held up banners to protest the unfinished project and demanded that the government take charge. The banners read: \"We don't make trouble to protect our rights, we just want to go home early. We don't have to be afraid of the powerful. We have the party and the country's laws.\" \"The government that serves the people, please take charge for the people.\"","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860572139801444698","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 14:37:31","content":"On the evening of November 21, a large number of police were dispatched to maintain stability in the Aiqing Tianchen Wanxiang community in Chongqing due to the rights protection of the owners. It is reported that the developer of the community delayed the delivery of the houses, but did not pay the liquidated damages to the owners. At the same time, the community garage was not qualified for acceptance but had already started charging, so the owners gathered to protect their rights.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860580977644568811","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 15:07:51","content":"On November 12, in Xianyang, Shaanxi, several workers held banners on a bridge to demand their wages. One of the policemen yelled at the workers: \"Are you crazy?\" The policeman then tore up the workers' banners.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860583648594104361","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 15:23:04","content":"On November 2, the owners of Tianyu·Yuanzhu in Nanchong, Sichuan, protested against the unfinished project and were driven away by a large number of police. The police and the owners fought with each other, and the owners shouted: \"The police are beating people!\" The police tried to take people away, but were surrounded by the owners to stop them. During the process, some owners were handcuffed. The owners threatened to call 12315 to complain.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860589637972164957","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 15:53:25","content":"Yunnan Honghe Prefecture Jinlong Wealth Center suddenly ran away with the money. On November 18, the victims gathered outside the wealth center to defend their rights. The video shows that the victims are mostly elderly people.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860594249370358002","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 16:08:38","content":"On November 22, in Xixian New District, Xi'an, residents of nearby communities gathered to protest their rights because the No. 2 Primary School and No. 2 Middle School did not honor the contract with a prestigious school promised when they bought their house. Videos showed that while parents were shouting slogans in unison to protest their rights, many staff members in order maintenance uniforms were patrolling back and forth, and loud speakers were used to warn parents that they would be punished by public security management and even held criminally responsible.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860600252308554121","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 16:38:58","content":"Supplement: On November 16, the owners of the 10 million-dollar river view mansion at Suhewan No. 1 personally took action to defend their rights. The police dispatched at least two buses of police to maintain stability.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860604872477020353","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 16:54:11","content":"On November 14, some netizens observed that only three days after the Zhuhai incident, Shenzhen placed stone pillars in the park. Some netizens in the comment section questioned: If there is an emergency in the future, these stone pillars will block fire trucks and ambulances. Some netizens also asked what disabled people should do?","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860607004353683966","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 16:54:17","content":"On November 15, a woman said that her father who had been missing for 18 years was found in Shanxi. During the 18 years that her father had been missing, he had been working in a black brick kiln, moving around in 15 factories. Her father said that he would be beaten if he didn't work. Because he had a stroke and hemiplegia and couldn't continue to work, he was thrown under a bridge in Changzhi by the black brick kiln and given a walking stick and 510 yuan. According to the parties involved, there are at least 31 people in these black brick kilns, all of whom may be from Guizhou.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860610116523049340","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 17:09:30","content":"According to online reports, on November 23, a student from a local vocational school in Jianghua County, Yongzhou, Hunan, and a second student from a secondary school had an emotional dispute over the same girlfriend and stabbed the person in the throat with a sword in the street. The person died despite rescue efforts.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860611759213838576","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 17:24:43","content":"At noon on November 23, the exterior glass of Yintai Center in Luyang District, Hefei fell from a height and hit a person on the head.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860614184427479170","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 17:24:49","content":"On November 22, the Hengdong County Traffic Police issued a notice stating that starting from today, some roads around schools will be subject to time restrictions, prohibiting motor vehicles and electric bicycles from entering and leaving school. However, it is strange that the notice only covers three primary schools.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860617962992079293","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 17:40:02","content":"On November 20, 2024, a teacher beat a student at Wushen Banner Experimental Primary School in Ordos, Inner Mongolia. Hai Riya, a second-grade Mongolian student, was beaten several times by her teacher Liang Yuxia because she failed to complete her homework on time, resulting in severe ear lacerations that required multiple stitches, and severe bleeding in her mouth.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860626168690655305","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 18:10:22","content":"On November 20, Yao Qian, former director of the Science and Technology Supervision Department of the China Securities Regulatory Commission, was expelled from the party and removed from office for using virtual currency for power-for-money transactions. Some netizens dug up that he had said in 2017 when he was working at the central bank: Bitcoin has no value anchor and it is difficult to become a real currency.","hasFullContentTranslated":true,"hasPublished":false},{"id":"1860627122647400626","name":"李老师不是你老师","accountId":"whyyoutouzhele","sensitive":false,"createdDate":"2024-11-24 18:25:35","content":"On November 23, a murder occurred near Guanghui Kindergarten in Chao'an District, Chaozhou, Guangdong. A man hacked a woman to death on the street.","hasFullContentTranslated":true,"hasPublished":false}]